iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
#define System_Control_Space_NVIC_0 (*(volatile struct System_Control_Space_NVIC_0_tag *) 0xe000e100)

struct System_Control_Space_SysTick_0_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t ENABLE:1;
			uint64_t TICKINT:1;
			uint64_t CLKSOURCE:1;
			uint64_t reservedSpace0:13;
			uint64_t COUNTFLAG:1;
		} __attribute__((packed)) B;
	} SYST_CSR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RELOAD:24;
		} __attribute__((packed)) B;
	} SYST_RVR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CURRENT:24;
		} __attribute__((packed)) B;
	} SYST_CVR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TENMS:24;
			uint64_t reservedSpace0:6;
			uint64_t SKEW:1;
			uint64_t NOREF:1;
		} __attribute__((packed)) B;
	} SYST_CALIB;

} __attribute__((packed));

#define System_Control_Space_SysTick_0 (*(volatile struct System_Control_Space_SysTick_0_tag *) 0xe000e010)

struct System_Control_Space_Memory_Protection_Unit_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEPARATE:1;
			uint64_t reservedSpace0:7;
			uint64_t DREGION:8;
			uint64_t IREGION:8;
		} __attribute__((packed)) B;
	} MPU_TYPE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ENABLE:1;
			uint64_t HFNMIENA:1;
			uint64_t PRIVDEFENA:1;
		} __attribute__((packed)) B;
	} MPU_CTRL;

	uint8_t MPU_RNR;
	uint8_t res0[3];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REGION:4;
			uint64_t VALID:1;
			uint64_t ADDR:27;
		} __attribute__((packed)) B;
	} MPU_RBAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ENABLE:1;
			uint64_t SIZE:5;
			uint64_t reservedSpace0:2;
			uint64_t SRD:8;
			uint64_t B:1;
			uint64_t C:1;
			uint64_t S:1;
			uint64_t TEX:3;
			uint64_t reservedSpace1:2;
			uint64_t AP:3;
			uint64_t reservedSpace2:1;
			uint64_t XN:1;
		} __attribute__((packed)) B;
	} MPU_RASR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REGION:4;
			uint64_t VALID:1;
		} __attribute__((packed)) B;
	} MPU_RBAR_A1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ENABLE:1;
			uint64_t SIZE:5;
			uint64_t reservedSpace0:2;
			uint64_t SRD:8;
			uint64_t B:1;
			uint64_t C:1;
			uint64_t S:1;
			uint64_t TEX:3;
			uint64_t reservedSpace1:2;
			uint64_t AP:3;
			uint64_t reservedSpace2:1;
			uint64_t XN:1;
		} __attribute__((packed)) B;
	} MPU_RASR_A1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REGION:4;
			uint64_t VALID:1;
		} __attribute__((packed)) B;
	} MPU_RBAR_A2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ENABLE:1;
			uint64_t SIZE:5;
			uint64_t reservedSpace0:2;
			uint64_t SRD:8;
			uint64_t B:1;
			uint64_t C:1;
			uint64_t S:1;
			uint64_t TEX:3;
			uint64_t reservedSpace1:2;
			uint64_t AP:3;
			uint64_t reservedSpace2:1;
			uint64_t XN:1;
		} __attribute__((packed)) B;
	} MPU_RASR_A2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REGION:4;
			uint64_t VALID:1;
		} __attribute__((packed)) B;
	} MPU_RBAR_A3;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ENABLE:1;
			uint64_t SIZE:5;
			uint64_t reservedSpace0:2;
			uint64_t SRD:8;
			uint64_t B:1;
			uint64_t C:1;
			uint64_t S:1;
			uint64_t TEX:3;
			uint64_t reservedSpace1:2;
			uint64_t AP:3;
			uint64_t reservedSpace2:1;
			uint64_t XN:1;
		} __attribute__((packed)) B;
	} MPU_RASR_A3;

} __attribute__((packed));

#define System_Control_Space_Memory_Protection_Unit (*(volatile struct System_Control_Space_Memory_Protection_Unit_tag *) 0xe000ed90)

struct System_Control_Space_System_Control_Block_1_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t VARIANT:4;
			uint64_t PARTNO:12;
			uint64_t reservedSpace0:4;
			uint64_t REVISION:4;
			uint64_t IMPLEMENTER:8;
		} __attribute__((packed)) B;
	} CPUID;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VECTACTIVE:8;
			uint64_t reservedSpace0:3;
			uint64_t RETTOBASE:1;
			uint64_t VECTPENDING:10;
			uint64_t ISRPENDING:1;
			uint64_t ISRPREEMPT:1;
			uint64_t reservedSpace1:1;
			uint64_t PENDSTCLR:1;
			uint64_t PENDSTSET:1;
			uint64_t PENDSVCLR:1;
			uint64_t PENDSVSET:1;
			uint64_t reservedSpace2:2;
			uint64_t NMIPENDSET:1;
		} __attribute__((packed)) B;
	} ICSR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:7;
			uint64_t TBLOFF:22;
			uint64_t TBLBASE:1;
		} __attribute__((packed)) B;
	} VTOR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VECTRESET:1;
			uint64_t VECTCLRACTIVE:1;
			uint64_t SYSRESETREQ:1;
			uint64_t reservedSpace0:5;
			uint64_t PRIGROUP:3;
			uint64_t reservedSpace1:4;
			uint64_t ENDIANESS:1;
			uint64_t VECTKEYVECTKEYSTAT:16;
		} __attribute__((packed)) B;
	} AIRCR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t SLEEPONEXIT:1;
			uint64_t SLEEPDEEP:1;
			uint64_t reservedSpace1:1;
			uint64_t SEVONPEND:1;
		} __attribute__((packed)) B;
	} SCR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t NONEBASETHRDENA:1;
			uint64_t USERSETMPEND:1;
			uint64_t reservedSpace0:1;
			uint64_t UNALIGN_TRP:1;
			uint64_t DIV_0_TRP:1;
			uint64_t reservedSpace1:3;
			uint64_t BFHFNMIGN:1;
			uint64_t STKALIGN:1;
		} __attribute__((packed)) B;
	} CCR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_4:8;
			uint64_t PRI_5:8;
			uint64_t PRI_6:8;
		} __attribute__((packed)) B;
	} SHPR1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:24;
			uint64_t PRI_11:8;
		} __attribute__((packed)) B;
	} SHPR2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t PRI_14:8;
			uint64_t PRI_15:8;
		} __attribute__((packed)) B;
	} SHPR3;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MEMFAULTACT:1;
			uint64_t BUSFAULTACT:1;
			uint64_t reservedSpace0:1;
			uint64_t USGFAULTACT:1;
			uint64_t reservedSpace1:3;
			uint64_t SVCALLACT:1;
			uint64_t MONITORACT:1;
			uint64_t reservedSpace2:1;
			uint64_t PENDSVACT:1;
			uint64_t SYSTICKACT:1;
			uint64_t USGFAULTPENDED:1;
			uint64_t MEMFAULTPENDED:1;
			uint64_t BUSFAULTPENDED:1;
			uint64_t SVCALLPENDED:1;
			uint64_t MEMFAULTENA:1;
			uint64_t BUSFAULTENA:1;
			uint64_t USGFAULTENA:1;
		} __attribute__((packed)) B;
	} SHCRS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t IACCVIOL:1;
			uint64_t DACCVIOL:1;
			uint64_t reservedSpace0:1;
			uint64_t MUNSTKERR:1;
			uint64_t MSTKERR:1;
			uint64_t reservedSpace1:2;
			uint64_t MMARVALID:1;
			uint64_t IBUSERR:1;
			uint64_t PRECISERR:1;
			uint64_t IMPRECISERR:1;
			uint64_t UNSTKERR:1;
			uint64_t STKERR:1;
			uint64_t reservedSpace2:2;
			uint64_t BFARVALID:1;
			uint64_t UNDEFINSTR:1;
			uint64_t INVSTATE:1;
			uint64_t INVPC:1;
			uint64_t NOCP:1;
			uint64_t reservedSpace3:4;
			uint64_t UNALIGNED:1;
			uint64_t DIVBYZERO:1;
		} __attribute__((packed)) B;
	} CFSR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t VECTTBL:1;
			uint64_t reservedSpace1:28;
			uint64_t FORCED:1;
			uint64_t DEBUGEVT:1;
		} __attribute__((packed)) B;
	} HFSR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HALTED:1;
			uint64_t BKPT:1;
			uint64_t DWTTRAP:1;
			uint64_t VCATCH:1;
			uint64_t EXTERNAL:1;
		} __attribute__((packed)) B;
	} DFSR;

	uint32_t MMFAR;
	uint32_t BFAR;
	uint32_t AFSR;
	uint32_t PFR0;
	uint32_t PFR1;
	uint32_t DFR0;
	uint32_t AFR0;
	uint32_t MMFR0;
	uint32_t MMFR1;
	uint32_t MMFR2;
	uint32_t MMFR3;
	uint32_t ISAR0;
	uint32_t ISAR1;
	uint32_t ISAR2;
	uint32_t ISAR3;
	uint32_t ISAR4;
	uint8_t res0[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CP0:2;
			uint64_t CP1:2;
			uint64_t CP2:2;
			uint64_t CP3:2;
			uint64_t CP4:2;
			uint64_t CP5:2;
			uint64_t CP6:2;
			uint64_t CP7:2;
			uint64_t reservedSpace0:4;
			uint64_t CP10:2;
			uint64_t CP11:2;
		} __attribute__((packed)) B;
	} CPACR;

} __attribute__((packed));

#define System_Control_Space_System_Control_Block_1 (*(volatile struct System_Control_Space_System_Control_Block_1_tag *) 0xe000ed00)

struct System_Control_Space_System_Control_and_ID_1_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t INTLINESNUM:4;
		} __attribute__((packed)) B;
	} ICTR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DISMCYCINT:1;
			uint64_t DISDEFWBUF:1;
			uint64_t DISFOLD:1;
		} __attribute__((packed)) B;
	} ACTLR;

	uint8_t res0[3828];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INTID:9;
		} __attribute__((packed)) B;
	} STIR;

	uint8_t res1[204];

	uint32_t PID4;
	uint32_t PID5;
	uint32_t PID6;
	uint32_t PID7;
	uint32_t PID0;
	uint32_t PID1;
	uint32_t PID2;
	uint32_t PID3;
	uint32_t CID0;
	uint32_t CID1;
	uint32_t CID2;
	uint32_t CID3;
} __attribute__((packed));

