iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
#define System_Control_Space_System_Control_and_ID_1 (*(volatile struct System_Control_Space_System_Control_and_ID_1_tag *) 0xe000e004)

struct System_Control_Space_NVIC_1_tag
{
	uint32_t INT_0_31_SET_EN;
	uint32_t INT_32_63_SET_EN;
	uint32_t INT_64_95_SET_EN;
	uint32_t INT_96_127_SET_EN;
	uint32_t INT_128_159_SET_EN;
	uint32_t INT_160_191_SET_EN;
	uint32_t INT_192_223_SET_EN;
	uint16_t INT_224_239_SET_EN;
	uint8_t res0[98];

	uint32_t INT_0_31_CLR_EN;
	uint32_t INT_32_63_CLR_EN;
	uint32_t INT_64_95_CLR_EN;
	uint32_t INT_96_127_CLR_EN;
	uint32_t INT_128_159_CLR_EN;
	uint32_t INT_160_191_CLR_EN;
	uint32_t INT_192_223_CLR_EN;
	uint16_t INT_224_239_CLR_EN;
	uint8_t res1[98];

	uint32_t INT_0_31_SET_PEND;
	uint32_t INT_32_63_SET_PEND;
	uint32_t INT_64_95_SET_PEND;
	uint32_t INT_96_127_SET_PEND;
	uint32_t INT_128_159_SET_PEND;
	uint32_t INT_160_191_SET_PEND;
	uint32_t INT_192_223_SET_PEND;
	uint16_t INT_224_239_SET_PEND;
	uint8_t res2[98];

	uint32_t INT_0_31_CLR_PEND;
	uint32_t INT_32_63_CLR_PEND;
	uint32_t INT_64_95_CLR_PEND;
	uint32_t INT_96_127_CLR_PEND;
	uint32_t INT_128_159_CLR_PEND;
	uint32_t INT_160_191_CLR_PEND;
	uint32_t INT_192_223_CLR_PEND;
	uint16_t INT_224_239_CLR_PEND;
	uint8_t res3[98];

	uint32_t INT_0_31_ACT;
	uint32_t INT_32_63_ACT;
	uint32_t INT_64_95_ACT;
	uint32_t INT_96_127_ACT;
	uint32_t INT_128_159_ACT;
	uint32_t INT_160_191_ACT;
	uint32_t INT_192_223_ACT;
	uint16_t INT_224_239_ACT;
	uint8_t res4[226];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_0:8;
			uint64_t PRI_1:8;
			uint64_t PRI_2:8;
			uint64_t PRI_3:8;
		} __attribute__((packed)) B;
	} INT_0_3_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_4:8;
			uint64_t PRI_5:8;
			uint64_t PRI_6:8;
			uint64_t PRI_7:8;
		} __attribute__((packed)) B;
	} INT_4_7_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_8:8;
			uint64_t PRI_9:8;
			uint64_t PRI_10:8;
			uint64_t PRI_11:8;
		} __attribute__((packed)) B;
	} INT_8_11_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_12:8;
			uint64_t PRI_13:8;
			uint64_t PRI_14:8;
			uint64_t PRI_15:8;
		} __attribute__((packed)) B;
	} INT_12_15_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_16:8;
			uint64_t PRI_17:8;
			uint64_t PRI_18:8;
			uint64_t PRI_19:8;
		} __attribute__((packed)) B;
	} INT_16_19_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_20:8;
			uint64_t PRI_21:8;
			uint64_t PRI_22:8;
			uint64_t PRI_23:8;
		} __attribute__((packed)) B;
	} INT_20_23_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_24:8;
			uint64_t PRI_25:8;
			uint64_t PRI_26:8;
			uint64_t PRI_27:8;
		} __attribute__((packed)) B;
	} INT_24_27_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_28:8;
			uint64_t PRI_29:8;
			uint64_t PRI_30:8;
			uint64_t PRI_31:8;
		} __attribute__((packed)) B;
	} INT_28_31_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_32:8;
			uint64_t PRI_33:8;
			uint64_t PRI_34:8;
			uint64_t PRI_35:8;
		} __attribute__((packed)) B;
	} INT_32_35_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_36:8;
			uint64_t PRI_37:8;
			uint64_t PRI_38:8;
			uint64_t PRI_39:8;
		} __attribute__((packed)) B;
	} INT_36_39_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_40:8;
			uint64_t PRI_41:8;
			uint64_t PRI_42:8;
			uint64_t PRI_43:8;
		} __attribute__((packed)) B;
	} INT_40_43_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_44:8;
			uint64_t PRI_45:8;
			uint64_t PRI_46:8;
			uint64_t PRI_47:8;
		} __attribute__((packed)) B;
	} INT_44_47_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_48:8;
			uint64_t PRI_49:8;
			uint64_t PRI_50:8;
			uint64_t PRI_51:8;
		} __attribute__((packed)) B;
	} INT_48_51_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_52:8;
			uint64_t PRI_53:8;
			uint64_t PRI_54:8;
			uint64_t PRI_55:8;
		} __attribute__((packed)) B;
	} INT_52_55_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_56:8;
			uint64_t PRI_57:8;
			uint64_t PRI_58:8;
			uint64_t PRI_59:8;
		} __attribute__((packed)) B;
	} INT_56_59_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_60:8;
			uint64_t PRI_61:8;
			uint64_t PRI_62:8;
			uint64_t PRI_63:8;
		} __attribute__((packed)) B;
	} INT_60_63_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_64:8;
			uint64_t PRI_65:8;
			uint64_t PRI_66:8;
			uint64_t PRI_67:8;
		} __attribute__((packed)) B;
	} INT_64_67_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_68:8;
			uint64_t PRI_69:8;
			uint64_t PRI_70:8;
			uint64_t PRI_71:8;
		} __attribute__((packed)) B;
	} INT_68_71_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_72:8;
			uint64_t PRI_73:8;
			uint64_t PRI_74:8;
			uint64_t PRI_75:8;
		} __attribute__((packed)) B;
	} INT_72_75_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_76:8;
			uint64_t PRI_77:8;
			uint64_t PRI_78:8;
			uint64_t PRI_79:8;
		} __attribute__((packed)) B;
	} INT_76_79_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_80:8;
			uint64_t PRI_81:8;
			uint64_t PRI_82:8;
			uint64_t PRI_83:8;
		} __attribute__((packed)) B;
	} INT_80_83_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_84:8;
			uint64_t PRI_85:8;
			uint64_t PRI_86:8;
			uint64_t PRI_87:8;
		} __attribute__((packed)) B;
	} INT_84_87_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_88:8;
			uint64_t PRI_89:8;
			uint64_t PRI_90:8;
			uint64_t PRI_91:8;
		} __attribute__((packed)) B;
	} INT_88_91_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_92:8;
			uint64_t PRI_93:8;
			uint64_t PRI_94:8;
			uint64_t PRI_95:8;
		} __attribute__((packed)) B;
	} INT_92_95_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_96:8;
			uint64_t PRI_97:8;
			uint64_t PRI_98:8;
			uint64_t PRI_99:8;
		} __attribute__((packed)) B;
	} INT_96_99_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_100:8;
			uint64_t PRI_101:8;
			uint64_t PRI_102:8;
			uint64_t PRI_103:8;
		} __attribute__((packed)) B;
	} INT_100_103_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_104:8;
			uint64_t PRI_105:8;
			uint64_t PRI_106:8;
			uint64_t PRI_107:8;
		} __attribute__((packed)) B;
	} INT_104_107_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_108:8;
			uint64_t PRI_109:8;
			uint64_t PRI_110:8;
			uint64_t PRI_111:8;
		} __attribute__((packed)) B;
	} INT_108_111_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_112:8;
			uint64_t PRI_113:8;
			uint64_t PRI_114:8;
			uint64_t PRI_115:8;
		} __attribute__((packed)) B;
	} INT_112_115_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_116:8;
			uint64_t PRI_117:8;
			uint64_t PRI_118:8;
			uint64_t PRI_119:8;
		} __attribute__((packed)) B;
	} INT_116_119_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_120:8;
			uint64_t PRI_121:8;
			uint64_t PRI_122:8;
			uint64_t PRI_123:8;
		} __attribute__((packed)) B;
	} INT_120_123_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_124:8;
			uint64_t PRI_125:8;
			uint64_t PRI_126:8;
			uint64_t PRI_127:8;
		} __attribute__((packed)) B;
	} INT_124_127_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_128:8;
			uint64_t PRI_129:8;
			uint64_t PRI_130:8;
			uint64_t PRI_131:8;
		} __attribute__((packed)) B;
	} INT_128_131_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_132:8;
			uint64_t PRI_133:8;
			uint64_t PRI_134:8;
			uint64_t PRI_135:8;
		} __attribute__((packed)) B;
	} INT_132_135_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_136:8;
			uint64_t PRI_137:8;
			uint64_t PRI_138:8;
			uint64_t PRI_139:8;
		} __attribute__((packed)) B;
	} INT_136_139_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_140:8;
			uint64_t PRI_141:8;
			uint64_t PRI_142:8;
			uint64_t PRI_143:8;
		} __attribute__((packed)) B;
	} INT_140_143_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_144:8;
			uint64_t PRI_145:8;
			uint64_t PRI_146:8;
			uint64_t PRI_147:8;
		} __attribute__((packed)) B;
	} INT_144_147_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_148:8;
			uint64_t PRI_149:8;
			uint64_t PRI_150:8;
			uint64_t PRI_151:8;
		} __attribute__((packed)) B;
	} INT_148_151_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_152:8;
			uint64_t PRI_153:8;
			uint64_t PRI_154:8;
			uint64_t PRI_155:8;
		} __attribute__((packed)) B;
	} INT_152_155_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_156:8;
			uint64_t PRI_157:8;
			uint64_t PRI_158:8;
			uint64_t PRI_159:8;
		} __attribute__((packed)) B;
	} INT_156_159_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_160:8;
			uint64_t PRI_161:8;
			uint64_t PRI_162:8;
			uint64_t PRI_163:8;
		} __attribute__((packed)) B;
	} INT_160_163_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_164:8;
			uint64_t PRI_165:8;
			uint64_t PRI_166:8;
			uint64_t PRI_167:8;
		} __attribute__((packed)) B;
	} INT_164_167_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_168:8;
			uint64_t PRI_169:8;
			uint64_t PRI_170:8;
			uint64_t PRI_171:8;
		} __attribute__((packed)) B;
	} INT_168_171_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_172:8;
			uint64_t PRI_173:8;
			uint64_t PRI_174:8;
			uint64_t PRI_175:8;
		} __attribute__((packed)) B;
	} INT_172_175_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_176:8;
			uint64_t PRI_177:8;
			uint64_t PRI_178:8;
			uint64_t PRI_179:8;
		} __attribute__((packed)) B;
	} INT_176_179_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_180:8;
			uint64_t PRI_181:8;
			uint64_t PRI_182:8;
			uint64_t PRI_183:8;
		} __attribute__((packed)) B;
	} INT_180_183_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_184:8;
			uint64_t PRI_185:8;
			uint64_t PRI_186:8;
			uint64_t PRI_187:8;
		} __attribute__((packed)) B;
	} INT_184_187_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_188:8;
			uint64_t PRI_189:8;
			uint64_t PRI_190:8;
			uint64_t PRI_191:8;
		} __attribute__((packed)) B;
	} INT_188_191_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_192:8;
			uint64_t PRI_193:8;
			uint64_t PRI_194:8;
			uint64_t PRI_195:8;
		} __attribute__((packed)) B;
	} INT_192_195_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_196:8;
			uint64_t PRI_197:8;
			uint64_t PRI_198:8;
			uint64_t PRI_199:8;
		} __attribute__((packed)) B;
	} INT_196_199_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_200:8;
			uint64_t PRI_201:8;
			uint64_t PRI_202:8;
			uint64_t PRI_203:8;
		} __attribute__((packed)) B;
	} INT_200_203_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_204:8;
			uint64_t PRI_205:8;
			uint64_t PRI_206:8;
			uint64_t PRI_207:8;
		} __attribute__((packed)) B;
	} INT_204_207_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_208:8;
			uint64_t PRI_209:8;
			uint64_t PRI_210:8;
			uint64_t PRI_211:8;
		} __attribute__((packed)) B;
	} INT_208_211_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_212:8;
			uint64_t PRI_213:8;
			uint64_t PRI_214:8;
			uint64_t PRI_215:8;
		} __attribute__((packed)) B;
	} INT_212_215_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_216:8;
			uint64_t PRI_217:8;
			uint64_t PRI_218:8;
			uint64_t PRI_219:8;
		} __attribute__((packed)) B;
	} INT_216_219_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_220:8;
			uint64_t PRI_221:8;
			uint64_t PRI_222:8;
			uint64_t PRI_223:8;
		} __attribute__((packed)) B;
	} INT_220_223_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_224:8;
			uint64_t PRI_225:8;
			uint64_t PRI_226:8;
			uint64_t PRI_227:8;
		} __attribute__((packed)) B;
	} INT_224_227_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_228:8;
			uint64_t PRI_229:8;
			uint64_t PRI_230:8;
			uint64_t PRI_231:8;
		} __attribute__((packed)) B;
	} INT_228_231_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_232:8;
			uint64_t PRI_233:8;
			uint64_t PRI_234:8;
			uint64_t PRI_235:8;
		} __attribute__((packed)) B;
	} INT_232_235_PRI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRI_236:8;
			uint64_t PRI_237:8;
			uint64_t PRI_238:8;
			uint64_t PRI_239:8;
		} __attribute__((packed)) B;
	} INT_236_239_PRI;

} __attribute__((packed));

#define System_Control_Space_NVIC_1 (*(volatile struct System_Control_Space_NVIC_1_tag *) 0xe000e100)

struct System_Control_Space_SysTick_1_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t ENABLE:1;
			uint64_t TICKINT:1;
			uint64_t CLKSOURCE:1;
			uint64_t reservedSpace0:13;
			uint64_t COUNTFLAG:1;
		} __attribute__((packed)) B;
	} SYST_CSR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RELOAD:24;
		} __attribute__((packed)) B;
	} SYST_RVR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CURRENT:24;
		} __attribute__((packed)) B;
	} SYST_CVR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TENMS:24;
			uint64_t reservedSpace0:6;
			uint64_t SKEW:1;
			uint64_t NOREF:1;
		} __attribute__((packed)) B;
	} SYST_CALIB;

} __attribute__((packed));

#define System_Control_Space_SysTick_1 (*(volatile struct System_Control_Space_SysTick_1_tag *) 0xe000e010)

struct MSC_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDRFAULTEN:1;
			uint64_t CLKDISFAULTEN:1;
			uint64_t PWRUPONDEMAND:1;
			uint64_t IFCREADCLEAR:1;
			uint64_t TIMEOUTFAULTEN:1;
			uint64_t RAMECCERRFAULTEN:1;
			uint64_t EBIFAULTEN:1;
			uint64_t reservedSpace0:5;
			uint64_t WAITMODE:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:3;
			uint64_t IFCDIS:1;
			uint64_t AIDIS:1;
			uint64_t ICCDIS:1;
			uint64_t EBICDIS:1;
			uint64_t reservedSpace1:1;
			uint64_t PREFETCH:1;
			uint64_t USEHPROT:1;
			uint64_t QSPICDIS:1;
			uint64_t reservedSpace2:13;
			uint64_t MODE:2;
			uint64_t reservedSpace3:2;
			uint64_t SCBTP:1;
		} __attribute__((packed)) B;
	} READCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t WREN:1;
			uint64_t IRQERASEABORT:1;
			uint64_t reservedSpace0:3;
			uint64_t RWWEN:1;
		} __attribute__((packed)) B;
	} WRITECTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LADDRIM:1;
			uint64_t ERASEPAGE:1;
			uint64_t WRITEEND:1;
			uint64_t WRITEONCE:1;
			uint64_t WRITETRIG:1;
			uint64_t ERASEABORT:1;
			uint64_t reservedSpace0:2;
			uint64_t ERASEMAIN0:1;
			uint64_t ERASEMAIN1:1;
			uint64_t reservedSpace1:2;
			uint64_t CLEARWDATA:1;
		} __attribute__((packed)) B;
	} WRITECMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDRB:32;
		} __attribute__((packed)) B;
	} ADDRB;

