iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
#define EMU (*(volatile struct EMU_tag *) 0x400e3000)

struct RMU_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t WDOGRMODE:3;
			uint64_t reservedSpace0:1;
			uint64_t LOCKUPRMODE:3;
			uint64_t reservedSpace1:1;
			uint64_t SYSRMODE:3;
			uint64_t reservedSpace2:1;
			uint64_t PINRMODE:3;
			uint64_t reservedSpace3:9;
			uint64_t RESETSTATE:2;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PORST:1;
			uint64_t reservedSpace0:1;
			uint64_t AVDDBOD:1;
			uint64_t DVDDBOD:1;
			uint64_t DECBOD:1;
			uint64_t reservedSpace1:3;
			uint64_t EXTRST:1;
			uint64_t LOCKUPRST:1;
			uint64_t SYSREQRST:1;
			uint64_t WDOGRST:1;
			uint64_t BUMODERST:1;
			uint64_t reservedSpace2:3;
			uint64_t EM4RST:1;
		} __attribute__((packed)) B;
	} RSTCAUSE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RCCLR:1;
		} __attribute__((packed)) B;
	} CMD;

	uint32_t RST;
	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOCKKEY:16;
		} __attribute__((packed)) B;
	} LOCK;

} __attribute__((packed));

#define RMU (*(volatile struct RMU_tag *) 0x400e5000)

struct CMU_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t CLKOUTSEL0:5;
			uint64_t CLKOUTSEL1:5;
			uint64_t CLKOUTSEL2:5;
			uint64_t reservedSpace0:1;
			uint64_t WSHFLE:1;
			uint64_t reservedSpace1:3;
			uint64_t HFPERCLKEN:1;
		} __attribute__((packed)) B;
	} CTRL;

	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TUNING:7;
			uint64_t reservedSpace0:1;
			uint64_t FINETUNING:6;
			uint64_t reservedSpace1:2;
			uint64_t FREQRANGE:5;
			uint64_t CMPBIAS:3;
			uint64_t LDOHP:1;
			uint64_t CLKDIV:2;
			uint64_t FINETUNINGEN:1;
			uint64_t VREFTC:4;
		} __attribute__((packed)) B;
	} USHFRCOCTRL;

	uint8_t res1[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TUNING:7;
			uint64_t reservedSpace0:1;
			uint64_t FINETUNING:6;
			uint64_t reservedSpace1:2;
			uint64_t FREQRANGE:5;
			uint64_t CMPBIAS:3;
			uint64_t LDOHP:1;
			uint64_t CLKDIV:2;
			uint64_t FINETUNINGEN:1;
			uint64_t VREFTC:4;
		} __attribute__((packed)) B;
	} HFRCOCTRL;

	uint8_t res2[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TUNING:7;
			uint64_t reservedSpace0:1;
			uint64_t FINETUNING:6;
			uint64_t reservedSpace1:2;
			uint64_t FREQRANGE:5;
			uint64_t CMPBIAS:3;
			uint64_t LDOHP:1;
			uint64_t CLKDIV:2;
			uint64_t FINETUNINGEN:1;
			uint64_t VREFTC:4;
		} __attribute__((packed)) B;
	} AUXHFRCOCTRL;

	uint8_t res3[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TUNING:9;
			uint64_t reservedSpace0:7;
			uint64_t ENVREF:1;
			uint64_t ENCHOP:1;
			uint64_t ENDEM:1;
			uint64_t reservedSpace1:1;
			uint64_t VREFUPDATE:2;
			uint64_t reservedSpace2:2;
			uint64_t TIMEOUT:2;
			uint64_t reservedSpace3:2;
			uint64_t GMCCURTUNE:4;
		} __attribute__((packed)) B;
	} LFRCOCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t reservedSpace0:1;
			uint64_t HFXOX2EN:1;
			uint64_t PEAKDETMODE:2;
			uint64_t reservedSpace1:18;
			uint64_t LFTIMEOUT:3;
			uint64_t reservedSpace2:1;
			uint64_t AUTOSTARTEM0EM1:1;
			uint64_t AUTOSTARTSELEM0EM1:1;
		} __attribute__((packed)) B;
	} HFXOCTRL;

	uint8_t res4[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t IBTRIMXOCORE:11;
			uint64_t CTUNE:9;
		} __attribute__((packed)) B;
	} HFXOSTARTUPCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t IBTRIMXOCORE:11;
			uint64_t CTUNE:9;
			uint64_t reservedSpace0:6;
			uint64_t PEAKDETEN:1;
			uint64_t PEAKMONEN:1;
		} __attribute__((packed)) B;
	} HFXOSTEADYSTATECTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STARTUPTIMEOUT:4;
			uint64_t STEADYTIMEOUT:4;
			uint64_t reservedSpace0:4;
			uint64_t PEAKDETTIMEOUT:4;
		} __attribute__((packed)) B;
	} HFXOTIMEOUTCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TUNING:7;
			uint64_t reservedSpace0:1;
			uint64_t MODE:2;
			uint64_t reservedSpace1:1;
			uint64_t GAIN:2;
			uint64_t reservedSpace2:1;
			uint64_t HIGHAMPL:1;
			uint64_t AGC:1;
			uint64_t CUR:2;
			uint64_t reservedSpace3:2;
			uint64_t BUFCUR:1;
			uint64_t reservedSpace4:3;
			uint64_t TIMEOUT:3;
		} __attribute__((packed)) B;
	} LFXOCTRL;

	uint8_t res5[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:1;
			uint64_t EDGESEL:1;
			uint64_t AUTORECOVER:1;
			uint64_t REFSEL:2;
			uint64_t reservedSpace0:1;
			uint64_t DITHEN:1;
		} __attribute__((packed)) B;
	} DPLLCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t M:12;
			uint64_t reservedSpace0:4;
			uint64_t N:12;
		} __attribute__((packed)) B;
	} DPLLCTRL1;

	uint8_t res6[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t UPSEL:3;
			uint64_t reservedSpace0:1;
			uint64_t DOWNSEL:4;
			uint64_t CONT:1;
			uint64_t reservedSpace1:7;
			uint64_t PRSUPSEL:5;
			uint64_t reservedSpace2:3;
			uint64_t PRSDOWNSEL:5;
		} __attribute__((packed)) B;
	} CALCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CALCNT:20;
		} __attribute__((packed)) B;
	} CALCNT;

	uint8_t res7[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HFRCOEN:1;
			uint64_t HFRCODIS:1;
			uint64_t HFXOEN:1;
			uint64_t HFXODIS:1;
			uint64_t AUXHFRCOEN:1;
			uint64_t AUXHFRCODIS:1;
			uint64_t LFRCOEN:1;
			uint64_t LFRCODIS:1;
			uint64_t LFXOEN:1;
			uint64_t LFXODIS:1;
			uint64_t USHFRCOEN:1;
			uint64_t USHFRCODIS:1;
			uint64_t DPLLEN:1;
			uint64_t DPLLDIS:1;
		} __attribute__((packed)) B;
	} OSCENCMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CALSTART:1;
			uint64_t CALSTOP:1;
			uint64_t reservedSpace0:2;
			uint64_t HFXOPEAKDETSTART:1;
		} __attribute__((packed)) B;
	} CMD;

	uint8_t res8[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DBG:2;
		} __attribute__((packed)) B;
	} DBGCLKSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HF:3;
		} __attribute__((packed)) B;
	} HFCLKSEL;

	uint8_t res9[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LFA:3;
		} __attribute__((packed)) B;
	} LFACLKSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LFB:3;
		} __attribute__((packed)) B;
	} LFBCLKSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LFE:3;
		} __attribute__((packed)) B;
	} LFECLKSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LFC:3;
		} __attribute__((packed)) B;
	} LFCCLKSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HFRCOENS:1;
			uint64_t HFRCORDY:1;
			uint64_t HFXOENS:1;
			uint64_t HFXORDY:1;
			uint64_t AUXHFRCOENS:1;
			uint64_t AUXHFRCORDY:1;
			uint64_t LFRCOENS:1;
			uint64_t LFRCORDY:1;
			uint64_t LFXOENS:1;
			uint64_t LFXORDY:1;
			uint64_t USHFRCOENS:1;
			uint64_t USHFRCORDY:1;
			uint64_t DPLLENS:1;
			uint64_t DPLLRDY:1;
			uint64_t reservedSpace0:2;
			uint64_t CALRDY:1;
			uint64_t SDIOCLKENS:1;
			uint64_t QSPI0CLKENS:1;
			uint64_t reservedSpace1:3;
			uint64_t HFXOPEAKDETRDY:1;
			uint64_t reservedSpace2:2;
			uint64_t HFXOAMPLOW:1;
			uint64_t reservedSpace3:1;
			uint64_t LFXOPHASE:1;
			uint64_t LFRCOPHASE:1;
			uint64_t ULFRCOPHASE:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SELECTED:3;
		} __attribute__((packed)) B;
	} HFCLKSTATUS;

	uint8_t res10[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t IBTRIMXOCORE:11;
			uint64_t reservedSpace0:5;
			uint64_t IBTRIMXOCOREMON:11;
			uint64_t reservedSpace1:3;
			uint64_t VALID:1;
			uint64_t MONVALID:1;
		} __attribute__((packed)) B;
	} HFXOTRIMSTATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HFRCORDY:1;
			uint64_t HFXORDY:1;
			uint64_t LFRCORDY:1;
			uint64_t LFXORDY:1;
			uint64_t AUXHFRCORDY:1;
			uint64_t CALRDY:1;
			uint64_t CALOF:1;
			uint64_t USHFRCORDY:1;
			uint64_t HFXODISERR:1;
			uint64_t HFXOAUTOSW:1;
			uint64_t reservedSpace0:1;
			uint64_t HFXOPEAKDETRDY:1;
			uint64_t reservedSpace1:1;
			uint64_t HFRCODIS:1;
			uint64_t LFTIMEOUTERR:1;
			uint64_t DPLLRDY:1;
			uint64_t DPLLLOCKFAILLOW:1;
			uint64_t DPLLLOCKFAILHIGH:1;
			uint64_t reservedSpace2:9;
			uint64_t LFXOEDGE:1;
			uint64_t LFRCOEDGE:1;
			uint64_t ULFRCOEDGE:1;
			uint64_t reservedSpace3:1;
			uint64_t CMUERR:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HFRCORDY:1;
			uint64_t HFXORDY:1;
			uint64_t LFRCORDY:1;
			uint64_t LFXORDY:1;
			uint64_t AUXHFRCORDY:1;
			uint64_t CALRDY:1;
			uint64_t CALOF:1;
			uint64_t USHFRCORDY:1;
			uint64_t HFXODISERR:1;
			uint64_t HFXOAUTOSW:1;
			uint64_t reservedSpace0:1;
			uint64_t HFXOPEAKDETRDY:1;
			uint64_t reservedSpace1:1;
			uint64_t HFRCODIS:1;
			uint64_t LFTIMEOUTERR:1;
			uint64_t DPLLRDY:1;
			uint64_t DPLLLOCKFAILLOW:1;
			uint64_t DPLLLOCKFAILHIGH:1;
			uint64_t reservedSpace2:9;
			uint64_t LFXOEDGE:1;
			uint64_t LFRCOEDGE:1;
			uint64_t ULFRCOEDGE:1;
			uint64_t reservedSpace3:1;
			uint64_t CMUERR:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HFRCORDY:1;
			uint64_t HFXORDY:1;
			uint64_t LFRCORDY:1;
			uint64_t LFXORDY:1;
			uint64_t AUXHFRCORDY:1;
			uint64_t CALRDY:1;
			uint64_t CALOF:1;
			uint64_t USHFRCORDY:1;
			uint64_t HFXODISERR:1;
			uint64_t HFXOAUTOSW:1;
			uint64_t reservedSpace0:1;
			uint64_t HFXOPEAKDETRDY:1;
			uint64_t reservedSpace1:1;
			uint64_t HFRCODIS:1;
			uint64_t LFTIMEOUTERR:1;
			uint64_t DPLLRDY:1;
			uint64_t DPLLLOCKFAILLOW:1;
			uint64_t DPLLLOCKFAILHIGH:1;
			uint64_t reservedSpace2:9;
			uint64_t LFXOEDGE:1;
			uint64_t LFRCOEDGE:1;
			uint64_t ULFRCOEDGE:1;
			uint64_t reservedSpace3:1;
			uint64_t CMUERR:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HFRCORDY:1;
			uint64_t HFXORDY:1;
			uint64_t LFRCORDY:1;
			uint64_t LFXORDY:1;
			uint64_t AUXHFRCORDY:1;
			uint64_t CALRDY:1;
			uint64_t CALOF:1;
			uint64_t USHFRCORDY:1;
			uint64_t HFXODISERR:1;
			uint64_t HFXOAUTOSW:1;
			uint64_t reservedSpace0:1;
			uint64_t HFXOPEAKDETRDY:1;
			uint64_t reservedSpace1:1;
			uint64_t HFRCODIS:1;
			uint64_t LFTIMEOUTERR:1;
			uint64_t DPLLRDY:1;
			uint64_t DPLLLOCKFAILLOW:1;
			uint64_t DPLLLOCKFAILHIGH:1;
			uint64_t reservedSpace2:9;
			uint64_t LFXOEDGE:1;
			uint64_t LFRCOEDGE:1;
			uint64_t ULFRCOEDGE:1;
			uint64_t reservedSpace3:1;
			uint64_t CMUERR:1;
		} __attribute__((packed)) B;
	} IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LE:1;
			uint64_t CRYPTO0_bitfield:1;
			uint64_t EBI_bitfield:1;
			uint64_t ETH_bitfield:1;
			uint64_t SDIO_bitfield:1;
			uint64_t GPIO_bitfield:1;
			uint64_t PRS_bitfield:1;
			uint64_t LDMA_bitfield:1;
			uint64_t GPCRC_bitfield:1;
			uint64_t QSPI0_bitfield:1;
			uint64_t USB_bitfield:1;
		} __attribute__((packed)) B;
	} HFBUSCLKEN0;

	uint8_t res11[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMER0_bitfield:1;
			uint64_t TIMER1_bitfield:1;
			uint64_t TIMER2_bitfield:1;
			uint64_t TIMER3_bitfield:1;
			uint64_t TIMER4_bitfield:1;
			uint64_t TIMER5_bitfield:1;
			uint64_t TIMER6_bitfield:1;
			uint64_t USART0_bitfield:1;
			uint64_t USART1_bitfield:1;
			uint64_t USART2_bitfield:1;
			uint64_t USART3_bitfield:1;
			uint64_t USART4_bitfield:1;
			uint64_t USART5_bitfield:1;
			uint64_t ACMP0_bitfield:1;
			uint64_t ACMP1_bitfield:1;
			uint64_t ACMP2_bitfield:1;
			uint64_t ACMP3_bitfield:1;
			uint64_t I2C0_bitfield:1;
			uint64_t I2C1_bitfield:1;
			uint64_t I2C2_bitfield:1;
			uint64_t ADC0_bitfield:1;
			uint64_t ADC1_bitfield:1;
			uint64_t CRYOTIMER_bitfield:1;
			uint64_t IDAC0_bitfield:1;
			uint64_t TRNG0_bitfield:1;
		} __attribute__((packed)) B;
	} HFPERCLKEN0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t WTIMER0_bitfield:1;
			uint64_t WTIMER1_bitfield:1;
			uint64_t WTIMER2_bitfield:1;
			uint64_t WTIMER3_bitfield:1;
			uint64_t UART0_bitfield:1;
			uint64_t UART1_bitfield:1;
			uint64_t CAN0_bitfield:1;
			uint64_t CAN1_bitfield:1;
			uint64_t VDAC0_bitfield:1;
			uint64_t CSEN_bitfield:1;
		} __attribute__((packed)) B;
	} HFPERCLKEN1;

