iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res12[24];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LETIMER0_bitfield:1;
			uint64_t LETIMER1_bitfield:1;
			uint64_t LESENSE_bitfield:1;
			uint64_t LCD_bitfield:1;
			uint64_t RTC_bitfield:1;
		} __attribute__((packed)) B;
	} LFACLKEN0;

	uint8_t res13[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LEUART0_bitfield:1;
			uint64_t LEUART1_bitfield:1;
			uint64_t SYSTICK:1;
			uint64_t CSEN_bitfield:1;
		} __attribute__((packed)) B;
	} LFBCLKEN0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t USB_bitfield:1;
		} __attribute__((packed)) B;
	} LFCCLKEN0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RTCC_bitfield:1;
		} __attribute__((packed)) B;
	} LFECLKEN0;

	uint8_t res14[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:8;
			uint64_t PRESC:5;
			uint64_t reservedSpace1:11;
			uint64_t HFCLKLEPRESC:2;
		} __attribute__((packed)) B;
	} HFPRESC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:8;
			uint64_t PRESC:9;
		} __attribute__((packed)) B;
	} HFBUSPRESC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:8;
			uint64_t PRESC:9;
		} __attribute__((packed)) B;
	} HFCOREPRESC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:8;
			uint64_t PRESC:9;
		} __attribute__((packed)) B;
	} HFPERPRESC;

	uint8_t res15[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:8;
			uint64_t PRESC:5;
		} __attribute__((packed)) B;
	} HFEXPPRESC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:8;
			uint64_t PRESC:9;
		} __attribute__((packed)) B;
	} HFPERPRESCB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:8;
			uint64_t PRESC:9;
		} __attribute__((packed)) B;
	} HFPERPRESCC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LETIMER0_bitfield:4;
			uint64_t LETIMER1_bitfield:4;
			uint64_t LESENSE_bitfield:2;
			uint64_t reservedSpace0:2;
			uint64_t LCD_bitfield:3;
			uint64_t reservedSpace1:1;
			uint64_t RTC_bitfield:4;
		} __attribute__((packed)) B;
	} LFAPRESC0;

	uint8_t res16[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LEUART0_bitfield:2;
			uint64_t reservedSpace0:2;
			uint64_t LEUART1_bitfield:2;
			uint64_t reservedSpace1:2;
			uint64_t SYSTICK:4;
			uint64_t CSEN_bitfield:2;
		} __attribute__((packed)) B;
	} LFBPRESC0;

	uint8_t res17[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RTCC_bitfield:2;
		} __attribute__((packed)) B;
	} LFEPRESC0;

	uint8_t res18[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LFACLKEN0:1;
			uint64_t reservedSpace0:1;
			uint64_t LFAPRESC0:1;
			uint64_t reservedSpace1:1;
			uint64_t LFBCLKEN0:1;
			uint64_t reservedSpace2:1;
			uint64_t LFBPRESC0:1;
			uint64_t reservedSpace3:1;
			uint64_t LFCCLKEN0:1;
			uint64_t reservedSpace4:7;
			uint64_t LFECLKEN0:1;
			uint64_t reservedSpace5:1;
			uint64_t LFEPRESC0:1;
			uint64_t reservedSpace6:5;
			uint64_t HFRCOBSY:1;
			uint64_t AUXHFRCOBSY:1;
			uint64_t LFRCOBSY:1;
			uint64_t LFRCOVREFBSY:1;
			uint64_t HFXOBSY:1;
			uint64_t LFXOBSY:1;
			uint64_t USHFRCOBSY:1;
		} __attribute__((packed)) B;
	} SYNCBUSY;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REGFREEZE:1;
		} __attribute__((packed)) B;
	} FREEZE;

	uint8_t res19[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PCNT0CLKEN:1;
			uint64_t PCNT0CLKSEL:1;
			uint64_t PCNT1CLKEN:1;
			uint64_t PCNT1CLKSEL:1;
			uint64_t PCNT2CLKEN:1;
			uint64_t PCNT2CLKSEL:1;
		} __attribute__((packed)) B;
	} PCNTCTRL;

	uint8_t res20[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADC0CLKDIV:2;
			uint64_t reservedSpace0:2;
			uint64_t ADC0CLKSEL:2;
			uint64_t reservedSpace1:2;
			uint64_t ADC0CLKINV:1;
			uint64_t reservedSpace2:7;
			uint64_t ADC1CLKDIV:2;
			uint64_t reservedSpace3:2;
			uint64_t ADC1CLKSEL:2;
			uint64_t reservedSpace4:2;
			uint64_t ADC1CLKINV:1;
		} __attribute__((packed)) B;
	} ADCCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SDIOCLKSEL:2;
			uint64_t reservedSpace0:5;
			uint64_t SDIOCLKDIS:1;
		} __attribute__((packed)) B;
	} SDIOCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t QSPI0CLKSEL:2;
			uint64_t reservedSpace0:5;
			uint64_t QSPI0CLKDIS:1;
		} __attribute__((packed)) B;
	} QSPICTRL;

	uint8_t res21[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CLKOUT0PEN:1;
			uint64_t CLKOUT1PEN:1;
			uint64_t CLKOUT2PEN:1;
			uint64_t reservedSpace0:25;
			uint64_t CLKIN0PEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CLKOUT0LOC:6;
			uint64_t reservedSpace0:2;
			uint64_t CLKOUT1LOC:6;
			uint64_t reservedSpace1:2;
			uint64_t CLKOUT2LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CLKIN0LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC1;

	uint8_t res22[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOCKKEY:16;
		} __attribute__((packed)) B;
	} LOCK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SSAMP:3;
			uint64_t reservedSpace0:5;
			uint64_t SSINV:5;
		} __attribute__((packed)) B;
	} HFRCOSS;

	uint8_t res23[104];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t USBCLKSEL:3;
			uint64_t reservedSpace0:4;
			uint64_t USBCLKEN:1;
		} __attribute__((packed)) B;
	} USBCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t USBCREN:1;
			uint64_t USBLSCRMD:1;
		} __attribute__((packed)) B;
	} USBCRCTRL;

} __attribute__((packed));

#define CMU (*(volatile struct CMU_tag *) 0x400e4000)

struct CRYPTO0_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t AES:1;
			uint64_t KEYBUFDIS:1;
			uint64_t SHA:1;
			uint64_t reservedSpace0:7;
			uint64_t NOBUSYSTALL:1;
			uint64_t reservedSpace1:3;
			uint64_t INCWIDTH:2;
			uint64_t DMA0MODE:2;
			uint64_t reservedSpace2:2;
			uint64_t DMA0RSEL:2;
			uint64_t reservedSpace3:2;
			uint64_t DMA1MODE:2;
			uint64_t reservedSpace4:2;
			uint64_t DMA1RSEL:2;
			uint64_t reservedSpace5:1;
			uint64_t COMBDMA0WEREQ:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODULUS:4;
			uint64_t MODOP:1;
			uint64_t reservedSpace0:3;
			uint64_t MULWIDTH:2;
			uint64_t RESULTWIDTH:2;
		} __attribute__((packed)) B;
	} WAC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INSTR:8;
			uint64_t reservedSpace0:1;
			uint64_t SEQSTART:1;
			uint64_t SEQSTOP:1;
			uint64_t SEQSTEP:1;
		} __attribute__((packed)) B;
	} CMD;

