iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEQRUNNING:1;
			uint64_t INSTRRUNNING:1;
			uint64_t DMAACTIVE:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA0ZERO:4;
			uint64_t reservedSpace0:4;
			uint64_t DDATA0LSBS:4;
			uint64_t reservedSpace1:4;
			uint64_t DDATA0MSBS:4;
			uint64_t DDATA1MSB:1;
			uint64_t reservedSpace2:3;
			uint64_t CARRY:1;
		} __attribute__((packed)) B;
	} DSTATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t V0:3;
			uint64_t reservedSpace0:5;
			uint64_t V1:3;
			uint64_t reservedSpace1:5;
			uint64_t SEQPART:1;
			uint64_t SEQSKIP:1;
			uint64_t reservedSpace2:2;
			uint64_t SEQIP:5;
		} __attribute__((packed)) B;
	} CSTATUS;

	uint8_t res1[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t KEY:32;
		} __attribute__((packed)) B;
	} KEY;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t KEYBUF:32;
		} __attribute__((packed)) B;
	} KEYBUF;

	uint8_t res2[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LENGTHA:14;
			uint64_t reservedSpace0:6;
			uint64_t BLOCKSIZE:2;
			uint64_t reservedSpace1:2;
			uint64_t DMA0SKIP:2;
			uint64_t DMA1SKIP:2;
			uint64_t DMA0PRESA:1;
			uint64_t DMA1PRESA:1;
			uint64_t reservedSpace2:1;
			uint64_t HALT:1;
		} __attribute__((packed)) B;
	} SEQCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LENGTHB:14;
			uint64_t reservedSpace0:14;
			uint64_t DMA0PRESB:1;
			uint64_t DMA1PRESB:1;
		} __attribute__((packed)) B;
	} SEQCTRLB;

	uint8_t res3[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INSTRDONE:1;
			uint64_t SEQDONE:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INSTRDONE:1;
			uint64_t SEQDONE:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INSTRDONE:1;
			uint64_t SEQDONE:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INSTRDONE:1;
			uint64_t SEQDONE:1;
		} __attribute__((packed)) B;
	} IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INSTR0:8;
			uint64_t INSTR1:8;
			uint64_t INSTR2:8;
			uint64_t INSTR3:8;
		} __attribute__((packed)) B;
	} SEQ0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INSTR4:8;
			uint64_t INSTR5:8;
			uint64_t INSTR6:8;
			uint64_t INSTR7:8;
		} __attribute__((packed)) B;
	} SEQ1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INSTR8:8;
			uint64_t INSTR9:8;
			uint64_t INSTR10:8;
			uint64_t INSTR11:8;
		} __attribute__((packed)) B;
	} SEQ2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INSTR12:8;
			uint64_t INSTR13:8;
			uint64_t INSTR14:8;
			uint64_t INSTR15:8;
		} __attribute__((packed)) B;
	} SEQ3;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INSTR16:8;
			uint64_t INSTR17:8;
			uint64_t INSTR18:8;
			uint64_t INSTR19:8;
		} __attribute__((packed)) B;
	} SEQ4;

	uint8_t res4[28];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA0:32;
		} __attribute__((packed)) B;
	} DATA0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA1:32;
		} __attribute__((packed)) B;
	} DATA1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA2:32;
		} __attribute__((packed)) B;
	} DATA2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA3:32;
		} __attribute__((packed)) B;
	} DATA3;

	uint8_t res5[16];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA0XOR:32;
		} __attribute__((packed)) B;
	} DATA0XOR;

	uint8_t res6[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA0BYTE:8;
		} __attribute__((packed)) B;
	} DATA0BYTE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA1BYTE:8;
		} __attribute__((packed)) B;
	} DATA1BYTE;

	uint8_t res7[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA0XORBYTE:8;
		} __attribute__((packed)) B;
	} DATA0XORBYTE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA0BYTE12:8;
		} __attribute__((packed)) B;
	} DATA0BYTE12;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA0BYTE13:8;
		} __attribute__((packed)) B;
	} DATA0BYTE13;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA0BYTE14:8;
		} __attribute__((packed)) B;
	} DATA0BYTE14;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA0BYTE15:8;
		} __attribute__((packed)) B;
	} DATA0BYTE15;

	uint8_t res8[48];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DDATA0:32;
		} __attribute__((packed)) B;
	} DDATA0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DDATA1:32;
		} __attribute__((packed)) B;
	} DDATA1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DDATA2:32;
		} __attribute__((packed)) B;
	} DDATA2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DDATA3:32;
		} __attribute__((packed)) B;
	} DDATA3;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DDATA4:32;
		} __attribute__((packed)) B;
	} DDATA4;

	uint8_t res9[28];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DDATA0BIG:32;
		} __attribute__((packed)) B;
	} DDATA0BIG;

	uint8_t res10[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DDATA0BYTE:8;
		} __attribute__((packed)) B;
	} DDATA0BYTE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DDATA1BYTE:8;
		} __attribute__((packed)) B;
	} DDATA1BYTE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DDATA0BYTE32:4;
		} __attribute__((packed)) B;
	} DDATA0BYTE32;

	uint8_t res11[52];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t QDATA0:32;
		} __attribute__((packed)) B;
	} QDATA0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t QDATA1:32;
		} __attribute__((packed)) B;
	} QDATA1;

	uint8_t res12[28];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t QDATA1BIG:32;
		} __attribute__((packed)) B;
	} QDATA1BIG;

	uint8_t res13[24];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t QDATA0BYTE:8;
		} __attribute__((packed)) B;
	} QDATA0BYTE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t QDATA1BYTE:8;
		} __attribute__((packed)) B;
	} QDATA1BYTE;

} __attribute__((packed));

#define CRYPTO0 (*(volatile struct CRYPTO0_tag *) 0x400f0000)

struct LESENSE_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t SCANMODE:2;
			uint64_t PRSSEL:5;
			uint64_t SCANCONF:2;
			uint64_t reservedSpace0:2;
			uint64_t ALTEXMAP:1;
			uint64_t reservedSpace1:1;
			uint64_t DUALSAMPLE:1;
			uint64_t reservedSpace2:2;
			uint64_t BUFOW:1;
			uint64_t STRSCANRES:1;
			uint64_t reservedSpace3:1;
			uint64_t BUFIDL:1;
			uint64_t DMAWU:2;
			uint64_t DEBUGRUN:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t AUXPRESC:2;
			uint64_t reservedSpace0:2;
			uint64_t LFPRESC:3;
			uint64_t reservedSpace1:1;
			uint64_t PCPRESC:3;
			uint64_t reservedSpace2:1;
			uint64_t PCTOP:8;
			uint64_t reservedSpace3:2;
			uint64_t STARTDLY:2;
			uint64_t reservedSpace4:4;
			uint64_t AUXSTARTUP:1;
		} __attribute__((packed)) B;
	} TIMCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DACCH0EN:1;
			uint64_t DACCH1EN:1;
			uint64_t DACCH0DATA:1;
			uint64_t DACCH1DATA:1;
			uint64_t reservedSpace0:2;
			uint64_t DACSTARTUP:1;
			uint64_t reservedSpace1:1;
			uint64_t DACCONVTRIG:1;
			uint64_t reservedSpace2:11;
			uint64_t ACMP0MODE:2;
			uint64_t ACMP1MODE:2;
			uint64_t ACMP0INV:1;
			uint64_t ACMP1INV:1;
			uint64_t ACMP0HYSTEN:1;
			uint64_t ACMP1HYSTEN:1;
			uint64_t WARMUPMODE:2;
		} __attribute__((packed)) B;
	} PERCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DISABLE:1;
			uint64_t ERRCHK:1;
			uint64_t INTMAP:1;
			uint64_t HYSTPRS0:1;
			uint64_t HYSTPRS1:1;
			uint64_t HYSTPRS2:1;
			uint64_t HYSTIRQ:1;
			uint64_t PRSCNT:1;
			uint64_t INPUT:1;
			uint64_t reservedSpace0:1;
			uint64_t PRSSEL0:5;
			uint64_t PRSSEL1:5;
			uint64_t PRSSEL2:5;
			uint64_t PRSSEL3:5;
		} __attribute__((packed)) B;
	} DECCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t BIASMODE:2;
		} __attribute__((packed)) B;
	} BIASCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t WINSIZE:16;
		} __attribute__((packed)) B;
	} EVALCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DECCMPVAL:5;
			uint64_t reservedSpace0:3;
			uint64_t DECCMPMASK:5;
			uint64_t reservedSpace1:3;
			uint64_t DECCMPEN:1;
		} __attribute__((packed)) B;
	} PRSCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t START:1;
			uint64_t STOP:1;
			uint64_t DECODE:1;
			uint64_t CLEARBUF:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CHEN:16;
		} __attribute__((packed)) B;
	} CHEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SCANRES:16;
			uint64_t STEPDIR:16;
		} __attribute__((packed)) B;
	} SCANRES;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t BUFDATAV:1;
			uint64_t BUFHALFFULL:1;
			uint64_t BUFFULL:1;
			uint64_t RUNNING:1;
			uint64_t SCANACTIVE:1;
			uint64_t DACACTIVE:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RD:4;
			uint64_t WR:4;
		} __attribute__((packed)) B;
	} PTR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t BUFDATA:16;
			uint64_t BUFDATASRC:4;
		} __attribute__((packed)) B;
	} BUFDATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CURCH:4;
		} __attribute__((packed)) B;
	} CURCH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DECSTATE:5;
		} __attribute__((packed)) B;
	} DECSTATE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SENSORSTATE:4;
		} __attribute__((packed)) B;
	} SENSORSTATE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH0:2;
			uint64_t CH1:2;
			uint64_t CH2:2;
			uint64_t CH3:2;
			uint64_t CH4:2;
			uint64_t CH5:2;
			uint64_t CH6:2;
			uint64_t CH7:2;
			uint64_t CH8:2;
			uint64_t CH9:2;
			uint64_t CH10:2;
			uint64_t CH11:2;
			uint64_t CH12:2;
			uint64_t CH13:2;
			uint64_t CH14:2;
			uint64_t CH15:2;
		} __attribute__((packed)) B;
	} IDLECONF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t IDLECONF0:2;
			uint64_t IDLECONF1:2;
			uint64_t IDLECONF2:2;
			uint64_t IDLECONF3:2;
			uint64_t IDLECONF4:2;
			uint64_t IDLECONF5:2;
			uint64_t IDLECONF6:2;
			uint64_t IDLECONF7:2;
			uint64_t AEX0:1;
			uint64_t AEX1:1;
			uint64_t AEX2:1;
			uint64_t AEX3:1;
			uint64_t AEX4:1;
			uint64_t AEX5:1;
			uint64_t AEX6:1;
			uint64_t AEX7:1;
		} __attribute__((packed)) B;
	} ALTEXCONF;

