iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res0[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH0:1;
			uint64_t CH1:1;
			uint64_t CH2:1;
			uint64_t CH3:1;
			uint64_t CH4:1;
			uint64_t CH5:1;
			uint64_t CH6:1;
			uint64_t CH7:1;
			uint64_t CH8:1;
			uint64_t CH9:1;
			uint64_t CH10:1;
			uint64_t CH11:1;
			uint64_t CH12:1;
			uint64_t CH13:1;
			uint64_t CH14:1;
			uint64_t CH15:1;
			uint64_t SCANCOMPLETE:1;
			uint64_t DEC:1;
			uint64_t DECERR:1;
			uint64_t BUFDATAV:1;
			uint64_t BUFLEVEL:1;
			uint64_t BUFOF:1;
			uint64_t CNTOF:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH0:1;
			uint64_t CH1:1;
			uint64_t CH2:1;
			uint64_t CH3:1;
			uint64_t CH4:1;
			uint64_t CH5:1;
			uint64_t CH6:1;
			uint64_t CH7:1;
			uint64_t CH8:1;
			uint64_t CH9:1;
			uint64_t CH10:1;
			uint64_t CH11:1;
			uint64_t CH12:1;
			uint64_t CH13:1;
			uint64_t CH14:1;
			uint64_t CH15:1;
			uint64_t SCANCOMPLETE:1;
			uint64_t DEC:1;
			uint64_t DECERR:1;
			uint64_t BUFDATAV:1;
			uint64_t BUFLEVEL:1;
			uint64_t BUFOF:1;
			uint64_t CNTOF:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH0:1;
			uint64_t CH1:1;
			uint64_t CH2:1;
			uint64_t CH3:1;
			uint64_t CH4:1;
			uint64_t CH5:1;
			uint64_t CH6:1;
			uint64_t CH7:1;
			uint64_t CH8:1;
			uint64_t CH9:1;
			uint64_t CH10:1;
			uint64_t CH11:1;
			uint64_t CH12:1;
			uint64_t CH13:1;
			uint64_t CH14:1;
			uint64_t CH15:1;
			uint64_t SCANCOMPLETE:1;
			uint64_t DEC:1;
			uint64_t DECERR:1;
			uint64_t BUFDATAV:1;
			uint64_t BUFLEVEL:1;
			uint64_t BUFOF:1;
			uint64_t CNTOF:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH0:1;
			uint64_t CH1:1;
			uint64_t CH2:1;
			uint64_t CH3:1;
			uint64_t CH4:1;
			uint64_t CH5:1;
			uint64_t CH6:1;
			uint64_t CH7:1;
			uint64_t CH8:1;
			uint64_t CH9:1;
			uint64_t CH10:1;
			uint64_t CH11:1;
			uint64_t CH12:1;
			uint64_t CH13:1;
			uint64_t CH14:1;
			uint64_t CH15:1;
			uint64_t SCANCOMPLETE:1;
			uint64_t DEC:1;
			uint64_t DECERR:1;
			uint64_t BUFDATAV:1;
			uint64_t BUFLEVEL:1;
			uint64_t BUFOF:1;
			uint64_t CNTOF:1;
		} __attribute__((packed)) B;
	} IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:7;
			uint64_t CMD:1;
		} __attribute__((packed)) B;
	} SYNCBUSY;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH0PEN:1;
			uint64_t CH1PEN:1;
			uint64_t CH2PEN:1;
			uint64_t CH3PEN:1;
			uint64_t CH4PEN:1;
			uint64_t CH5PEN:1;
			uint64_t CH6PEN:1;
			uint64_t CH7PEN:1;
			uint64_t CH8PEN:1;
			uint64_t CH9PEN:1;
			uint64_t CH10PEN:1;
			uint64_t CH11PEN:1;
			uint64_t CH12PEN:1;
			uint64_t CH13PEN:1;
			uint64_t CH14PEN:1;
			uint64_t CH15PEN:1;
			uint64_t ALTEX0PEN:1;
			uint64_t ALTEX1PEN:1;
			uint64_t ALTEX2PEN:1;
			uint64_t ALTEX3PEN:1;
			uint64_t ALTEX4PEN:1;
			uint64_t ALTEX5PEN:1;
			uint64_t ALTEX6PEN:1;
			uint64_t ALTEX7PEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	uint8_t res1[152];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST0_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST0_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST1_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST1_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST2_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST2_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST3_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST3_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST4_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST4_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST5_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST5_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST6_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST6_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST7_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST7_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST8_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST8_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST9_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST9_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST10_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST10_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST11_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST11_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST12_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST12_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST13_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST13_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST14_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST14_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST15_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST15_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST16_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST16_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST17_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST17_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST18_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST18_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST19_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST19_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST20_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST20_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST21_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST21_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST22_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST22_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST23_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST23_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST24_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST24_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST25_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST25_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST26_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST26_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST27_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST27_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST28_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST28_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST29_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST29_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST30_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST30_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:1;
			uint64_t CHAIN:1;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST31_TCONFA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:4;
			uint64_t MASK:4;
			uint64_t NEXTSTATE:5;
			uint64_t reservedSpace0:2;
			uint64_t SETIF:1;
			uint64_t PRSACT:3;
		} __attribute__((packed)) B;
	} ST31_TCONFB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF0_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF1_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF2_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF3_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF4_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF5_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF6_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF7_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF8_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF9_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF10_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF11_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF12_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF13_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF14_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t DATASRC:4;
		} __attribute__((packed)) B;
	} BUF15_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH0_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH0_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH0_EVAL;

