iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res2[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH1_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH1_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH1_EVAL;

	uint8_t res3[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH2_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH2_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH2_EVAL;

	uint8_t res4[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH3_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH3_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH3_EVAL;

	uint8_t res5[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH4_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH4_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH4_EVAL;

	uint8_t res6[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH5_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH5_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH5_EVAL;

	uint8_t res7[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH6_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH6_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH6_EVAL;

	uint8_t res8[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH7_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH7_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH7_EVAL;

	uint8_t res9[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH8_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH8_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH8_EVAL;

	uint8_t res10[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH9_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH9_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH9_EVAL;

	uint8_t res11[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH10_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH10_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH10_EVAL;

	uint8_t res12[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH11_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH11_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH11_EVAL;

	uint8_t res13[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH12_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH12_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH12_EVAL;

	uint8_t res14[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH13_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH13_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH13_EVAL;

	uint8_t res15[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH14_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH14_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH14_EVAL;

	uint8_t res16[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIME:6;
			uint64_t SAMPLEDLY:8;
			uint64_t MEASUREDLY:10;
		} __attribute__((packed)) B;
	} CH15_TIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t THRES:12;
			uint64_t SAMPLE:2;
			uint64_t SETIF:3;
			uint64_t EXMODE:2;
			uint64_t EXCLK:1;
			uint64_t SAMPLECLK:1;
			uint64_t ALTEX:1;
		} __attribute__((packed)) B;
	} CH15_INTERACT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPTHRES:16;
			uint64_t COMP:1;
			uint64_t DECODE:1;
			uint64_t STRSAMPLE:2;
			uint64_t SCANRESINV:1;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} CH15_EVAL;

} __attribute__((packed));

