iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res1[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HSTRIDE:12;
		} __attribute__((packed)) B;
	} TFTSTRIDE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HSZ:10;
			uint64_t reservedSpace0:6;
			uint64_t VSZ:10;
		} __attribute__((packed)) B;
	} TFTSIZE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HSYNC:7;
			uint64_t reservedSpace0:1;
			uint64_t HFPORCH:8;
			uint64_t reservedSpace1:2;
			uint64_t HBPORCH:8;
			uint64_t reservedSpace2:2;
			uint64_t HSYNCSTART:2;
		} __attribute__((packed)) B;
	} TFTHPORCH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VSYNC:7;
			uint64_t reservedSpace0:1;
			uint64_t VFPORCH:12;
			uint64_t VBPORCH:12;
		} __attribute__((packed)) B;
	} TFTVPORCH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DCLKPERIOD:12;
			uint64_t TFTSTART:12;
			uint64_t TFTSETUP:3;
			uint64_t reservedSpace0:1;
			uint64_t TFTHOLD:3;
		} __attribute__((packed)) B;
	} TFTTIMING;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CSPOL:1;
			uint64_t DCLKPOL:1;
			uint64_t DATAENPOL:1;
			uint64_t HSYNCPOL:1;
			uint64_t VSYNCPOL:1;
		} __attribute__((packed)) B;
	} TFTPOLARITY;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:24;
		} __attribute__((packed)) B;
	} TFTDD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ALPHA:9;
		} __attribute__((packed)) B;
	} TFTALPHA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:24;
		} __attribute__((packed)) B;
	} TFTPIXEL0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:24;
		} __attribute__((packed)) B;
	} TFTPIXEL1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:24;
		} __attribute__((packed)) B;
	} TFTPIXEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TFTMASK:24;
		} __attribute__((packed)) B;
	} TFTMASK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VSYNC:1;
			uint64_t HSYNC:1;
			uint64_t VBPORCH:1;
			uint64_t VFPORCH:1;
			uint64_t DDEMPTY:1;
			uint64_t DDJIT:1;
			uint64_t TFTPIXEL0EMPTY:1;
			uint64_t TFTPIXEL1EMPTY:1;
			uint64_t TFTPIXELFULL:1;
			uint64_t TFTPIXELOF:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VSYNC:1;
			uint64_t HSYNC:1;
			uint64_t VBPORCH:1;
			uint64_t VFPORCH:1;
			uint64_t DDEMPTY:1;
			uint64_t DDJIT:1;
			uint64_t TFTPIXEL0EMPTY:1;
			uint64_t TFTPIXEL1EMPTY:1;
			uint64_t TFTPIXELFULL:1;
			uint64_t TFTPIXELOF:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VSYNC:1;
			uint64_t HSYNC:1;
			uint64_t VBPORCH:1;
			uint64_t VFPORCH:1;
			uint64_t DDEMPTY:1;
			uint64_t DDJIT:1;
			uint64_t TFTPIXEL0EMPTY:1;
			uint64_t TFTPIXEL1EMPTY:1;
			uint64_t TFTPIXELFULL:1;
			uint64_t TFTPIXELOF:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VSYNC:1;
			uint64_t HSYNC:1;
			uint64_t VBPORCH:1;
			uint64_t VFPORCH:1;
			uint64_t DDEMPTY:1;
			uint64_t DDJIT:1;
			uint64_t TFTPIXEL0EMPTY:1;
			uint64_t TFTPIXEL1EMPTY:1;
			uint64_t TFTPIXELFULL:1;
			uint64_t TFTPIXELOF:1;
		} __attribute__((packed)) B;
	} IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EBIPEN:1;
			uint64_t CS0PEN:1;
			uint64_t CS1PEN:1;
			uint64_t CS2PEN:1;
			uint64_t CS3PEN:1;
			uint64_t ALEPEN:1;
			uint64_t ARDYPEN:1;
			uint64_t BLPEN:1;
			uint64_t reservedSpace0:4;
			uint64_t NANDPEN:1;
			uint64_t reservedSpace1:3;
			uint64_t ALB:2;
			uint64_t APEN:5;
			uint64_t reservedSpace2:1;
			uint64_t TFTPEN:1;
			uint64_t DATAENPEN:1;
			uint64_t CSTFTPEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EBILOC:6;
			uint64_t reservedSpace0:2;
			uint64_t CSLOC:6;
			uint64_t reservedSpace1:2;
			uint64_t NANDLOC:6;
			uint64_t reservedSpace2:2;
			uint64_t TFTLOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADLOC:6;
			uint64_t reservedSpace0:2;
			uint64_t ALOC:6;
			uint64_t reservedSpace1:2;
			uint64_t RDYLOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC1;

} __attribute__((packed));

#define EBI (*(volatile struct EBI_tag *) 0x4000b000)

struct ETH_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t LOOPBACKLOCAL:1;
			uint64_t ENBRX:1;
			uint64_t ENBTX:1;
			uint64_t MANPORTEN:1;
			uint64_t CLRALLSTATSREGS:1;
			uint64_t INCALLSTATSREGS:1;
			uint64_t STATSWREN:1;
			uint64_t BACKPRESSURE:1;
			uint64_t TXSTRT:1;
			uint64_t TXHALT:1;
			uint64_t TXPFRMREQ:1;
			uint64_t TXPFRMZERO:1;
			uint64_t reservedSpace1:2;
			uint64_t STORERXTS:1;
			uint64_t PFCENB:1;
			uint64_t TXPFCPRIORPFRM:1;
			uint64_t FLUSHRXPKT:1;
			uint64_t TXLPIEN:1;
			uint64_t PTPUNICASTEN:1;
			uint64_t reservedSpace2:1;
			uint64_t STOREUDPOFFSET:1;
			uint64_t reservedSpace3:1;
			uint64_t ONESTEPSYNCMODE:1;
			uint64_t PFCCTRL:1;
		} __attribute__((packed)) B;
	} NETWORKCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SPEED:1;
			uint64_t FULLDUPLEX:1;
			uint64_t DISCRDNONVLANFRAMES:1;
			uint64_t JUMBOFRAMES:1;
			uint64_t COPYALLFRAMES:1;
			uint64_t NOBROADCAST:1;
			uint64_t MULTICASTHASHEN:1;
			uint64_t UNICASTHASHEN:1;
			uint64_t RX1536BYTEFRAMES:1;
			uint64_t reservedSpace0:3;
			uint64_t RETRYTEST:1;
			uint64_t PAUSEEN:1;
			uint64_t RXBUFFOFFSET:2;
			uint64_t LENFIELDERRFRMDISCRD:1;
			uint64_t FCSREMOVE:1;
			uint64_t MDCCLKDIV:3;
			uint64_t reservedSpace1:2;
			uint64_t DISCOPYOFPFRAMES:1;
			uint64_t RXCHKSUMOFFLOADEN:1;
			uint64_t ENHALFDUPLEXRX:1;
			uint64_t IGNORERXFCS:1;
			uint64_t reservedSpace2:1;
			uint64_t IPGSTRTCHEN:1;
			uint64_t NSPCHANGE:1;
			uint64_t IGNOREIPGRXER:1;
		} __attribute__((packed)) B;
	} NETWORKCFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t MDIOIN:1;
			uint64_t MANDONE:1;
			uint64_t reservedSpace1:3;
			uint64_t PFCNEGOTIATE:1;
			uint64_t LPIINDICATE:1;
		} __attribute__((packed)) B;
	} NETWORKSTATUS;

	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t AMBABRSTLEN:5;
			uint64_t HDRDATASPLITEN:1;
			uint64_t reservedSpace0:2;
			uint64_t RXPBUFSIZE:2;
			uint64_t TXPBUFSIZE:1;
			uint64_t TXPBUFTCPEN:1;
			uint64_t INFLASTDBUFSIZEEN:1;
			uint64_t reservedSpace1:3;
			uint64_t RXBUFSIZE:8;
			uint64_t FRCDISCARDONERR:1;
			uint64_t FRCMAXAMBABRSTRX:1;
			uint64_t FRCMAXAMBABRSTTX:1;
			uint64_t reservedSpace2:1;
			uint64_t RXBDEXTNDMODEEN:1;
			uint64_t TXBDEXTENDMODEEN:1;
		} __attribute__((packed)) B;
	} DMACFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t USEDBITREAD:1;
			uint64_t COLOCCRD:1;
			uint64_t RETRYLMTEXCD:1;
			uint64_t TXGO:1;
			uint64_t AMBAERR:1;
			uint64_t TXCMPLT:1;
			uint64_t TXUNDERRUN:1;
			uint64_t LATECOLOCCRD:1;
			uint64_t RESPNOTOK:1;
		} __attribute__((packed)) B;
	} TXSTATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:2;
			uint64_t DMARXQPTR:30;
		} __attribute__((packed)) B;
	} RXQPTR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:2;
			uint64_t DMATXQPTR:30;
		} __attribute__((packed)) B;
	} TXQPTR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t BUFFNOTAVAIL:1;
			uint64_t FRMRX:1;
			uint64_t RXOVERRUN:1;
			uint64_t RESPNOTOK:1;
		} __attribute__((packed)) B;
	} RXSTATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MNGMNTDONE:1;
			uint64_t RXCMPLT:1;
			uint64_t RXUSEDBITREAD:1;
			uint64_t TXUSEDBITREAD:1;
			uint64_t TXUNDERRUN:1;
			uint64_t RTRYLMTORLATECOL:1;
			uint64_t AMBAERR:1;
			uint64_t TXCMPLT:1;
			uint64_t reservedSpace0:2;
			uint64_t RXOVERRUN:1;
			uint64_t RESPNOTOK:1;
			uint64_t NONZEROPFRMQUANT:1;
			uint64_t PAUSETIMEZERO:1;
			uint64_t PFRMTX:1;
			uint64_t reservedSpace1:3;
			uint64_t PTPDLYREQFRMRX:1;
			uint64_t PTPSYNCFRMRX:1;
			uint64_t PTPDLYREQFRMTX:1;
			uint64_t PTPSYNCFRMTX:1;
			uint64_t PTPPDLYREQFRMRX:1;
			uint64_t PTPPDLYRESPFRMRX:1;
			uint64_t PTPPDLYREQFRMTX:1;
			uint64_t PTPPDLYRESPFRMTX:1;
			uint64_t TSUSECREGINCR:1;
			uint64_t RXLPIINDC:1;
			uint64_t WOLEVNTRX:1;
			uint64_t TSUTIMERCOMP:1;
		} __attribute__((packed)) B;
	} IFCR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MNGMNTDONE:1;
			uint64_t RXCMPLT:1;
			uint64_t RXUSEDBITREAD:1;
			uint64_t TXUSEDBITREAD:1;
			uint64_t TXUNDERRUN:1;
			uint64_t RTRYLMTORLATECOL:1;
			uint64_t AMBAERR:1;
			uint64_t TXCMPLT:1;
			uint64_t reservedSpace0:2;
			uint64_t RXOVERRUN:1;
			uint64_t RESPNOTOK:1;
			uint64_t NONZEROPFRMQUANT:1;
			uint64_t PAUSETIMEZERO:1;
			uint64_t PFRMTX:1;
			uint64_t reservedSpace1:3;
			uint64_t PTPDLYREQFRMRX:1;
			uint64_t PTPSYNCFRMRX:1;
			uint64_t PTPDLYREQFRMTX:1;
			uint64_t PTPSYNCFRMTX:1;
			uint64_t PTPPDLYREQFRMRX:1;
			uint64_t PTPPDLYRESPFRMRX:1;
			uint64_t PTPPDLYREQFRMTX:1;
			uint64_t PTPPDLYRESPFRMTX:1;
			uint64_t TSUSECREGINCR:1;
			uint64_t RXLPIINDC:1;
			uint64_t WOLEVNTRX:1;
			uint64_t TSUTIMERCOMP:1;
		} __attribute__((packed)) B;
	} IENS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MNGMNTDONE:1;
			uint64_t RXCMPLT:1;
			uint64_t RXUSEDBITREAD:1;
			uint64_t TXUSEDBITREAD:1;
			uint64_t TXUNDERRUN:1;
			uint64_t RTRYLMTORLATECOL:1;
			uint64_t AMBAERR:1;
			uint64_t TXCMPLT:1;
			uint64_t reservedSpace0:2;
			uint64_t RXOVERRUN:1;
			uint64_t RESPNOTOK:1;
			uint64_t NONZEROPFRMQUANT:1;
			uint64_t PAUSETIMEZERO:1;
			uint64_t PFRMTX:1;
			uint64_t reservedSpace1:3;
			uint64_t PTPDLYREQFRMRX:1;
			uint64_t PTPSYNCFRMRX:1;
			uint64_t PTPDLYREQFRMTX:1;
			uint64_t PTPSYNCFRMTX:1;
			uint64_t PTPPDLYREQFRMRX:1;
			uint64_t PTPPDLYRESPFRMRX:1;
			uint64_t PTPPDLYREQFRMTX:1;
			uint64_t PTPPDLYRESPFRMTX:1;
			uint64_t TSUSECREGINCR:1;
			uint64_t RXLPIINDC:1;
			uint64_t WOLEVNTRX:1;
			uint64_t TSUTIMERCOMP:1;
		} __attribute__((packed)) B;
	} IENC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MNGMNTDONE:1;
			uint64_t RXCMPLT:1;
			uint64_t RXUSEDBITREAD:1;
			uint64_t TXUSEDBITREAD:1;
			uint64_t TXUNDERRUN:1;
			uint64_t RTRYLMTORLATECOL:1;
			uint64_t AMBAERR:1;
			uint64_t TXCMPLT:1;
			uint64_t UNUSED:1;
			uint64_t reservedSpace0:1;
			uint64_t RXOVERRUN:1;
			uint64_t RESPNOTOK:1;
			uint64_t NONZEROPFRMQUANT:1;
			uint64_t PAUSETIMEZERO:1;
			uint64_t PFRMTX:1;
			uint64_t reservedSpace1:3;
			uint64_t PTPDLYREQFRMRX:1;
			uint64_t PTPSYNCFRMRX:1;
			uint64_t PTPDLYREQFRMTX:1;
			uint64_t PTPSYNCFRMTX:1;
			uint64_t PTPPDLYREQFRMRX:1;
			uint64_t PTPPDLYRESPFRMRX:1;
			uint64_t PTPPDLYREQFRMTX:1;
			uint64_t PTPPDLYRESPFRMTX:1;
			uint64_t TSUSECREGINCR:1;
			uint64_t RXLPIINDC:1;
			uint64_t WOLEVNTRX:1;
			uint64_t TSUTIMERCOMP:1;
		} __attribute__((packed)) B;
	} IENRO;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PHYRWDATA:16;
			uint64_t WRITE10:2;
			uint64_t REGADDR:5;
			uint64_t PHYADDR:5;
			uint64_t OPERATION:2;
			uint64_t WRITE1:1;
			uint64_t WRITE0:1;
		} __attribute__((packed)) B;
	} PHYMNGMNT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t QUANT:16;
		} __attribute__((packed)) B;
	} RXPAUSEQUANT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t QUANT:16;
			uint64_t QUANTP1:16;
		} __attribute__((packed)) B;
	} TXPAUSEQUANT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMATXCUTTHRUTHR:10;
			uint64_t reservedSpace0:21;
			uint64_t DMATXCUTTHRU:1;
		} __attribute__((packed)) B;
	} PBUFTXCUTTHRU;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMARXCUTTHRUTHR:10;
			uint64_t reservedSpace0:21;
			uint64_t DMARXCUTTHRU:1;
		} __attribute__((packed)) B;
	} PBUFRXCUTTHRU;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t JUMBOMAXLEN:14;
		} __attribute__((packed)) B;
	} JUMBOMAXLEN;

	uint8_t res1[16];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXINTMOD:8;
			uint64_t reservedSpace0:8;
			uint64_t TXINTMOD:8;
		} __attribute__((packed)) B;
	} IMOD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SYSWAKETIME:16;
		} __attribute__((packed)) B;
	} SYSWAKETIME;

