iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res2[28];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:32;
		} __attribute__((packed)) B;
	} HASHBOTTOM;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:32;
		} __attribute__((packed)) B;
	} HASHTOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:32;
		} __attribute__((packed)) B;
	} SPECADDR1BOTTOM;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:16;
			uint64_t FILTERTYPE:1;
		} __attribute__((packed)) B;
	} SPECADDR1TOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:32;
		} __attribute__((packed)) B;
	} SPECADDR2BOTTOM;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:16;
			uint64_t FILTERTYPE:1;
			uint64_t reservedSpace0:7;
			uint64_t FILTERBYTEMASK:6;
		} __attribute__((packed)) B;
	} SPECADDR2TOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:32;
		} __attribute__((packed)) B;
	} SPECADDR3BOTTOM;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:16;
			uint64_t FILTERTYPE:1;
			uint64_t reservedSpace0:7;
			uint64_t FILTERBYTEMASK:6;
		} __attribute__((packed)) B;
	} SPECADDR3TOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:32;
		} __attribute__((packed)) B;
	} SPECADDR4BOTTOM;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:16;
			uint64_t FILTERTYPE:1;
			uint64_t reservedSpace0:7;
			uint64_t FILTERBYTEMASK:6;
		} __attribute__((packed)) B;
	} SPECADDR4TOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MATCH:16;
			uint64_t reservedSpace0:15;
			uint64_t ENBCOPY:1;
		} __attribute__((packed)) B;
	} SPECTYPE1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MATCH:16;
			uint64_t reservedSpace0:15;
			uint64_t ENBCOPY:1;
		} __attribute__((packed)) B;
	} SPECTYPE2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MATCH:16;
			uint64_t reservedSpace0:15;
			uint64_t ENBCOPY:1;
		} __attribute__((packed)) B;
	} SPECTYPE3;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MATCH:16;
			uint64_t reservedSpace0:15;
			uint64_t ENBCOPY:1;
		} __attribute__((packed)) B;
	} SPECTYPE4;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:16;
			uint64_t WOLMASK0:1;
			uint64_t WOLMASK1:1;
			uint64_t WOLMASK2:1;
			uint64_t WOLMASK3:1;
		} __attribute__((packed)) B;
	} WOLREG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t IPGSTRETCH:16;
		} __attribute__((packed)) B;
	} STRETCHRATIO;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MATCH:16;
			uint64_t reservedSpace0:15;
			uint64_t ENBPROCESSING:1;
		} __attribute__((packed)) B;
	} STACKEDVLAN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VECTORENB:8;
			uint64_t VECTOR:8;
		} __attribute__((packed)) B;
	} TXPFCPAUSE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDRMASK:32;
		} __attribute__((packed)) B;
	} MASKADD1BOTTOM;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDRMASK:16;
		} __attribute__((packed)) B;
	} MASKADD1TOP;

	uint8_t res3[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:32;
		} __attribute__((packed)) B;
	} RXPTPUNICAST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:32;
		} __attribute__((packed)) B;
	} TXPTPUNICAST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPVAL:22;
		} __attribute__((packed)) B;
	} TSUNSECCMP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPVAL:32;
		} __attribute__((packed)) B;
	} TSUSECCMP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMPVAL:16;
		} __attribute__((packed)) B;
	} TSUMSBSECCMP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMERSEC:16;
		} __attribute__((packed)) B;
	} TSUPTPTXMSBSEC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMERSEC:16;
		} __attribute__((packed)) B;
	} TSUPTPRXMSBSEC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMERSEC:16;
		} __attribute__((packed)) B;
	} TSUPEERTXMSBSEC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMERSEC:16;
		} __attribute__((packed)) B;
	} TSUPEERRXMSBSEC;

	uint8_t res4[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} OCTETSTXEDBOTTOM;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:16;
		} __attribute__((packed)) B;
	} OCTETSTXEDTOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESTXEDOK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} BROADCASTTXED;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} MULTICASTTXED;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:16;
		} __attribute__((packed)) B;
	} PFRAMESTXED;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESTXED64;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESTXED65;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESTXED128;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESTXED256;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESTXED512;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESTXED1024;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESTXED1519;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:10;
		} __attribute__((packed)) B;
	} TXUNDERRUNS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:18;
		} __attribute__((packed)) B;
	} SINGLECOLS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:18;
		} __attribute__((packed)) B;
	} MULTICOLS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:10;
		} __attribute__((packed)) B;
	} EXCESSCOLS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:10;
		} __attribute__((packed)) B;
	} LATECOLS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:18;
		} __attribute__((packed)) B;
	} DEFERREDFRAMES;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:10;
		} __attribute__((packed)) B;
	} CRSERRS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} OCTETSRXEDBOTTOM;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:16;
		} __attribute__((packed)) B;
	} OCTETSRXEDTOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESRXEDOK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} BROADCASTRXED;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} MULTICASTRXED;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:16;
		} __attribute__((packed)) B;
	} PFRAMESRXED;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESRXED64;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESRXED65;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESRXED128;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESRXED256;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESRXED512;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESRXED1024;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} FRAMESRXED1519;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:10;
		} __attribute__((packed)) B;
	} UNDERSIZEFRAMES;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:10;
		} __attribute__((packed)) B;
	} EXCESSIVERXLEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:10;
		} __attribute__((packed)) B;
	} RXJABBERS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:10;
		} __attribute__((packed)) B;
	} FCSERRS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:10;
		} __attribute__((packed)) B;
	} RXLENERRS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:10;
		} __attribute__((packed)) B;
	} RXSYMBOLERRS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:10;
		} __attribute__((packed)) B;
	} ALIGNERRS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:18;
		} __attribute__((packed)) B;
	} RXRESOURCEERRS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:10;
		} __attribute__((packed)) B;
	} RXOVERRUNS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:8;
		} __attribute__((packed)) B;
	} RXIPCKERRS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:8;
		} __attribute__((packed)) B;
	} RXTCPCKERRS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:8;
		} __attribute__((packed)) B;
	} RXUDPCKERRS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:16;
		} __attribute__((packed)) B;
	} AUTOFLUSHEDPKTS;

