iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res5[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SUBNSINCR:16;
			uint64_t reservedSpace0:8;
			uint64_t SUBNSINCRLSB:8;
		} __attribute__((packed)) B;
	} TSUTIMERINCRSUBNSEC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMER:16;
		} __attribute__((packed)) B;
	} TSUTIMERMSBSEC;

	uint8_t res6[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMER:32;
		} __attribute__((packed)) B;
	} TSUTIMERSEC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMER:30;
		} __attribute__((packed)) B;
	} TSUTIMERNSEC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INCREMENTVAL:30;
			uint64_t reservedSpace0:1;
			uint64_t ADDSUBTRACT:1;
		} __attribute__((packed)) B;
	} TSUTIMERADJUST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t NSINCREMENT:8;
			uint64_t ALTNSINCR:8;
			uint64_t NUMINCS:8;
		} __attribute__((packed)) B;
	} TSUTIMERINCR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMER:32;
		} __attribute__((packed)) B;
	} TSUPTPTXSEC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMER:30;
		} __attribute__((packed)) B;
	} TSUPTPTXNSEC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMER:32;
		} __attribute__((packed)) B;
	} TSUPTPRXSEC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMER:30;
		} __attribute__((packed)) B;
	} TSUPTPRXNSEC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMER:32;
		} __attribute__((packed)) B;
	} TSUPEERTXSEC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMER:30;
		} __attribute__((packed)) B;
	} TSUPEERTXNSEC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMER:32;
		} __attribute__((packed)) B;
	} TSUPEERRXSEC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMER:30;
		} __attribute__((packed)) B;
	} TSUPEERRXNSEC;

	uint8_t res7[96];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t QUANTP2:16;
			uint64_t QUANTP3:16;
		} __attribute__((packed)) B;
	} TXPAUSEQUANT1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t QUANTP4:16;
			uint64_t QUANTP5:16;
		} __attribute__((packed)) B;
	} TXPAUSEQUANT2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t QUANTP6:16;
			uint64_t QUANTP7:16;
		} __attribute__((packed)) B;
	} TXPAUSEQUANT3;

	uint8_t res8[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:16;
		} __attribute__((packed)) B;
	} RXLPI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LPITIME:24;
		} __attribute__((packed)) B;
	} RXLPITIME;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:16;
		} __attribute__((packed)) B;
	} TXLPI;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LPITIME:24;
		} __attribute__((packed)) B;
	} TXLPITIME;

	uint8_t res9[588];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:4;
			uint64_t TXBDTSMODE:2;
		} __attribute__((packed)) B;
	} TXBDCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:4;
			uint64_t RXBDTSMODE:2;
		} __attribute__((packed)) B;
	} RXBDCTRL;

	uint8_t res10[1836];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MDIOPEN:1;
			uint64_t MIITXERPEN:1;
			uint64_t MIIRXERPEN:1;
			uint64_t MIIPEN:1;
			uint64_t RMIIPEN:1;
			uint64_t TSUTMRTOGPEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MIITXLOC:6;
			uint64_t reservedSpace0:2;
			uint64_t MIIRXLOC:6;
			uint64_t reservedSpace1:2;
			uint64_t MIICRSLOC:6;
			uint64_t reservedSpace2:2;
			uint64_t MIICOLLOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	uint8_t res11[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TSUEXTCLKLOC:6;
			uint64_t reservedSpace0:2;
			uint64_t TSUTMRTOGLOC:6;
			uint64_t reservedSpace1:2;
			uint64_t MDIOLOC:6;
			uint64_t reservedSpace2:2;
			uint64_t RMIILOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TSUCLKSEL:3;
			uint64_t reservedSpace0:1;
			uint64_t TSUPRESC:4;
			uint64_t MIISEL:1;
			uint64_t GBLCLKEN:1;
			uint64_t TXREFCLKSEL:1;
		} __attribute__((packed)) B;
	} CTRL;

} __attribute__((packed));

#define ETH (*(volatile struct ETH_tag *) 0x40024000)

struct SDIO_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t SDMASYSADDRARG:32;
		} __attribute__((packed)) B;
	} SDMASYSADDR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TFRBLKSIZE:12;
			uint64_t HSTSDMABUFSIZE:3;
			uint64_t reservedSpace0:1;
			uint64_t BLKSCNTFORCURRTFR:16;
		} __attribute__((packed)) B;
	} BLKSIZE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMDARG1:32;
		} __attribute__((packed)) B;
	} CMDARG1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAEN:1;
			uint64_t BLKCNTEN:1;
			uint64_t AUTOCMDEN:2;
			uint64_t DATDIRSEL:1;
			uint64_t MULTSINGBLKSEL:1;
			uint64_t reservedSpace0:10;
			uint64_t RESPTYPESEL:2;
			uint64_t reservedSpace1:1;
			uint64_t CMDCRCCHKEN:1;
			uint64_t CMDINDXCHKEN:1;
			uint64_t DATPRESSEL:1;
			uint64_t CMDTYPE:2;
			uint64_t CMDINDEX:6;
		} __attribute__((packed)) B;
	} TFRMODE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMDRESP0:32;
		} __attribute__((packed)) B;
	} RESP0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMDRESP1:32;
		} __attribute__((packed)) B;
	} RESP2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMDRESP2:32;
		} __attribute__((packed)) B;
	} RESP4;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMDRESP3:32;
		} __attribute__((packed)) B;
	} RESP6;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t BUFDAT:32;
		} __attribute__((packed)) B;
	} BUFDATPORT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMDINHIBITCMD:1;
			uint64_t CMDINHIBITDAT:1;
			uint64_t DATLINEACTIVE:1;
			uint64_t RETUNINGREQ:1;
			uint64_t reservedSpace0:4;
			uint64_t WRTRANACT:1;
			uint64_t RDTRANACT:1;
			uint64_t BUFFERWRITEENABLE:1;
			uint64_t BUFRDEN:1;
			uint64_t reservedSpace1:4;
			uint64_t CARDINS:1;
			uint64_t CARDSTATESTABLE:1;
			uint64_t CARDDETPINLVL:1;
			uint64_t WRPROTSWPINLVL:1;
			uint64_t DAT3TO0SIGLVL:4;
			uint64_t CMDSIGLVL:1;
			uint64_t DAT7TO4SIGLVL:4;
		} __attribute__((packed)) B;
	} PRSSTAT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LEDCTRL:1;
			uint64_t DATTRANWD:1;
			uint64_t HSEN:1;
			uint64_t DMASEL:2;
			uint64_t EXTDATTRANWD:1;
			uint64_t CDTSTLVL:1;
			uint64_t CDSIGDET:1;
			uint64_t SDBUSPOWER:1;
			uint64_t SDBUSVOLTSEL:3;
			uint64_t HRDRST:1;
			uint64_t reservedSpace0:3;
			uint64_t STOPATBLKGAPREQ:1;
			uint64_t CONTINUEREQ:1;
			uint64_t RDWAITCTRL:1;
			uint64_t INTATBLKGAP:1;
			uint64_t SPIMODE:1;
			uint64_t BOOTEN:1;
			uint64_t ALTBOOTEN:1;
			uint64_t BOOTACKCHK:1;
			uint64_t WKUPEVNTENONCARDINT:1;
			uint64_t WKUPEVNTENONCINS:1;
			uint64_t WKUPEVNTENONCRM:1;
		} __attribute__((packed)) B;
	} HOSTCTRL1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INTCLKEN:1;
			uint64_t INTCLKSTABLE:1;
			uint64_t SDCLKEN:1;
			uint64_t reservedSpace0:2;
			uint64_t CLKGENSEL:1;
			uint64_t UPPSDCLKFRE:2;
			uint64_t SDCLKFREQSEL:8;
			uint64_t DATTOUTCNTVAL:4;
			uint64_t reservedSpace1:4;
			uint64_t SFTRSTA:1;
			uint64_t SFTRSTCMD:1;
			uint64_t SFTRSTDAT:1;
		} __attribute__((packed)) B;
	} CLOCKCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMDCOM:1;
			uint64_t TRANCOM:1;
			uint64_t BLKGAPEVT:1;
			uint64_t DMAINT:1;
			uint64_t BFRWRRDY:1;
			uint64_t BFRRDRDY:1;
			uint64_t CARDINS:1;
			uint64_t CARDRM:1;
			uint64_t CARDINT:1;
			uint64_t reservedSpace0:3;
			uint64_t RETUNINGEVT:1;
			uint64_t BOOTACKRCV:1;
			uint64_t BOOTTERMINATE:1;
			uint64_t ERRINT:1;
			uint64_t CMDTOUTERR:1;
			uint64_t CMDCRCERR:1;
			uint64_t CMDENDBITERR:1;
			uint64_t CMDINDEXERR:1;
			uint64_t DATTOUTERR:1;
			uint64_t DATCRCERR:1;
			uint64_t DATENDBITERR:1;
			uint64_t CURRENTLIMITERR:1;
			uint64_t AUTOCMDERR:1;
			uint64_t ADMAERR:1;
			uint64_t reservedSpace1:2;
			uint64_t TARGETRESP:1;
		} __attribute__((packed)) B;
	} IFCR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMDCOMEN:1;
			uint64_t TRANCOMEN:1;
			uint64_t BLKGAPEVTEN:1;
			uint64_t DMAINTEN:1;
			uint64_t BUFWRRDYEN:1;
			uint64_t BUFRDRDYEN:1;
			uint64_t CARDINSEN:1;
			uint64_t CARDRMEN:1;
			uint64_t CARDINTEN:1;
			uint64_t reservedSpace0:3;
			uint64_t RETUNINGEVTEN:1;
			uint64_t BOOTACKRCVEN:1;
			uint64_t BOOTTERMINATEEN:1;
			uint64_t reservedSpace1:1;
			uint64_t CMDTOUTERREN:1;
			uint64_t CMDCRCERREN:1;
			uint64_t CMDENDBITERREN:1;
			uint64_t CMDINDEXERREN:1;
			uint64_t DATTOUTERREN:1;
			uint64_t DATCRCERREN:1;
			uint64_t DATENDBITERREN:1;
			uint64_t CURRENTLIMITERREN:1;
			uint64_t AUTOCMDERREN:1;
			uint64_t ADMAERREN:1;
			uint64_t TUNINGERREN:1;
			uint64_t reservedSpace2:1;
			uint64_t TARGETRESPEN:1;
		} __attribute__((packed)) B;
	} IFENC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMDCOMSEN:1;
			uint64_t TRANCOMSEN:1;
			uint64_t BLKGAPEVTSEN:1;
			uint64_t DMAINTSEN:1;
			uint64_t BUFWRRDYSEN:1;
			uint64_t BUFRDRDYSEN:1;
			uint64_t CARDINSSEN:1;
			uint64_t CARDREMSEN:1;
			uint64_t CARDINTSEN:1;
			uint64_t reservedSpace0:3;
			uint64_t RETUNINGEVTSEN:1;
			uint64_t BOOTACKRCVSEN:1;
			uint64_t BOOTTERMINATESEN:1;
			uint64_t reservedSpace1:1;
			uint64_t CMDTOUTERRSEN:1;
			uint64_t CMDCRCERRSEN:1;
			uint64_t CMDENDBITERRSEN:1;
			uint64_t CMDINDEXERRSEN:1;
			uint64_t DATTOUTERRSEN:1;
			uint64_t DATCRCERRSEN:1;
			uint64_t DATENDBITERRSEN:1;
			uint64_t CURRENTLIMITERRSEN:1;
			uint64_t AUTOCMDERRSEN:1;
			uint64_t ADMAERRSEN:1;
			uint64_t TUNINGERRSIGNALENABLE:1;
			uint64_t reservedSpace2:1;
			uint64_t TARGETRESPERRSEN:1;
		} __attribute__((packed)) B;
	} IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t AC12NOTEXE:1;
			uint64_t AC12TOE:1;
			uint64_t AC12CRCERR:1;
			uint64_t AC12ENDBITERR:1;
			uint64_t AC12INDEXERR:1;
			uint64_t reservedSpace0:2;
			uint64_t CNIBAC12ERR:1;
			uint64_t reservedSpace1:8;
			uint64_t UHSMODESEL:3;
			uint64_t SIGEN1P8V:1;
			uint64_t DRVSTNSEL:2;
			uint64_t EXETUNING:1;
			uint64_t SAMPCLKSEL:1;
			uint64_t reservedSpace2:6;
			uint64_t ASYNCINTEN:1;
			uint64_t PRSTVALEN:1;
		} __attribute__((packed)) B;
	} AC12ERRSTAT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TMOUTCLKFREQ:6;
			uint64_t reservedSpace0:1;
			uint64_t TMOUTCLKUNIT:1;
			uint64_t BASECLKFREQSD:8;
			uint64_t MAXBLOCKLEN:2;
			uint64_t EXTMEDIABUSSUP:1;
			uint64_t ADMA2SUP:1;
			uint64_t reservedSpace1:1;
			uint64_t HSSUP:1;
			uint64_t SDMASUP:1;
			uint64_t SUSRESSUP:1;
			uint64_t VOLTSUP3P3V:1;
			uint64_t VOLTSUP3P0V:1;
			uint64_t VOLTSUP1P8V:1;
			uint64_t reservedSpace2:1;
			uint64_t SYSBUS64BSUP:1;
			uint64_t ASYNCINTSUP:1;
			uint64_t IFSLOTTYPE:2;
		} __attribute__((packed)) B;
	} CAPAB0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SDR50SUP:1;
			uint64_t SDR104SUP:1;
			uint64_t DDR50SUP:1;
			uint64_t reservedSpace0:1;
			uint64_t DRVTYPASUP:1;
			uint64_t DRVTYPCSUP:1;
			uint64_t DRVTYPDSUP:1;
			uint64_t reservedSpace1:1;
			uint64_t TIMCNTRETUN:4;
			uint64_t reservedSpace2:1;
			uint64_t USETUNSDR50:1;
			uint64_t RETUNEMODES:2;
			uint64_t CLOCKKMUL:8;
			uint64_t SPIMODE:1;
			uint64_t SPIBLOCKMODE:1;
		} __attribute__((packed)) B;
	} CAPAB2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MAXCUR3P3VAL:8;
			uint64_t MAXCUR3P0VAL:8;
			uint64_t MAXCUR1P8VAL:8;
		} __attribute__((packed)) B;
	} MAXCURCAPAB;

