iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t AC12NEX:1;
			uint64_t AC12TOE:1;
			uint64_t AC12CRCE:1;
			uint64_t AC12EBE:1;
			uint64_t AC12INDXE:1;
			uint64_t reservedSpace0:2;
			uint64_t CNIBAC12E:1;
			uint64_t reservedSpace1:8;
			uint64_t CMDTOE:1;
			uint64_t CMDCRCE:1;
			uint64_t CMDEBE:1;
			uint64_t CMDINDXE:1;
			uint64_t DATTOE:1;
			uint64_t DATCRCE:1;
			uint64_t DATEBE:1;
			uint64_t CURLIMITE:1;
			uint64_t AC12E:1;
			uint64_t ADMAE:1;
			uint64_t TUNINGE:1;
			uint64_t reservedSpace2:1;
			uint64_t VENSPECE:4;
		} __attribute__((packed)) B;
	} FEVTERRSTAT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADMAES:2;
			uint64_t ADMALME:1;
		} __attribute__((packed)) B;
	} ADMAES;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADSADDR:32;
		} __attribute__((packed)) B;
	} ADSADDR;

	uint8_t res1[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INITSDCLKFREQVAL:10;
			uint64_t INITCLCKGENVAL:1;
			uint64_t reservedSpace0:3;
			uint64_t INITDRVSTVAL:2;
			uint64_t DSPSDCLKFREQVAL:10;
			uint64_t DSPCLKGENVAL:1;
			uint64_t reservedSpace1:3;
			uint64_t DSPDRVSTVAL:2;
		} __attribute__((packed)) B;
	} PRSTVAL0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HSPSDCLKFREQVAL:10;
			uint64_t HSPCLKGENVAL:1;
			uint64_t reservedSpace0:3;
			uint64_t HSPDRVSTVAL:2;
			uint64_t SDR12SDCLKFREQVAL:10;
			uint64_t SDR12CLKGENVAL:1;
			uint64_t reservedSpace1:3;
			uint64_t SDR12DRVSTVAL:2;
		} __attribute__((packed)) B;
	} PRSTVAL2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SDR25SDCLKFREQVAL:10;
			uint64_t SDR25CLKGENVAL:1;
			uint64_t reservedSpace0:3;
			uint64_t SDR25DRVSTVAL:2;
			uint64_t SDR50SDCLKFREQVAL:10;
			uint64_t SDR50CLCKGENVAL:1;
			uint64_t reservedSpace1:3;
			uint64_t SDR50DRVSTVAL:2;
		} __attribute__((packed)) B;
	} PRSTVAL4;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SDR104SDCLKFREQVAL:10;
			uint64_t SDR104CLKGENVAL:1;
			uint64_t reservedSpace0:3;
			uint64_t SDR104DRVSTVAL:2;
			uint64_t DDR50SDCLKFREQVAL:10;
			uint64_t DDR50CLKGENVAL:1;
			uint64_t reservedSpace1:3;
			uint64_t DDR50DRVSTVAL:2;
		} __attribute__((packed)) B;
	} PRSTVAL6;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t BOOTDATTOCNT:32;
		} __attribute__((packed)) B;
	} BOOTTOCTRL;

	uint8_t res2[136];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INTSLOT0:1;
			uint64_t reservedSpace0:15;
			uint64_t SPECVERNUM:8;
			uint64_t VENDVERNUM:8;
		} __attribute__((packed)) B;
	} SLOTINTSTAT;

	uint8_t res3[1792];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ITAPDLYEN:1;
			uint64_t ITAPDLYSEL:5;
			uint64_t ITAPCHGWIN:1;
			uint64_t OTAPDLYEN:1;
			uint64_t OTAPDLYSEL:4;
			uint64_t reservedSpace0:4;
			uint64_t TXDLYMUXSEL:2;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TUNINGCNT:6;
			uint64_t TOUTCLKFREQ:6;
			uint64_t TOUTCLKUNIT:1;
			uint64_t BASECLKFREQ:8;
			uint64_t MAXBLKLEN:2;
			uint64_t C8BITSUP:1;
			uint64_t CADMA2SUP:1;
			uint64_t CHSSUP:1;
			uint64_t CSDMASUP:1;
			uint64_t CSUSPRESSUP:1;
			uint64_t C3P3VSUP:1;
			uint64_t C3P0VSUP:1;
			uint64_t C1P8VSUP:1;
		} __attribute__((packed)) B;
	} CFG0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ASYNCINTRSUP:1;
			uint64_t SLOTTYPE:2;
			uint64_t CSDR50SUP:1;
			uint64_t CSDR104SUP:1;
			uint64_t CDDR50SUP:1;
			uint64_t CDRVASUP:1;
			uint64_t CDRVCSUP:1;
			uint64_t CDRVDSUP:1;
			uint64_t RETUNTMRCTL:4;
			uint64_t TUNSDR50:1;
			uint64_t RETUNMODES:2;
			uint64_t SPISUP:1;
			uint64_t reservedSpace0:1;
			uint64_t ASYNCWKUPEN:1;
		} __attribute__((packed)) B;
	} CFG1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INITSDCLKFREQ:10;
			uint64_t INITCLKGENEN:1;
			uint64_t INITDRVST:2;
			uint64_t reservedSpace0:3;
			uint64_t DSPSDCLKFREQ:10;
			uint64_t DSPCLKGENEN:1;
			uint64_t DSPDRVST:2;
		} __attribute__((packed)) B;
	} CFGPRESETVAL0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HSPSDCLKFREQ:10;
			uint64_t HSPCLKGENEN:1;
			uint64_t HSPDRVST:2;
			uint64_t reservedSpace0:3;
			uint64_t SDR12SDCLKFREQ:10;
			uint64_t SDR12CLKGENEN:1;
			uint64_t SDR12DRVST:2;
		} __attribute__((packed)) B;
	} CFGPRESETVAL1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SDR25SDCLKFREQ:10;
			uint64_t SDR25CLKGENEN:1;
			uint64_t SDR25DRVST:2;
			uint64_t reservedSpace0:3;
			uint64_t SDR50SDCLKFREQ:10;
			uint64_t SDR50CLKGENEN:1;
			uint64_t SDR50DRVST:2;
		} __attribute__((packed)) B;
	} CFGPRESETVAL2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SDR104SDCLKFREQ:10;
			uint64_t SDR104CLKGENEN:1;
			uint64_t SDR104DRVST:2;
			uint64_t reservedSpace0:3;
			uint64_t DDR50SDCLKFREQ:10;
			uint64_t DDR50CLKGENEN:1;
			uint64_t DDR50DRVST:2;
		} __attribute__((packed)) B;
	} CFGPRESETVAL3;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATLOC:6;
			uint64_t reservedSpace0:2;
			uint64_t CDLOC:6;
			uint64_t reservedSpace1:2;
			uint64_t WPLOC:6;
			uint64_t reservedSpace2:2;
			uint64_t CLKLOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMDLOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CLKPEN:1;
			uint64_t CMDPEN:1;
			uint64_t D0PEN:1;
			uint64_t D1PEN:1;
			uint64_t D2PEN:1;
			uint64_t D3PEN:1;
			uint64_t D4PEN:1;
			uint64_t D5PEN:1;
			uint64_t D6PEN:1;
			uint64_t D7PEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

} __attribute__((packed));

#define SDIO (*(volatile struct SDIO_tag *) 0x400f1000)

struct GPIO_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t DRIVESTRENGTH:1;
			uint64_t reservedSpace0:3;
			uint64_t SLEWRATE:3;
			uint64_t reservedSpace1:5;
			uint64_t DINDIS:1;
			uint64_t reservedSpace2:3;
			uint64_t DRIVESTRENGTHALT:1;
			uint64_t reservedSpace3:3;
			uint64_t SLEWRATEALT:3;
			uint64_t reservedSpace4:5;
			uint64_t DINDISALT:1;
		} __attribute__((packed)) B;
	} PA_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE0:4;
			uint64_t MODE1:4;
			uint64_t MODE2:4;
			uint64_t MODE3:4;
			uint64_t MODE4:4;
			uint64_t MODE5:4;
			uint64_t MODE6:4;
			uint64_t MODE7:4;
		} __attribute__((packed)) B;
	} PA_MODEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE8:4;
			uint64_t MODE9:4;
			uint64_t MODE10:4;
			uint64_t MODE11:4;
			uint64_t MODE12:4;
			uint64_t MODE13:4;
			uint64_t MODE14:4;
			uint64_t MODE15:4;
		} __attribute__((packed)) B;
	} PA_MODEH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUT:16;
		} __attribute__((packed)) B;
	} PA_DOUT;

