iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res0[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUTTGL:16;
		} __attribute__((packed)) B;
	} PA_DOUTTGL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DIN:16;
		} __attribute__((packed)) B;
	} PA_DIN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PINLOCKN:16;
		} __attribute__((packed)) B;
	} PA_PINLOCKN;

	uint8_t res1[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVTDIS:16;
		} __attribute__((packed)) B;
	} PA_OVTDIS;

	uint8_t res2[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DRIVESTRENGTH:1;
			uint64_t reservedSpace0:3;
			uint64_t SLEWRATE:3;
			uint64_t reservedSpace1:5;
			uint64_t DINDIS:1;
			uint64_t reservedSpace2:3;
			uint64_t DRIVESTRENGTHALT:1;
			uint64_t reservedSpace3:3;
			uint64_t SLEWRATEALT:3;
			uint64_t reservedSpace4:5;
			uint64_t DINDISALT:1;
		} __attribute__((packed)) B;
	} PB_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE0:4;
			uint64_t MODE1:4;
			uint64_t MODE2:4;
			uint64_t MODE3:4;
			uint64_t MODE4:4;
			uint64_t MODE5:4;
			uint64_t MODE6:4;
			uint64_t MODE7:4;
		} __attribute__((packed)) B;
	} PB_MODEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE8:4;
			uint64_t MODE9:4;
			uint64_t MODE10:4;
			uint64_t MODE11:4;
			uint64_t MODE12:4;
			uint64_t MODE13:4;
			uint64_t MODE14:4;
			uint64_t MODE15:4;
		} __attribute__((packed)) B;
	} PB_MODEH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUT:16;
		} __attribute__((packed)) B;
	} PB_DOUT;

	uint8_t res3[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUTTGL:16;
		} __attribute__((packed)) B;
	} PB_DOUTTGL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DIN:16;
		} __attribute__((packed)) B;
	} PB_DIN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PINLOCKN:16;
		} __attribute__((packed)) B;
	} PB_PINLOCKN;

	uint8_t res4[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVTDIS:16;
		} __attribute__((packed)) B;
	} PB_OVTDIS;

	uint8_t res5[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DRIVESTRENGTH:1;
			uint64_t reservedSpace0:3;
			uint64_t SLEWRATE:3;
			uint64_t reservedSpace1:5;
			uint64_t DINDIS:1;
			uint64_t reservedSpace2:3;
			uint64_t DRIVESTRENGTHALT:1;
			uint64_t reservedSpace3:3;
			uint64_t SLEWRATEALT:3;
			uint64_t reservedSpace4:5;
			uint64_t DINDISALT:1;
		} __attribute__((packed)) B;
	} PC_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE0:4;
			uint64_t MODE1:4;
			uint64_t MODE2:4;
			uint64_t MODE3:4;
			uint64_t MODE4:4;
			uint64_t MODE5:4;
			uint64_t MODE6:4;
			uint64_t MODE7:4;
		} __attribute__((packed)) B;
	} PC_MODEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE8:4;
			uint64_t MODE9:4;
			uint64_t MODE10:4;
			uint64_t MODE11:4;
			uint64_t MODE12:4;
			uint64_t MODE13:4;
			uint64_t MODE14:4;
			uint64_t MODE15:4;
		} __attribute__((packed)) B;
	} PC_MODEH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUT:16;
		} __attribute__((packed)) B;
	} PC_DOUT;

	uint8_t res6[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUTTGL:16;
		} __attribute__((packed)) B;
	} PC_DOUTTGL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DIN:16;
		} __attribute__((packed)) B;
	} PC_DIN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PINLOCKN:16;
		} __attribute__((packed)) B;
	} PC_PINLOCKN;

	uint8_t res7[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVTDIS:16;
		} __attribute__((packed)) B;
	} PC_OVTDIS;

	uint8_t res8[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DRIVESTRENGTH:1;
			uint64_t reservedSpace0:3;
			uint64_t SLEWRATE:3;
			uint64_t reservedSpace1:5;
			uint64_t DINDIS:1;
			uint64_t reservedSpace2:3;
			uint64_t DRIVESTRENGTHALT:1;
			uint64_t reservedSpace3:3;
			uint64_t SLEWRATEALT:3;
			uint64_t reservedSpace4:5;
			uint64_t DINDISALT:1;
		} __attribute__((packed)) B;
	} PD_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE0:4;
			uint64_t MODE1:4;
			uint64_t MODE2:4;
			uint64_t MODE3:4;
			uint64_t MODE4:4;
			uint64_t MODE5:4;
			uint64_t MODE6:4;
			uint64_t MODE7:4;
		} __attribute__((packed)) B;
	} PD_MODEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE8:4;
			uint64_t MODE9:4;
			uint64_t MODE10:4;
			uint64_t MODE11:4;
			uint64_t MODE12:4;
			uint64_t MODE13:4;
			uint64_t MODE14:4;
			uint64_t MODE15:4;
		} __attribute__((packed)) B;
	} PD_MODEH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUT:16;
		} __attribute__((packed)) B;
	} PD_DOUT;

	uint8_t res9[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUTTGL:16;
		} __attribute__((packed)) B;
	} PD_DOUTTGL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DIN:16;
		} __attribute__((packed)) B;
	} PD_DIN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PINLOCKN:16;
		} __attribute__((packed)) B;
	} PD_PINLOCKN;

	uint8_t res10[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVTDIS:16;
		} __attribute__((packed)) B;
	} PD_OVTDIS;

	uint8_t res11[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DRIVESTRENGTH:1;
			uint64_t reservedSpace0:3;
			uint64_t SLEWRATE:3;
			uint64_t reservedSpace1:5;
			uint64_t DINDIS:1;
			uint64_t reservedSpace2:3;
			uint64_t DRIVESTRENGTHALT:1;
			uint64_t reservedSpace3:3;
			uint64_t SLEWRATEALT:3;
			uint64_t reservedSpace4:5;
			uint64_t DINDISALT:1;
		} __attribute__((packed)) B;
	} PE_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE0:4;
			uint64_t MODE1:4;
			uint64_t MODE2:4;
			uint64_t MODE3:4;
			uint64_t MODE4:4;
			uint64_t MODE5:4;
			uint64_t MODE6:4;
			uint64_t MODE7:4;
		} __attribute__((packed)) B;
	} PE_MODEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE8:4;
			uint64_t MODE9:4;
			uint64_t MODE10:4;
			uint64_t MODE11:4;
			uint64_t MODE12:4;
			uint64_t MODE13:4;
			uint64_t MODE14:4;
			uint64_t MODE15:4;
		} __attribute__((packed)) B;
	} PE_MODEH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUT:16;
		} __attribute__((packed)) B;
	} PE_DOUT;

	uint8_t res12[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUTTGL:16;
		} __attribute__((packed)) B;
	} PE_DOUTTGL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DIN:16;
		} __attribute__((packed)) B;
	} PE_DIN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PINLOCKN:16;
		} __attribute__((packed)) B;
	} PE_PINLOCKN;

	uint8_t res13[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVTDIS:16;
		} __attribute__((packed)) B;
	} PE_OVTDIS;

	uint8_t res14[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DRIVESTRENGTH:1;
			uint64_t reservedSpace0:3;
			uint64_t SLEWRATE:3;
			uint64_t reservedSpace1:5;
			uint64_t DINDIS:1;
			uint64_t reservedSpace2:3;
			uint64_t DRIVESTRENGTHALT:1;
			uint64_t reservedSpace3:3;
			uint64_t SLEWRATEALT:3;
			uint64_t reservedSpace4:5;
			uint64_t DINDISALT:1;
		} __attribute__((packed)) B;
	} PF_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE0:4;
			uint64_t MODE1:4;
			uint64_t MODE2:4;
			uint64_t MODE3:4;
			uint64_t MODE4:4;
			uint64_t MODE5:4;
			uint64_t MODE6:4;
			uint64_t MODE7:4;
		} __attribute__((packed)) B;
	} PF_MODEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE8:4;
			uint64_t MODE9:4;
			uint64_t MODE10:4;
			uint64_t MODE11:4;
			uint64_t MODE12:4;
			uint64_t MODE13:4;
			uint64_t MODE14:4;
			uint64_t MODE15:4;
		} __attribute__((packed)) B;
	} PF_MODEH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUT:16;
		} __attribute__((packed)) B;
	} PF_DOUT;

	uint8_t res15[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUTTGL:16;
		} __attribute__((packed)) B;
	} PF_DOUTTGL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DIN:16;
		} __attribute__((packed)) B;
	} PF_DIN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PINLOCKN:16;
		} __attribute__((packed)) B;
	} PF_PINLOCKN;

	uint8_t res16[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVTDIS:16;
		} __attribute__((packed)) B;
	} PF_OVTDIS;

	uint8_t res17[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DRIVESTRENGTH:1;
			uint64_t reservedSpace0:3;
			uint64_t SLEWRATE:3;
			uint64_t reservedSpace1:5;
			uint64_t DINDIS:1;
			uint64_t reservedSpace2:3;
			uint64_t DRIVESTRENGTHALT:1;
			uint64_t reservedSpace3:3;
			uint64_t SLEWRATEALT:3;
			uint64_t reservedSpace4:5;
			uint64_t DINDISALT:1;
		} __attribute__((packed)) B;
	} PG_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE0:4;
			uint64_t MODE1:4;
			uint64_t MODE2:4;
			uint64_t MODE3:4;
			uint64_t MODE4:4;
			uint64_t MODE5:4;
			uint64_t MODE6:4;
			uint64_t MODE7:4;
		} __attribute__((packed)) B;
	} PG_MODEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE8:4;
			uint64_t MODE9:4;
			uint64_t MODE10:4;
			uint64_t MODE11:4;
			uint64_t MODE12:4;
			uint64_t MODE13:4;
			uint64_t MODE14:4;
			uint64_t MODE15:4;
		} __attribute__((packed)) B;
	} PG_MODEH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUT:16;
		} __attribute__((packed)) B;
	} PG_DOUT;

	uint8_t res18[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUTTGL:16;
		} __attribute__((packed)) B;
	} PG_DOUTTGL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DIN:16;
		} __attribute__((packed)) B;
	} PG_DIN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PINLOCKN:16;
		} __attribute__((packed)) B;
	} PG_PINLOCKN;

	uint8_t res19[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVTDIS:16;
		} __attribute__((packed)) B;
	} PG_OVTDIS;

	uint8_t res20[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DRIVESTRENGTH:1;
			uint64_t reservedSpace0:3;
			uint64_t SLEWRATE:3;
			uint64_t reservedSpace1:5;
			uint64_t DINDIS:1;
			uint64_t reservedSpace2:3;
			uint64_t DRIVESTRENGTHALT:1;
			uint64_t reservedSpace3:3;
			uint64_t SLEWRATEALT:3;
			uint64_t reservedSpace4:5;
			uint64_t DINDISALT:1;
		} __attribute__((packed)) B;
	} PH_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE0:4;
			uint64_t MODE1:4;
			uint64_t MODE2:4;
			uint64_t MODE3:4;
			uint64_t MODE4:4;
			uint64_t MODE5:4;
			uint64_t MODE6:4;
			uint64_t MODE7:4;
		} __attribute__((packed)) B;
	} PH_MODEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE8:4;
			uint64_t MODE9:4;
			uint64_t MODE10:4;
			uint64_t MODE11:4;
			uint64_t MODE12:4;
			uint64_t MODE13:4;
			uint64_t MODE14:4;
			uint64_t MODE15:4;
		} __attribute__((packed)) B;
	} PH_MODEH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUT:16;
		} __attribute__((packed)) B;
	} PH_DOUT;

	uint8_t res21[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUTTGL:16;
		} __attribute__((packed)) B;
	} PH_DOUTTGL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DIN:16;
		} __attribute__((packed)) B;
	} PH_DIN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PINLOCKN:16;
		} __attribute__((packed)) B;
	} PH_PINLOCKN;

	uint8_t res22[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVTDIS:16;
		} __attribute__((packed)) B;
	} PH_OVTDIS;

	uint8_t res23[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DRIVESTRENGTH:1;
			uint64_t reservedSpace0:3;
			uint64_t SLEWRATE:3;
			uint64_t reservedSpace1:5;
			uint64_t DINDIS:1;
			uint64_t reservedSpace2:3;
			uint64_t DRIVESTRENGTHALT:1;
			uint64_t reservedSpace3:3;
			uint64_t SLEWRATEALT:3;
			uint64_t reservedSpace4:5;
			uint64_t DINDISALT:1;
		} __attribute__((packed)) B;
	} PI_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE0:4;
			uint64_t MODE1:4;
			uint64_t MODE2:4;
			uint64_t MODE3:4;
			uint64_t MODE4:4;
			uint64_t MODE5:4;
			uint64_t MODE6:4;
			uint64_t MODE7:4;
		} __attribute__((packed)) B;
	} PI_MODEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE8:4;
			uint64_t MODE9:4;
			uint64_t MODE10:4;
			uint64_t MODE11:4;
			uint64_t MODE12:4;
			uint64_t MODE13:4;
			uint64_t MODE14:4;
			uint64_t MODE15:4;
		} __attribute__((packed)) B;
	} PI_MODEH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUT:16;
		} __attribute__((packed)) B;
	} PI_DOUT;

	uint8_t res24[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUTTGL:16;
		} __attribute__((packed)) B;
	} PI_DOUTTGL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DIN:16;
		} __attribute__((packed)) B;
	} PI_DIN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PINLOCKN:16;
		} __attribute__((packed)) B;
	} PI_PINLOCKN;

	uint8_t res25[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVTDIS:16;
		} __attribute__((packed)) B;
	} PI_OVTDIS;

	uint8_t res26[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DRIVESTRENGTH:1;
			uint64_t reservedSpace0:3;
			uint64_t SLEWRATE:3;
			uint64_t reservedSpace1:5;
			uint64_t DINDIS:1;
			uint64_t reservedSpace2:3;
			uint64_t DRIVESTRENGTHALT:1;
			uint64_t reservedSpace3:3;
			uint64_t SLEWRATEALT:3;
			uint64_t reservedSpace4:5;
			uint64_t DINDISALT:1;
		} __attribute__((packed)) B;
	} PJ_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE0:4;
			uint64_t MODE1:4;
			uint64_t MODE2:4;
			uint64_t MODE3:4;
			uint64_t MODE4:4;
			uint64_t MODE5:4;
			uint64_t MODE6:4;
			uint64_t MODE7:4;
		} __attribute__((packed)) B;
	} PJ_MODEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE8:4;
			uint64_t MODE9:4;
			uint64_t MODE10:4;
			uint64_t MODE11:4;
			uint64_t MODE12:4;
			uint64_t MODE13:4;
			uint64_t MODE14:4;
			uint64_t MODE15:4;
		} __attribute__((packed)) B;
	} PJ_MODEH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUT:16;
		} __attribute__((packed)) B;
	} PJ_DOUT;

	uint8_t res27[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DOUTTGL:16;
		} __attribute__((packed)) B;
	} PJ_DOUTTGL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DIN:16;
		} __attribute__((packed)) B;
	} PJ_DIN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PINLOCKN:16;
		} __attribute__((packed)) B;
	} PJ_PINLOCKN;

