iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res37[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INT:1;
			uint64_t EM4WU:1;
		} __attribute__((packed)) B;
	} INSENSE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOCKKEY:16;
		} __attribute__((packed)) B;
	} LOCK;

} __attribute__((packed));

#define GPIO (*(volatile struct GPIO_tag *) 0x40088000)

struct PRS_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH0PULSE:1;
			uint64_t CH1PULSE:1;
			uint64_t CH2PULSE:1;
			uint64_t CH3PULSE:1;
			uint64_t CH4PULSE:1;
			uint64_t CH5PULSE:1;
			uint64_t CH6PULSE:1;
			uint64_t CH7PULSE:1;
			uint64_t CH8PULSE:1;
			uint64_t CH9PULSE:1;
			uint64_t CH10PULSE:1;
			uint64_t CH11PULSE:1;
			uint64_t CH12PULSE:1;
			uint64_t CH13PULSE:1;
			uint64_t CH14PULSE:1;
			uint64_t CH15PULSE:1;
			uint64_t CH16PULSE:1;
			uint64_t CH17PULSE:1;
			uint64_t CH18PULSE:1;
			uint64_t CH19PULSE:1;
			uint64_t CH20PULSE:1;
			uint64_t CH21PULSE:1;
			uint64_t CH22PULSE:1;
			uint64_t CH23PULSE:1;
		} __attribute__((packed)) B;
	} SWPULSE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH0LEVEL:1;
			uint64_t CH1LEVEL:1;
			uint64_t CH2LEVEL:1;
			uint64_t CH3LEVEL:1;
			uint64_t CH4LEVEL:1;
			uint64_t CH5LEVEL:1;
			uint64_t CH6LEVEL:1;
			uint64_t CH7LEVEL:1;
			uint64_t CH8LEVEL:1;
			uint64_t CH9LEVEL:1;
			uint64_t CH10LEVEL:1;
			uint64_t CH11LEVEL:1;
			uint64_t CH12LEVEL:1;
			uint64_t CH13LEVEL:1;
			uint64_t CH14LEVEL:1;
			uint64_t CH15LEVEL:1;
			uint64_t CH16LEVEL:1;
			uint64_t CH17LEVEL:1;
			uint64_t CH18LEVEL:1;
			uint64_t CH19LEVEL:1;
			uint64_t CH20LEVEL:1;
			uint64_t CH21LEVEL:1;
			uint64_t CH22LEVEL:1;
			uint64_t CH23LEVEL:1;
		} __attribute__((packed)) B;
	} SWLEVEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH0PEN:1;
			uint64_t CH1PEN:1;
			uint64_t CH2PEN:1;
			uint64_t CH3PEN:1;
			uint64_t CH4PEN:1;
			uint64_t CH5PEN:1;
			uint64_t CH6PEN:1;
			uint64_t CH7PEN:1;
			uint64_t CH8PEN:1;
			uint64_t CH9PEN:1;
			uint64_t CH10PEN:1;
			uint64_t CH11PEN:1;
			uint64_t CH12PEN:1;
			uint64_t CH13PEN:1;
			uint64_t CH14PEN:1;
			uint64_t CH15PEN:1;
			uint64_t CH16PEN:1;
			uint64_t CH17PEN:1;
			uint64_t CH18PEN:1;
			uint64_t CH19PEN:1;
			uint64_t CH20PEN:1;
			uint64_t CH21PEN:1;
			uint64_t CH22PEN:1;
			uint64_t CH23PEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH0LOC:6;
			uint64_t reservedSpace0:2;
			uint64_t CH1LOC:6;
			uint64_t reservedSpace1:2;
			uint64_t CH2LOC:6;
			uint64_t reservedSpace2:2;
			uint64_t CH3LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH4LOC:6;
			uint64_t reservedSpace0:2;
			uint64_t CH5LOC:6;
			uint64_t reservedSpace1:2;
			uint64_t CH6LOC:6;
			uint64_t reservedSpace2:2;
			uint64_t CH7LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH8LOC:6;
			uint64_t reservedSpace0:2;
			uint64_t CH9LOC:6;
			uint64_t reservedSpace1:2;
			uint64_t CH10LOC:6;
			uint64_t reservedSpace2:2;
			uint64_t CH11LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH12LOC:6;
			uint64_t reservedSpace0:2;
			uint64_t CH13LOC:6;
			uint64_t reservedSpace1:2;
			uint64_t CH14LOC:6;
			uint64_t reservedSpace2:2;
			uint64_t CH15LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC3;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH16LOC:6;
			uint64_t reservedSpace0:2;
			uint64_t CH17LOC:6;
			uint64_t reservedSpace1:2;
			uint64_t CH18LOC:6;
			uint64_t reservedSpace2:2;
			uint64_t CH19LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC4;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH20LOC:6;
			uint64_t reservedSpace0:2;
			uint64_t CH21LOC:6;
			uint64_t reservedSpace1:2;
			uint64_t CH22LOC:6;
			uint64_t reservedSpace2:2;
			uint64_t CH23LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC5;

	uint8_t res1[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEVONPRS:1;
			uint64_t SEVONPRSSEL:5;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:6;
			uint64_t PRSSEL:5;
		} __attribute__((packed)) B;
	} DMAREQ0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:6;
			uint64_t PRSSEL:5;
		} __attribute__((packed)) B;
	} DMAREQ1;

	uint8_t res2[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CH0VAL:1;
			uint64_t CH1VAL:1;
			uint64_t CH2VAL:1;
			uint64_t CH3VAL:1;
			uint64_t CH4VAL:1;
			uint64_t CH5VAL:1;
			uint64_t CH6VAL:1;
			uint64_t CH7VAL:1;
			uint64_t CH8VAL:1;
			uint64_t CH9VAL:1;
			uint64_t CH10VAL:1;
			uint64_t CH11VAL:1;
			uint64_t CH12VAL:1;
			uint64_t CH13VAL:1;
			uint64_t CH14VAL:1;
			uint64_t CH15VAL:1;
			uint64_t CH16VAL:1;
			uint64_t CH17VAL:1;
			uint64_t CH18VAL:1;
			uint64_t CH19VAL:1;
			uint64_t CH20VAL:1;
			uint64_t CH21VAL:1;
			uint64_t CH22VAL:1;
			uint64_t CH23VAL:1;
		} __attribute__((packed)) B;
	} PEEK;

	uint8_t res3[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH0_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH1_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH2_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH3_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH4_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH5_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH6_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH7_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH8_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH9_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH10_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH11_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH12_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH13_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH14_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH15_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH16_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH17_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH18_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH19_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH20_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH21_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH22_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:3;
			uint64_t reservedSpace0:5;
			uint64_t SOURCESEL:7;
			uint64_t reservedSpace1:5;
			uint64_t EDSEL:2;
			uint64_t reservedSpace2:3;
			uint64_t STRETCH:1;
			uint64_t INV:1;
			uint64_t ORPREV:1;
			uint64_t ANDNEXT:1;
			uint64_t reservedSpace3:1;
			uint64_t ASYNC:1;
		} __attribute__((packed)) B;
	} CH23_CTRL;

} __attribute__((packed));

