iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
#define PRS (*(volatile struct PRS_tag *) 0x400e6000)

struct LDMA_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t SYNCPRSSETEN:8;
			uint64_t SYNCPRSCLREN:8;
			uint64_t reservedSpace0:8;
			uint64_t NUMFIXED:5;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ANYBUSY:1;
			uint64_t ANYREQ:1;
			uint64_t reservedSpace0:1;
			uint64_t CHGRANT:5;
			uint64_t CHERROR:5;
			uint64_t reservedSpace1:3;
			uint64_t FIFOLEVEL:5;
			uint64_t reservedSpace2:3;
			uint64_t CHNUM:5;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SYNCTRIG:8;
		} __attribute__((packed)) B;
	} SYNC;

	uint8_t res0[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CHEN:24;
		} __attribute__((packed)) B;
	} CHEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t BUSY:24;
		} __attribute__((packed)) B;
	} CHBUSY;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CHDONE:24;
		} __attribute__((packed)) B;
	} CHDONE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DBGHALT:24;
		} __attribute__((packed)) B;
	} DBGHALT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SWREQ:24;
		} __attribute__((packed)) B;
	} SWREQ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REQDIS:24;
		} __attribute__((packed)) B;
	} REQDIS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REQPEND:24;
		} __attribute__((packed)) B;
	} REQPEND;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKLOAD:24;
		} __attribute__((packed)) B;
	} LINKLOAD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REQCLEAR:24;
		} __attribute__((packed)) B;
	} REQCLEAR;

	uint8_t res1[28];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DONE:24;
			uint64_t reservedSpace0:7;
			uint64_t ERROR:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DONE:24;
			uint64_t reservedSpace0:7;
			uint64_t ERROR:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DONE:24;
			uint64_t reservedSpace0:7;
			uint64_t ERROR:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DONE:24;
			uint64_t reservedSpace0:7;
			uint64_t ERROR:1;
		} __attribute__((packed)) B;
	} IEN;

	uint8_t res2[16];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t SOURCESEL:6;
		} __attribute__((packed)) B;
	} CH0_REQSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t ARBSLOTS:2;
			uint64_t reservedSpace1:2;
			uint64_t SRCINCSIGN:1;
			uint64_t DSTINCSIGN:1;
		} __attribute__((packed)) B;
	} CH0_CFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOOPCNT:8;
		} __attribute__((packed)) B;
	} CH0_LOOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STRUCTTYPE:2;
			uint64_t reservedSpace0:1;
			uint64_t STRUCTREQ:1;
			uint64_t XFERCNT:11;
			uint64_t BYTESWAP:1;
			uint64_t BLOCKSIZE:4;
			uint64_t DONEIFSEN:1;
			uint64_t REQMODE:1;
			uint64_t DECLOOPCNT:1;
			uint64_t IGNORESREQ:1;
			uint64_t SRCINC:2;
			uint64_t SIZE:2;
			uint64_t DSTINC:2;
			uint64_t SRCMODE:1;
			uint64_t DSTMODE:1;
		} __attribute__((packed)) B;
	} CH0_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRCADDR:32;
		} __attribute__((packed)) B;
	} CH0_SRC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DSTADDR:32;
		} __attribute__((packed)) B;
	} CH0_DST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKMODE:1;
			uint64_t LINK:1;
			uint64_t LINKADDR:30;
		} __attribute__((packed)) B;
	} CH0_LINK;

	uint8_t res3[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t SOURCESEL:6;
		} __attribute__((packed)) B;
	} CH1_REQSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t ARBSLOTS:2;
			uint64_t reservedSpace1:2;
			uint64_t SRCINCSIGN:1;
			uint64_t DSTINCSIGN:1;
		} __attribute__((packed)) B;
	} CH1_CFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOOPCNT:8;
		} __attribute__((packed)) B;
	} CH1_LOOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STRUCTTYPE:2;
			uint64_t reservedSpace0:1;
			uint64_t STRUCTREQ:1;
			uint64_t XFERCNT:11;
			uint64_t BYTESWAP:1;
			uint64_t BLOCKSIZE:4;
			uint64_t DONEIFSEN:1;
			uint64_t REQMODE:1;
			uint64_t DECLOOPCNT:1;
			uint64_t IGNORESREQ:1;
			uint64_t SRCINC:2;
			uint64_t SIZE:2;
			uint64_t DSTINC:2;
			uint64_t SRCMODE:1;
			uint64_t DSTMODE:1;
		} __attribute__((packed)) B;
	} CH1_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRCADDR:32;
		} __attribute__((packed)) B;
	} CH1_SRC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DSTADDR:32;
		} __attribute__((packed)) B;
	} CH1_DST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKMODE:1;
			uint64_t LINK:1;
			uint64_t LINKADDR:30;
		} __attribute__((packed)) B;
	} CH1_LINK;

	uint8_t res4[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t SOURCESEL:6;
		} __attribute__((packed)) B;
	} CH2_REQSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t ARBSLOTS:2;
			uint64_t reservedSpace1:2;
			uint64_t SRCINCSIGN:1;
			uint64_t DSTINCSIGN:1;
		} __attribute__((packed)) B;
	} CH2_CFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOOPCNT:8;
		} __attribute__((packed)) B;
	} CH2_LOOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STRUCTTYPE:2;
			uint64_t reservedSpace0:1;
			uint64_t STRUCTREQ:1;
			uint64_t XFERCNT:11;
			uint64_t BYTESWAP:1;
			uint64_t BLOCKSIZE:4;
			uint64_t DONEIFSEN:1;
			uint64_t REQMODE:1;
			uint64_t DECLOOPCNT:1;
			uint64_t IGNORESREQ:1;
			uint64_t SRCINC:2;
			uint64_t SIZE:2;
			uint64_t DSTINC:2;
			uint64_t SRCMODE:1;
			uint64_t DSTMODE:1;
		} __attribute__((packed)) B;
	} CH2_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRCADDR:32;
		} __attribute__((packed)) B;
	} CH2_SRC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DSTADDR:32;
		} __attribute__((packed)) B;
	} CH2_DST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKMODE:1;
			uint64_t LINK:1;
			uint64_t LINKADDR:30;
		} __attribute__((packed)) B;
	} CH2_LINK;

