iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res5[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t SOURCESEL:6;
		} __attribute__((packed)) B;
	} CH3_REQSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t ARBSLOTS:2;
			uint64_t reservedSpace1:2;
			uint64_t SRCINCSIGN:1;
			uint64_t DSTINCSIGN:1;
		} __attribute__((packed)) B;
	} CH3_CFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOOPCNT:8;
		} __attribute__((packed)) B;
	} CH3_LOOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STRUCTTYPE:2;
			uint64_t reservedSpace0:1;
			uint64_t STRUCTREQ:1;
			uint64_t XFERCNT:11;
			uint64_t BYTESWAP:1;
			uint64_t BLOCKSIZE:4;
			uint64_t DONEIFSEN:1;
			uint64_t REQMODE:1;
			uint64_t DECLOOPCNT:1;
			uint64_t IGNORESREQ:1;
			uint64_t SRCINC:2;
			uint64_t SIZE:2;
			uint64_t DSTINC:2;
			uint64_t SRCMODE:1;
			uint64_t DSTMODE:1;
		} __attribute__((packed)) B;
	} CH3_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRCADDR:32;
		} __attribute__((packed)) B;
	} CH3_SRC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DSTADDR:32;
		} __attribute__((packed)) B;
	} CH3_DST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKMODE:1;
			uint64_t LINK:1;
			uint64_t LINKADDR:30;
		} __attribute__((packed)) B;
	} CH3_LINK;

	uint8_t res6[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t SOURCESEL:6;
		} __attribute__((packed)) B;
	} CH4_REQSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t ARBSLOTS:2;
			uint64_t reservedSpace1:2;
			uint64_t SRCINCSIGN:1;
			uint64_t DSTINCSIGN:1;
		} __attribute__((packed)) B;
	} CH4_CFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOOPCNT:8;
		} __attribute__((packed)) B;
	} CH4_LOOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STRUCTTYPE:2;
			uint64_t reservedSpace0:1;
			uint64_t STRUCTREQ:1;
			uint64_t XFERCNT:11;
			uint64_t BYTESWAP:1;
			uint64_t BLOCKSIZE:4;
			uint64_t DONEIFSEN:1;
			uint64_t REQMODE:1;
			uint64_t DECLOOPCNT:1;
			uint64_t IGNORESREQ:1;
			uint64_t SRCINC:2;
			uint64_t SIZE:2;
			uint64_t DSTINC:2;
			uint64_t SRCMODE:1;
			uint64_t DSTMODE:1;
		} __attribute__((packed)) B;
	} CH4_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRCADDR:32;
		} __attribute__((packed)) B;
	} CH4_SRC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DSTADDR:32;
		} __attribute__((packed)) B;
	} CH4_DST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKMODE:1;
			uint64_t LINK:1;
			uint64_t LINKADDR:30;
		} __attribute__((packed)) B;
	} CH4_LINK;

	uint8_t res7[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t SOURCESEL:6;
		} __attribute__((packed)) B;
	} CH5_REQSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t ARBSLOTS:2;
			uint64_t reservedSpace1:2;
			uint64_t SRCINCSIGN:1;
			uint64_t DSTINCSIGN:1;
		} __attribute__((packed)) B;
	} CH5_CFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOOPCNT:8;
		} __attribute__((packed)) B;
	} CH5_LOOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STRUCTTYPE:2;
			uint64_t reservedSpace0:1;
			uint64_t STRUCTREQ:1;
			uint64_t XFERCNT:11;
			uint64_t BYTESWAP:1;
			uint64_t BLOCKSIZE:4;
			uint64_t DONEIFSEN:1;
			uint64_t REQMODE:1;
			uint64_t DECLOOPCNT:1;
			uint64_t IGNORESREQ:1;
			uint64_t SRCINC:2;
			uint64_t SIZE:2;
			uint64_t DSTINC:2;
			uint64_t SRCMODE:1;
			uint64_t DSTMODE:1;
		} __attribute__((packed)) B;
	} CH5_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRCADDR:32;
		} __attribute__((packed)) B;
	} CH5_SRC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DSTADDR:32;
		} __attribute__((packed)) B;
	} CH5_DST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKMODE:1;
			uint64_t LINK:1;
			uint64_t LINKADDR:30;
		} __attribute__((packed)) B;
	} CH5_LINK;

	uint8_t res8[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t SOURCESEL:6;
		} __attribute__((packed)) B;
	} CH6_REQSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t ARBSLOTS:2;
			uint64_t reservedSpace1:2;
			uint64_t SRCINCSIGN:1;
			uint64_t DSTINCSIGN:1;
		} __attribute__((packed)) B;
	} CH6_CFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOOPCNT:8;
		} __attribute__((packed)) B;
	} CH6_LOOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STRUCTTYPE:2;
			uint64_t reservedSpace0:1;
			uint64_t STRUCTREQ:1;
			uint64_t XFERCNT:11;
			uint64_t BYTESWAP:1;
			uint64_t BLOCKSIZE:4;
			uint64_t DONEIFSEN:1;
			uint64_t REQMODE:1;
			uint64_t DECLOOPCNT:1;
			uint64_t IGNORESREQ:1;
			uint64_t SRCINC:2;
			uint64_t SIZE:2;
			uint64_t DSTINC:2;
			uint64_t SRCMODE:1;
			uint64_t DSTMODE:1;
		} __attribute__((packed)) B;
	} CH6_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRCADDR:32;
		} __attribute__((packed)) B;
	} CH6_SRC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DSTADDR:32;
		} __attribute__((packed)) B;
	} CH6_DST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKMODE:1;
			uint64_t LINK:1;
			uint64_t LINKADDR:30;
		} __attribute__((packed)) B;
	} CH6_LINK;

	uint8_t res9[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t SOURCESEL:6;
		} __attribute__((packed)) B;
	} CH7_REQSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t ARBSLOTS:2;
			uint64_t reservedSpace1:2;
			uint64_t SRCINCSIGN:1;
			uint64_t DSTINCSIGN:1;
		} __attribute__((packed)) B;
	} CH7_CFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOOPCNT:8;
		} __attribute__((packed)) B;
	} CH7_LOOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STRUCTTYPE:2;
			uint64_t reservedSpace0:1;
			uint64_t STRUCTREQ:1;
			uint64_t XFERCNT:11;
			uint64_t BYTESWAP:1;
			uint64_t BLOCKSIZE:4;
			uint64_t DONEIFSEN:1;
			uint64_t REQMODE:1;
			uint64_t DECLOOPCNT:1;
			uint64_t IGNORESREQ:1;
			uint64_t SRCINC:2;
			uint64_t SIZE:2;
			uint64_t DSTINC:2;
			uint64_t SRCMODE:1;
			uint64_t DSTMODE:1;
		} __attribute__((packed)) B;
	} CH7_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRCADDR:32;
		} __attribute__((packed)) B;
	} CH7_SRC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DSTADDR:32;
		} __attribute__((packed)) B;
	} CH7_DST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKMODE:1;
			uint64_t LINK:1;
			uint64_t LINKADDR:30;
		} __attribute__((packed)) B;
	} CH7_LINK;

	uint8_t res10[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t SOURCESEL:6;
		} __attribute__((packed)) B;
	} CH8_REQSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t ARBSLOTS:2;
			uint64_t reservedSpace1:2;
			uint64_t SRCINCSIGN:1;
			uint64_t DSTINCSIGN:1;
		} __attribute__((packed)) B;
	} CH8_CFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOOPCNT:8;
		} __attribute__((packed)) B;
	} CH8_LOOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STRUCTTYPE:2;
			uint64_t reservedSpace0:1;
			uint64_t STRUCTREQ:1;
			uint64_t XFERCNT:11;
			uint64_t BYTESWAP:1;
			uint64_t BLOCKSIZE:4;
			uint64_t DONEIFSEN:1;
			uint64_t REQMODE:1;
			uint64_t DECLOOPCNT:1;
			uint64_t IGNORESREQ:1;
			uint64_t SRCINC:2;
			uint64_t SIZE:2;
			uint64_t DSTINC:2;
			uint64_t SRCMODE:1;
			uint64_t DSTMODE:1;
		} __attribute__((packed)) B;
	} CH8_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRCADDR:32;
		} __attribute__((packed)) B;
	} CH8_SRC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DSTADDR:32;
		} __attribute__((packed)) B;
	} CH8_DST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKMODE:1;
			uint64_t LINK:1;
			uint64_t LINKADDR:30;
		} __attribute__((packed)) B;
	} CH8_LINK;

	uint8_t res11[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t SOURCESEL:6;
		} __attribute__((packed)) B;
	} CH9_REQSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t ARBSLOTS:2;
			uint64_t reservedSpace1:2;
			uint64_t SRCINCSIGN:1;
			uint64_t DSTINCSIGN:1;
		} __attribute__((packed)) B;
	} CH9_CFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOOPCNT:8;
		} __attribute__((packed)) B;
	} CH9_LOOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STRUCTTYPE:2;
			uint64_t reservedSpace0:1;
			uint64_t STRUCTREQ:1;
			uint64_t XFERCNT:11;
			uint64_t BYTESWAP:1;
			uint64_t BLOCKSIZE:4;
			uint64_t DONEIFSEN:1;
			uint64_t REQMODE:1;
			uint64_t DECLOOPCNT:1;
			uint64_t IGNORESREQ:1;
			uint64_t SRCINC:2;
			uint64_t SIZE:2;
			uint64_t DSTINC:2;
			uint64_t SRCMODE:1;
			uint64_t DSTMODE:1;
		} __attribute__((packed)) B;
	} CH9_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRCADDR:32;
		} __attribute__((packed)) B;
	} CH9_SRC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DSTADDR:32;
		} __attribute__((packed)) B;
	} CH9_DST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKMODE:1;
			uint64_t LINK:1;
			uint64_t LINKADDR:30;
		} __attribute__((packed)) B;
	} CH9_LINK;

