iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res23[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t SOURCESEL:6;
		} __attribute__((packed)) B;
	} CH21_REQSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t ARBSLOTS:2;
			uint64_t reservedSpace1:2;
			uint64_t SRCINCSIGN:1;
			uint64_t DSTINCSIGN:1;
		} __attribute__((packed)) B;
	} CH21_CFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOOPCNT:8;
		} __attribute__((packed)) B;
	} CH21_LOOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STRUCTTYPE:2;
			uint64_t reservedSpace0:1;
			uint64_t STRUCTREQ:1;
			uint64_t XFERCNT:11;
			uint64_t BYTESWAP:1;
			uint64_t BLOCKSIZE:4;
			uint64_t DONEIFSEN:1;
			uint64_t REQMODE:1;
			uint64_t DECLOOPCNT:1;
			uint64_t IGNORESREQ:1;
			uint64_t SRCINC:2;
			uint64_t SIZE:2;
			uint64_t DSTINC:2;
			uint64_t SRCMODE:1;
			uint64_t DSTMODE:1;
		} __attribute__((packed)) B;
	} CH21_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRCADDR:32;
		} __attribute__((packed)) B;
	} CH21_SRC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DSTADDR:32;
		} __attribute__((packed)) B;
	} CH21_DST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKMODE:1;
			uint64_t LINK:1;
			uint64_t LINKADDR:30;
		} __attribute__((packed)) B;
	} CH21_LINK;

	uint8_t res24[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t SOURCESEL:6;
		} __attribute__((packed)) B;
	} CH22_REQSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t ARBSLOTS:2;
			uint64_t reservedSpace1:2;
			uint64_t SRCINCSIGN:1;
			uint64_t DSTINCSIGN:1;
		} __attribute__((packed)) B;
	} CH22_CFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOOPCNT:8;
		} __attribute__((packed)) B;
	} CH22_LOOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STRUCTTYPE:2;
			uint64_t reservedSpace0:1;
			uint64_t STRUCTREQ:1;
			uint64_t XFERCNT:11;
			uint64_t BYTESWAP:1;
			uint64_t BLOCKSIZE:4;
			uint64_t DONEIFSEN:1;
			uint64_t REQMODE:1;
			uint64_t DECLOOPCNT:1;
			uint64_t IGNORESREQ:1;
			uint64_t SRCINC:2;
			uint64_t SIZE:2;
			uint64_t DSTINC:2;
			uint64_t SRCMODE:1;
			uint64_t DSTMODE:1;
		} __attribute__((packed)) B;
	} CH22_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRCADDR:32;
		} __attribute__((packed)) B;
	} CH22_SRC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DSTADDR:32;
		} __attribute__((packed)) B;
	} CH22_DST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKMODE:1;
			uint64_t LINK:1;
			uint64_t LINKADDR:30;
		} __attribute__((packed)) B;
	} CH22_LINK;

	uint8_t res25[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t SOURCESEL:6;
		} __attribute__((packed)) B;
	} CH23_REQSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t ARBSLOTS:2;
			uint64_t reservedSpace1:2;
			uint64_t SRCINCSIGN:1;
			uint64_t DSTINCSIGN:1;
		} __attribute__((packed)) B;
	} CH23_CFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOOPCNT:8;
		} __attribute__((packed)) B;
	} CH23_LOOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STRUCTTYPE:2;
			uint64_t reservedSpace0:1;
			uint64_t STRUCTREQ:1;
			uint64_t XFERCNT:11;
			uint64_t BYTESWAP:1;
			uint64_t BLOCKSIZE:4;
			uint64_t DONEIFSEN:1;
			uint64_t REQMODE:1;
			uint64_t DECLOOPCNT:1;
			uint64_t IGNORESREQ:1;
			uint64_t SRCINC:2;
			uint64_t SIZE:2;
			uint64_t DSTINC:2;
			uint64_t SRCMODE:1;
			uint64_t DSTMODE:1;
		} __attribute__((packed)) B;
	} CH23_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRCADDR:32;
		} __attribute__((packed)) B;
	} CH23_SRC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DSTADDR:32;
		} __attribute__((packed)) B;
	} CH23_DST;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LINKMODE:1;
			uint64_t LINK:1;
			uint64_t LINKADDR:30;
		} __attribute__((packed)) B;
	} CH23_LINK;

} __attribute__((packed));

#define LDMA (*(volatile struct LDMA_tag *) 0x40002000)

struct FPUEH_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t FPIOC:1;
			uint64_t FPDZC:1;
			uint64_t FPUFC:1;
			uint64_t FPOFC:1;
			uint64_t FPIDC:1;
			uint64_t FPIXC:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FPIOC:1;
			uint64_t FPDZC:1;
			uint64_t FPUFC:1;
			uint64_t FPOFC:1;
			uint64_t FPIDC:1;
			uint64_t FPIXC:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FPIOC:1;
			uint64_t FPDZC:1;
			uint64_t FPUFC:1;
			uint64_t FPOFC:1;
			uint64_t FPIDC:1;
			uint64_t FPIXC:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FPIOC:1;
			uint64_t FPDZC:1;
			uint64_t FPUFC:1;
			uint64_t FPOFC:1;
			uint64_t FPIDC:1;
			uint64_t FPIXC:1;
		} __attribute__((packed)) B;
	} IEN;

} __attribute__((packed));

#define FPUEH (*(volatile struct FPUEH_tag *) 0x40001000)

struct GPCRC_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t EN:1;
			uint64_t reservedSpace0:3;
			uint64_t POLYSEL:1;
			uint64_t reservedSpace1:3;
			uint64_t BYTEMODE:1;
			uint64_t BITREVERSE:1;
			uint64_t BYTEREVERSE:1;
			uint64_t reservedSpace2:2;
			uint64_t AUTOINIT:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INIT:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INIT:32;
		} __attribute__((packed)) B;
	} INIT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t POLY:16;
		} __attribute__((packed)) B;
	} POLY;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INPUTDATA:32;
		} __attribute__((packed)) B;
	} INPUTDATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INPUTDATAHWORD:16;
		} __attribute__((packed)) B;
	} INPUTDATAHWORD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INPUTDATABYTE:8;
		} __attribute__((packed)) B;
	} INPUTDATABYTE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:32;
		} __attribute__((packed)) B;
	} DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATAREV:32;
		} __attribute__((packed)) B;
	} DATAREV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATABYTEREV:32;
		} __attribute__((packed)) B;
	} DATABYTEREV;

} __attribute__((packed));

