iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VALID:32;
		} __attribute__((packed)) B;
	} MESSAGESTATE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:15;
			uint64_t DBGHALT:1;
		} __attribute__((packed)) B;
	} CONFIG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MESSAGE:32;
		} __attribute__((packed)) B;
	} IF0IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MESSAGE:32;
		} __attribute__((packed)) B;
	} IF0IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MESSAGE:32;
		} __attribute__((packed)) B;
	} IF0IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MESSAGE:32;
		} __attribute__((packed)) B;
	} IF0IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STATUS:1;
		} __attribute__((packed)) B;
	} IF1IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STATUS:1;
		} __attribute__((packed)) B;
	} IF1IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STATUS:1;
		} __attribute__((packed)) B;
	} IF1IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STATUS:1;
		} __attribute__((packed)) B;
	} IF1IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXPEN:1;
			uint64_t reservedSpace0:1;
			uint64_t RXLOC:6;
			uint64_t TXLOC:6;
		} __attribute__((packed)) B;
	} ROUTE;

	uint8_t res1[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATAB:1;
			uint64_t DATAA:1;
			uint64_t TXRQSTNEWDAT:1;
			uint64_t CLRINTPND:1;
			uint64_t CONTROL:1;
			uint64_t ARBACC:1;
			uint64_t MASKACC:1;
			uint64_t WRRD:1;
		} __attribute__((packed)) B;
	} MIR0_CMDMASK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MASK:29;
			uint64_t reservedSpace0:1;
			uint64_t MDIR:1;
			uint64_t MXTD:1;
		} __attribute__((packed)) B;
	} MIR0_MASK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ID:29;
			uint64_t DIR:1;
			uint64_t XTD:1;
			uint64_t MSGVAL:1;
		} __attribute__((packed)) B;
	} MIR0_ARB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DLC:4;
			uint64_t reservedSpace0:3;
			uint64_t EOB:1;
			uint64_t TXRQST:1;
			uint64_t RMTEN:1;
			uint64_t RXIE:1;
			uint64_t TXIE:1;
			uint64_t UMASK:1;
			uint64_t INTPND:1;
			uint64_t MESSAGEOF:1;
			uint64_t DATAVALID:1;
		} __attribute__((packed)) B;
	} MIR0_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA0:8;
			uint64_t DATA1:8;
			uint64_t DATA2:8;
			uint64_t DATA3:8;
		} __attribute__((packed)) B;
	} MIR0_DATAL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA4:8;
			uint64_t DATA5:8;
			uint64_t DATA6:8;
			uint64_t DATA7:8;
		} __attribute__((packed)) B;
	} MIR0_DATAH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MSGNUM:6;
			uint64_t reservedSpace0:9;
			uint64_t BUSY:1;
		} __attribute__((packed)) B;
	} MIR0_CMDREQ;

	uint8_t res2[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATAB:1;
			uint64_t DATAA:1;
			uint64_t TXRQSTNEWDAT:1;
			uint64_t CLRINTPND:1;
			uint64_t CONTROL:1;
			uint64_t ARBACC:1;
			uint64_t MASKACC:1;
			uint64_t WRRD:1;
		} __attribute__((packed)) B;
	} MIR1_CMDMASK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MASK:29;
			uint64_t reservedSpace0:1;
			uint64_t MDIR:1;
			uint64_t MXTD:1;
		} __attribute__((packed)) B;
	} MIR1_MASK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ID:29;
			uint64_t DIR:1;
			uint64_t XTD:1;
			uint64_t MSGVAL:1;
		} __attribute__((packed)) B;
	} MIR1_ARB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DLC:4;
			uint64_t reservedSpace0:3;
			uint64_t EOB:1;
			uint64_t TXRQST:1;
			uint64_t RMTEN:1;
			uint64_t RXIE:1;
			uint64_t TXIE:1;
			uint64_t UMASK:1;
			uint64_t INTPND:1;
			uint64_t MESSAGEOF:1;
			uint64_t DATAVALID:1;
		} __attribute__((packed)) B;
	} MIR1_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA0:8;
			uint64_t DATA1:8;
			uint64_t DATA2:8;
			uint64_t DATA3:8;
		} __attribute__((packed)) B;
	} MIR1_DATAL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA4:8;
			uint64_t DATA5:8;
			uint64_t DATA6:8;
			uint64_t DATA7:8;
		} __attribute__((packed)) B;
	} MIR1_DATAH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MSGNUM:6;
			uint64_t reservedSpace0:9;
			uint64_t BUSY:1;
		} __attribute__((packed)) B;
	} MIR1_CMDREQ;

} __attribute__((packed));

#define CAN1 (*(volatile struct CAN1_tag *) 0x40004400)

struct TIMER0_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t reservedSpace0:1;
			uint64_t SYNC:1;
			uint64_t OSMEN:1;
			uint64_t QDM:1;
			uint64_t DEBUGRUN:1;
			uint64_t DMACLRACT:1;
			uint64_t RISEA:2;
			uint64_t FALLA:2;
			uint64_t reservedSpace1:1;
			uint64_t X2CNT:1;
			uint64_t DISSYNCOUT:1;
			uint64_t reservedSpace2:1;
			uint64_t CLKSEL:2;
			uint64_t reservedSpace3:6;
			uint64_t PRESC:4;
			uint64_t ATI:1;
			uint64_t RSSCOIST:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t START:1;
			uint64_t STOP:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RUNNING:1;
			uint64_t DIR:1;
			uint64_t TOPBV:1;
			uint64_t reservedSpace0:5;
			uint64_t CCVBV0:1;
			uint64_t CCVBV1:1;
			uint64_t CCVBV2:1;
			uint64_t CCVBV3:1;
			uint64_t reservedSpace1:4;
			uint64_t ICV0:1;
			uint64_t ICV1:1;
			uint64_t ICV2:1;
			uint64_t ICV3:1;
			uint64_t reservedSpace2:4;
			uint64_t CCPOL0:1;
			uint64_t CCPOL1:1;
			uint64_t CCPOL2:1;
			uint64_t CCPOL3:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t UF:1;
			uint64_t DIRCHG:1;
			uint64_t reservedSpace0:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t CC3:1;
			uint64_t ICBOF0:1;
			uint64_t ICBOF1:1;
			uint64_t ICBOF2:1;
			uint64_t ICBOF3:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t UF:1;
			uint64_t DIRCHG:1;
			uint64_t reservedSpace0:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t CC3:1;
			uint64_t ICBOF0:1;
			uint64_t ICBOF1:1;
			uint64_t ICBOF2:1;
			uint64_t ICBOF3:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t UF:1;
			uint64_t DIRCHG:1;
			uint64_t reservedSpace0:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t CC3:1;
			uint64_t ICBOF0:1;
			uint64_t ICBOF1:1;
			uint64_t ICBOF2:1;
			uint64_t ICBOF3:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t UF:1;
			uint64_t DIRCHG:1;
			uint64_t reservedSpace0:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t CC3:1;
			uint64_t ICBOF0:1;
			uint64_t ICBOF1:1;
			uint64_t ICBOF2:1;
			uint64_t ICBOF3:1;
		} __attribute__((packed)) B;
	} IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOP:32;
		} __attribute__((packed)) B;
	} TOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOPB:32;
		} __attribute__((packed)) B;
	} TOPB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CNT:32;
		} __attribute__((packed)) B;
	} CNT;

