iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMERLOCKKEY:16;
		} __attribute__((packed)) B;
	} LOCK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC0PEN:1;
			uint64_t CC1PEN:1;
			uint64_t CC2PEN:1;
			uint64_t CC3PEN:1;
			uint64_t reservedSpace0:4;
			uint64_t CDTI0PEN:1;
			uint64_t CDTI1PEN:1;
			uint64_t CDTI2PEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC0LOC:6;
			uint64_t reservedSpace0:2;
			uint64_t CC1LOC:6;
			uint64_t reservedSpace1:2;
			uint64_t CC2LOC:6;
			uint64_t reservedSpace2:2;
			uint64_t CC3LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	uint8_t res1[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CDTI0LOC:6;
			uint64_t reservedSpace0:2;
			uint64_t CDTI1LOC:6;
			uint64_t reservedSpace1:2;
			uint64_t CDTI2LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC2;

	uint8_t res2[32];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t OUTINV:1;
			uint64_t reservedSpace0:1;
			uint64_t COIST:1;
			uint64_t reservedSpace1:3;
			uint64_t CMOA:2;
			uint64_t COFOA:2;
			uint64_t CUFOA:2;
			uint64_t reservedSpace2:2;
			uint64_t PRSSEL:5;
			uint64_t reservedSpace3:3;
			uint64_t ICEDGE:2;
			uint64_t ICEVCTRL:2;
			uint64_t PRSCONF:1;
			uint64_t INSEL:1;
			uint64_t FILT:1;
		} __attribute__((packed)) B;
	} CC0_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCV:32;
		} __attribute__((packed)) B;
	} CC0_CCV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVP:32;
		} __attribute__((packed)) B;
	} CC0_CCVP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVB:32;
		} __attribute__((packed)) B;
	} CC0_CCVB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t OUTINV:1;
			uint64_t reservedSpace0:1;
			uint64_t COIST:1;
			uint64_t reservedSpace1:3;
			uint64_t CMOA:2;
			uint64_t COFOA:2;
			uint64_t CUFOA:2;
			uint64_t reservedSpace2:2;
			uint64_t PRSSEL:5;
			uint64_t reservedSpace3:3;
			uint64_t ICEDGE:2;
			uint64_t ICEVCTRL:2;
			uint64_t PRSCONF:1;
			uint64_t INSEL:1;
			uint64_t FILT:1;
		} __attribute__((packed)) B;
	} CC1_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCV:32;
		} __attribute__((packed)) B;
	} CC1_CCV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVP:32;
		} __attribute__((packed)) B;
	} CC1_CCVP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVB:32;
		} __attribute__((packed)) B;
	} CC1_CCVB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t OUTINV:1;
			uint64_t reservedSpace0:1;
			uint64_t COIST:1;
			uint64_t reservedSpace1:3;
			uint64_t CMOA:2;
			uint64_t COFOA:2;
			uint64_t CUFOA:2;
			uint64_t reservedSpace2:2;
			uint64_t PRSSEL:5;
			uint64_t reservedSpace3:3;
			uint64_t ICEDGE:2;
			uint64_t ICEVCTRL:2;
			uint64_t PRSCONF:1;
			uint64_t INSEL:1;
			uint64_t FILT:1;
		} __attribute__((packed)) B;
	} CC2_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCV:32;
		} __attribute__((packed)) B;
	} CC2_CCV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVP:32;
		} __attribute__((packed)) B;
	} CC2_CCVP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVB:32;
		} __attribute__((packed)) B;
	} CC2_CCVB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t OUTINV:1;
			uint64_t reservedSpace0:1;
			uint64_t COIST:1;
			uint64_t reservedSpace1:3;
			uint64_t CMOA:2;
			uint64_t COFOA:2;
			uint64_t CUFOA:2;
			uint64_t reservedSpace2:2;
			uint64_t PRSSEL:5;
			uint64_t reservedSpace3:3;
			uint64_t ICEDGE:2;
			uint64_t ICEVCTRL:2;
			uint64_t PRSCONF:1;
			uint64_t INSEL:1;
			uint64_t FILT:1;
		} __attribute__((packed)) B;
	} CC3_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCV:32;
		} __attribute__((packed)) B;
	} CC3_CCV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVP:32;
		} __attribute__((packed)) B;
	} CC3_CCVP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVB:32;
		} __attribute__((packed)) B;
	} CC3_CCVB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DTEN:1;
			uint64_t DTDAS:1;
			uint64_t DTIPOL:1;
			uint64_t DTCINV:1;
			uint64_t DTPRSSEL:5;
			uint64_t DTAR:1;
			uint64_t DTFATS:1;
			uint64_t reservedSpace0:13;
			uint64_t DTPRSEN:1;
		} __attribute__((packed)) B;
	} DTCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DTPRESC:4;
			uint64_t reservedSpace0:4;
			uint64_t DTRISET:6;
			uint64_t reservedSpace1:2;
			uint64_t DTFALLT:6;
		} __attribute__((packed)) B;
	} DTTIME;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DTPRS0FSEL:5;
			uint64_t reservedSpace0:3;
			uint64_t DTPRS1FSEL:5;
			uint64_t reservedSpace1:3;
			uint64_t DTFA:2;
			uint64_t reservedSpace2:6;
			uint64_t DTPRS0FEN:1;
			uint64_t DTPRS1FEN:1;
			uint64_t DTDBGFEN:1;
			uint64_t DTLOCKUPFEN:1;
		} __attribute__((packed)) B;
	} DTFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DTOGCC0EN:1;
			uint64_t DTOGCC1EN:1;
			uint64_t DTOGCC2EN:1;
			uint64_t DTOGCDTI0EN:1;
			uint64_t DTOGCDTI1EN:1;
			uint64_t DTOGCDTI2EN:1;
		} __attribute__((packed)) B;
	} DTOGEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DTPRS0F:1;
			uint64_t DTPRS1F:1;
			uint64_t DTDBGF:1;
			uint64_t DTLOCKUPF:1;
		} __attribute__((packed)) B;
	} DTFAULT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DTPRS0FC:1;
			uint64_t DTPRS1FC:1;
			uint64_t DTDBGFC:1;
			uint64_t TLOCKUPFC:1;
		} __attribute__((packed)) B;
	} DTFAULTC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOCKKEY:16;
		} __attribute__((packed)) B;
	} DTLOCK;

} __attribute__((packed));

#define WTIMER2 (*(volatile struct WTIMER2_tag *) 0x4001a800)

struct WTIMER3_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t reservedSpace0:1;
			uint64_t SYNC:1;
			uint64_t OSMEN:1;
			uint64_t QDM:1;
			uint64_t DEBUGRUN:1;
			uint64_t DMACLRACT:1;
			uint64_t RISEA:2;
			uint64_t FALLA:2;
			uint64_t reservedSpace1:1;
			uint64_t X2CNT:1;
			uint64_t DISSYNCOUT:1;
			uint64_t reservedSpace2:1;
			uint64_t CLKSEL:2;
			uint64_t reservedSpace3:6;
			uint64_t PRESC:4;
			uint64_t ATI:1;
			uint64_t RSSCOIST:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t START:1;
			uint64_t STOP:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RUNNING:1;
			uint64_t DIR:1;
			uint64_t TOPBV:1;
			uint64_t reservedSpace0:5;
			uint64_t CCVBV0:1;
			uint64_t CCVBV1:1;
			uint64_t CCVBV2:1;
			uint64_t CCVBV3:1;
			uint64_t reservedSpace1:4;
			uint64_t ICV0:1;
			uint64_t ICV1:1;
			uint64_t ICV2:1;
			uint64_t ICV3:1;
			uint64_t reservedSpace2:4;
			uint64_t CCPOL0:1;
			uint64_t CCPOL1:1;
			uint64_t CCPOL2:1;
			uint64_t CCPOL3:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t UF:1;
			uint64_t DIRCHG:1;
			uint64_t reservedSpace0:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t CC3:1;
			uint64_t ICBOF0:1;
			uint64_t ICBOF1:1;
			uint64_t ICBOF2:1;
			uint64_t ICBOF3:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t UF:1;
			uint64_t DIRCHG:1;
			uint64_t reservedSpace0:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t CC3:1;
			uint64_t ICBOF0:1;
			uint64_t ICBOF1:1;
			uint64_t ICBOF2:1;
			uint64_t ICBOF3:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t UF:1;
			uint64_t DIRCHG:1;
			uint64_t reservedSpace0:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t CC3:1;
			uint64_t ICBOF0:1;
			uint64_t ICBOF1:1;
			uint64_t ICBOF2:1;
			uint64_t ICBOF3:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t UF:1;
			uint64_t DIRCHG:1;
			uint64_t reservedSpace0:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t CC3:1;
			uint64_t ICBOF0:1;
			uint64_t ICBOF1:1;
			uint64_t ICBOF2:1;
			uint64_t ICBOF3:1;
		} __attribute__((packed)) B;
	} IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOP:32;
		} __attribute__((packed)) B;
	} TOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOPB:32;
		} __attribute__((packed)) B;
	} TOPB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CNT:32;
		} __attribute__((packed)) B;
	} CNT;

