iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TIMERLOCKKEY:16;
		} __attribute__((packed)) B;
	} LOCK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC0PEN:1;
			uint64_t CC1PEN:1;
			uint64_t CC2PEN:1;
			uint64_t CC3PEN:1;
			uint64_t reservedSpace0:4;
			uint64_t CDTI0PEN:1;
			uint64_t CDTI1PEN:1;
			uint64_t CDTI2PEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC0LOC:6;
			uint64_t reservedSpace0:2;
			uint64_t CC1LOC:6;
			uint64_t reservedSpace1:2;
			uint64_t CC2LOC:6;
			uint64_t reservedSpace2:2;
			uint64_t CC3LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	uint8_t res1[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CDTI0LOC:6;
			uint64_t reservedSpace0:2;
			uint64_t CDTI1LOC:6;
			uint64_t reservedSpace1:2;
			uint64_t CDTI2LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC2;

	uint8_t res2[32];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t OUTINV:1;
			uint64_t reservedSpace0:1;
			uint64_t COIST:1;
			uint64_t reservedSpace1:3;
			uint64_t CMOA:2;
			uint64_t COFOA:2;
			uint64_t CUFOA:2;
			uint64_t reservedSpace2:2;
			uint64_t PRSSEL:5;
			uint64_t reservedSpace3:3;
			uint64_t ICEDGE:2;
			uint64_t ICEVCTRL:2;
			uint64_t PRSCONF:1;
			uint64_t INSEL:1;
			uint64_t FILT:1;
		} __attribute__((packed)) B;
	} CC0_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCV:32;
		} __attribute__((packed)) B;
	} CC0_CCV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVP:32;
		} __attribute__((packed)) B;
	} CC0_CCVP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVB:32;
		} __attribute__((packed)) B;
	} CC0_CCVB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t OUTINV:1;
			uint64_t reservedSpace0:1;
			uint64_t COIST:1;
			uint64_t reservedSpace1:3;
			uint64_t CMOA:2;
			uint64_t COFOA:2;
			uint64_t CUFOA:2;
			uint64_t reservedSpace2:2;
			uint64_t PRSSEL:5;
			uint64_t reservedSpace3:3;
			uint64_t ICEDGE:2;
			uint64_t ICEVCTRL:2;
			uint64_t PRSCONF:1;
			uint64_t INSEL:1;
			uint64_t FILT:1;
		} __attribute__((packed)) B;
	} CC1_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCV:32;
		} __attribute__((packed)) B;
	} CC1_CCV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVP:32;
		} __attribute__((packed)) B;
	} CC1_CCVP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVB:32;
		} __attribute__((packed)) B;
	} CC1_CCVB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t OUTINV:1;
			uint64_t reservedSpace0:1;
			uint64_t COIST:1;
			uint64_t reservedSpace1:3;
			uint64_t CMOA:2;
			uint64_t COFOA:2;
			uint64_t CUFOA:2;
			uint64_t reservedSpace2:2;
			uint64_t PRSSEL:5;
			uint64_t reservedSpace3:3;
			uint64_t ICEDGE:2;
			uint64_t ICEVCTRL:2;
			uint64_t PRSCONF:1;
			uint64_t INSEL:1;
			uint64_t FILT:1;
		} __attribute__((packed)) B;
	} CC2_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCV:32;
		} __attribute__((packed)) B;
	} CC2_CCV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVP:32;
		} __attribute__((packed)) B;
	} CC2_CCVP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVB:32;
		} __attribute__((packed)) B;
	} CC2_CCVB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t OUTINV:1;
			uint64_t reservedSpace0:1;
			uint64_t COIST:1;
			uint64_t reservedSpace1:3;
			uint64_t CMOA:2;
			uint64_t COFOA:2;
			uint64_t CUFOA:2;
			uint64_t reservedSpace2:2;
			uint64_t PRSSEL:5;
			uint64_t reservedSpace3:3;
			uint64_t ICEDGE:2;
			uint64_t ICEVCTRL:2;
			uint64_t PRSCONF:1;
			uint64_t INSEL:1;
			uint64_t FILT:1;
		} __attribute__((packed)) B;
	} CC3_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCV:32;
		} __attribute__((packed)) B;
	} CC3_CCV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVP:32;
		} __attribute__((packed)) B;
	} CC3_CCVP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCVB:32;
		} __attribute__((packed)) B;
	} CC3_CCVB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DTEN:1;
			uint64_t DTDAS:1;
			uint64_t DTIPOL:1;
			uint64_t DTCINV:1;
			uint64_t DTPRSSEL:5;
			uint64_t DTAR:1;
			uint64_t DTFATS:1;
			uint64_t reservedSpace0:13;
			uint64_t DTPRSEN:1;
		} __attribute__((packed)) B;
	} DTCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DTPRESC:4;
			uint64_t reservedSpace0:4;
			uint64_t DTRISET:6;
			uint64_t reservedSpace1:2;
			uint64_t DTFALLT:6;
		} __attribute__((packed)) B;
	} DTTIME;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DTPRS0FSEL:5;
			uint64_t reservedSpace0:3;
			uint64_t DTPRS1FSEL:5;
			uint64_t reservedSpace1:3;
			uint64_t DTFA:2;
			uint64_t reservedSpace2:6;
			uint64_t DTPRS0FEN:1;
			uint64_t DTPRS1FEN:1;
			uint64_t DTDBGFEN:1;
			uint64_t DTLOCKUPFEN:1;
		} __attribute__((packed)) B;
	} DTFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DTOGCC0EN:1;
			uint64_t DTOGCC1EN:1;
			uint64_t DTOGCC2EN:1;
			uint64_t DTOGCDTI0EN:1;
			uint64_t DTOGCDTI1EN:1;
			uint64_t DTOGCDTI2EN:1;
		} __attribute__((packed)) B;
	} DTOGEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DTPRS0F:1;
			uint64_t DTPRS1F:1;
			uint64_t DTDBGF:1;
			uint64_t DTLOCKUPF:1;
		} __attribute__((packed)) B;
	} DTFAULT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DTPRS0FC:1;
			uint64_t DTPRS1FC:1;
			uint64_t DTDBGFC:1;
			uint64_t TLOCKUPFC:1;
		} __attribute__((packed)) B;
	} DTFAULTC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOCKKEY:16;
		} __attribute__((packed)) B;
	} DTLOCK;

} __attribute__((packed));

#define WTIMER3 (*(volatile struct WTIMER3_tag *) 0x4001ac00)

struct USART0_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t SYNC:1;
			uint64_t LOOPBK:1;
			uint64_t CCEN:1;
			uint64_t MPM:1;
			uint64_t MPAB:1;
			uint64_t OVS:2;
			uint64_t reservedSpace0:1;
			uint64_t CLKPOL:1;
			uint64_t CLKPHA:1;
			uint64_t MSBF:1;
			uint64_t CSMA:1;
			uint64_t TXBIL:1;
			uint64_t RXINV:1;
			uint64_t TXINV:1;
			uint64_t CSINV:1;
			uint64_t AUTOCS:1;
			uint64_t AUTOTRI:1;
			uint64_t SCMODE:1;
			uint64_t SCRETRANS:1;
			uint64_t SKIPPERRF:1;
			uint64_t BIT8DV:1;
			uint64_t ERRSDMA:1;
			uint64_t ERRSRX:1;
			uint64_t ERRSTX:1;
			uint64_t SSSEARLY:1;
			uint64_t reservedSpace1:2;
			uint64_t BYTESWAP:1;
			uint64_t AUTOTX:1;
			uint64_t MVDIS:1;
			uint64_t SMSDELAY:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATABITS:4;
			uint64_t reservedSpace0:4;
			uint64_t PARITY:2;
			uint64_t reservedSpace1:2;
			uint64_t STOPBITS:2;
		} __attribute__((packed)) B;
	} FRAME;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:4;
			uint64_t RXTEN:1;
			uint64_t TXTEN:1;
			uint64_t AUTOTXTEN:1;
			uint64_t TXARX0EN:1;
			uint64_t TXARX1EN:1;
			uint64_t TXARX2EN:1;
			uint64_t RXATX0EN:1;
			uint64_t RXATX1EN:1;
			uint64_t RXATX2EN:1;
			uint64_t reservedSpace1:3;
			uint64_t TSEL:5;
		} __attribute__((packed)) B;
	} TRIGCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXEN:1;
			uint64_t RXDIS:1;
			uint64_t TXEN:1;
			uint64_t TXDIS:1;
			uint64_t MASTEREN:1;
			uint64_t MASTERDIS:1;
			uint64_t RXBLOCKEN:1;
			uint64_t RXBLOCKDIS:1;
			uint64_t TXTRIEN:1;
			uint64_t TXTRIDIS:1;
			uint64_t CLEARTX:1;
			uint64_t CLEARRX:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXENS:1;
			uint64_t TXENS:1;
			uint64_t MASTER:1;
			uint64_t RXBLOCK:1;
			uint64_t TXTRI:1;
			uint64_t TXC:1;
			uint64_t TXBL:1;
			uint64_t RXDATAV:1;
			uint64_t RXFULL:1;
			uint64_t TXBDRIGHT:1;
			uint64_t TXBSRIGHT:1;
			uint64_t RXDATAVRIGHT:1;
			uint64_t RXFULLRIGHT:1;
			uint64_t TXIDLE:1;
			uint64_t TIMERRESTARTED:1;
			uint64_t reservedSpace0:1;
			uint64_t TXBUFCNT:2;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:3;
			uint64_t DIV:20;
			uint64_t reservedSpace1:8;
			uint64_t AUTOBAUDEN:1;
		} __attribute__((packed)) B;
	} CLKDIV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXDATA:9;
			uint64_t reservedSpace0:5;
			uint64_t PERR:1;
			uint64_t FERR:1;
		} __attribute__((packed)) B;
	} RXDATAX;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXDATA:8;
		} __attribute__((packed)) B;
	} RXDATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXDATA0:9;
			uint64_t reservedSpace0:5;
			uint64_t PERR0:1;
			uint64_t FERR0:1;
			uint64_t RXDATA1:9;
			uint64_t reservedSpace1:5;
			uint64_t PERR1:1;
			uint64_t FERR1:1;
		} __attribute__((packed)) B;
	} RXDOUBLEX;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXDATA0:8;
			uint64_t RXDATA1:8;
		} __attribute__((packed)) B;
	} RXDOUBLE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXDATAP:9;
			uint64_t reservedSpace0:5;
			uint64_t PERRP:1;
			uint64_t FERRP:1;
		} __attribute__((packed)) B;
	} RXDATAXP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXDATAP0:9;
			uint64_t reservedSpace0:5;
			uint64_t PERRP0:1;
			uint64_t FERRP0:1;
			uint64_t RXDATAP1:9;
			uint64_t reservedSpace1:5;
			uint64_t PERRP1:1;
			uint64_t FERRP1:1;
		} __attribute__((packed)) B;
	} RXDOUBLEXP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXDATAX:9;
			uint64_t reservedSpace0:2;
			uint64_t UBRXAT:1;
			uint64_t TXTRIAT:1;
			uint64_t TXBREAK:1;
			uint64_t TXDISAT:1;
			uint64_t RXENAT:1;
		} __attribute__((packed)) B;
	} TXDATAX;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXDATA:8;
		} __attribute__((packed)) B;
	} TXDATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXDATA0:9;
			uint64_t reservedSpace0:2;
			uint64_t UBRXAT0:1;
			uint64_t TXTRIAT0:1;
			uint64_t TXBREAK0:1;
			uint64_t TXDISAT0:1;
			uint64_t RXENAT0:1;
			uint64_t TXDATA1:9;
			uint64_t reservedSpace1:2;
			uint64_t UBRXAT1:1;
			uint64_t TXTRIAT1:1;
			uint64_t TXBREAK1:1;
			uint64_t TXDISAT1:1;
			uint64_t RXENAT1:1;
		} __attribute__((packed)) B;
	} TXDOUBLEX;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXDATA0:8;
			uint64_t TXDATA1:8;
		} __attribute__((packed)) B;
	} TXDOUBLE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXC:1;
			uint64_t TXBL:1;
			uint64_t RXDATAV:1;
			uint64_t RXFULL:1;
			uint64_t RXOF:1;
			uint64_t RXUF:1;
			uint64_t TXOF:1;
			uint64_t TXUF:1;
			uint64_t PERR:1;
			uint64_t FERR:1;
			uint64_t MPAF:1;
			uint64_t SSM:1;
			uint64_t CCF:1;
			uint64_t TXIDLE:1;
			uint64_t TCMP0:1;
			uint64_t TCMP1:1;
			uint64_t TCMP2:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXC:1;
			uint64_t reservedSpace0:2;
			uint64_t RXFULL:1;
			uint64_t RXOF:1;
			uint64_t RXUF:1;
			uint64_t TXOF:1;
			uint64_t TXUF:1;
			uint64_t PERR:1;
			uint64_t FERR:1;
			uint64_t MPAF:1;
			uint64_t SSM:1;
			uint64_t CCF:1;
			uint64_t TXIDLE:1;
			uint64_t TCMP0:1;
			uint64_t TCMP1:1;
			uint64_t TCMP2:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXC:1;
			uint64_t reservedSpace0:2;
			uint64_t RXFULL:1;
			uint64_t RXOF:1;
			uint64_t RXUF:1;
			uint64_t TXOF:1;
			uint64_t TXUF:1;
			uint64_t PERR:1;
			uint64_t FERR:1;
			uint64_t MPAF:1;
			uint64_t SSM:1;
			uint64_t CCF:1;
			uint64_t TXIDLE:1;
			uint64_t TCMP0:1;
			uint64_t TCMP1:1;
			uint64_t TCMP2:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXC:1;
			uint64_t TXBL:1;
			uint64_t RXDATAV:1;
			uint64_t RXFULL:1;
			uint64_t RXOF:1;
			uint64_t RXUF:1;
			uint64_t TXOF:1;
			uint64_t TXUF:1;
			uint64_t PERR:1;
			uint64_t FERR:1;
			uint64_t MPAF:1;
			uint64_t SSM:1;
			uint64_t CCF:1;
			uint64_t TXIDLE:1;
			uint64_t TCMP0:1;
			uint64_t TCMP1:1;
			uint64_t TCMP2:1;
		} __attribute__((packed)) B;
	} IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t IREN:1;
			uint64_t IRPW:2;
			uint64_t IRFILT:1;
			uint64_t reservedSpace0:3;
			uint64_t IRPRSEN:1;
			uint64_t IRPRSSEL:5;
		} __attribute__((packed)) B;
	} IRCTRL;

