iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res1[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SUBSECTOR:32;
		} __attribute__((packed)) B;
	} LOWERWRPROT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SUBSECTOR:32;
		} __attribute__((packed)) B;
	} UPPERWRPROT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INV:1;
			uint64_t ENB:1;
		} __attribute__((packed)) B;
	} WRPROTCTRL;

	uint8_t res2[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t START:1;
			uint64_t CANCEL:1;
			uint64_t RDSTATUS:1;
			uint64_t SRAMFULL:1;
			uint64_t RDQUEUED:1;
			uint64_t INDOPSDONESTATUS:1;
			uint64_t NUMINDOPSDONE:2;
		} __attribute__((packed)) B;
	} INDIRECTREADXFERCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LEVEL:32;
		} __attribute__((packed)) B;
	} INDIRECTREADXFERWATERMARK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:32;
		} __attribute__((packed)) B;
	} INDIRECTREADXFERSTART;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VALUE:32;
		} __attribute__((packed)) B;
	} INDIRECTREADXFERNUMBYTES;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t START:1;
			uint64_t CANCEL:1;
			uint64_t WRSTATUS:1;
			uint64_t reservedSpace0:1;
			uint64_t WRQUEUED:1;
			uint64_t INDOPSDONESTATUS:1;
			uint64_t NUMINDOPSDONE:2;
		} __attribute__((packed)) B;
	} INDIRECTWRITEXFERCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LEVEL:32;
		} __attribute__((packed)) B;
	} INDIRECTWRITEXFERWATERMARK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:32;
		} __attribute__((packed)) B;
	} INDIRECTWRITEXFERSTART;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VALUE:32;
		} __attribute__((packed)) B;
	} INDIRECTWRITEXFERNUMBYTES;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INDRANGEWIDTH:4;
		} __attribute__((packed)) B;
	} INDIRECTTRIGGERADDRRANGE;

	uint8_t res3[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TRIGGERMEMBANKREQ:1;
			uint64_t MEMBANKREQINPROGRESS:1;
			uint64_t reservedSpace0:6;
			uint64_t MEMBANKREADDATA:8;
			uint64_t NBOFSTIGREADBYTES:3;
			uint64_t reservedSpace1:1;
			uint64_t MEMBANKADDR:9;
		} __attribute__((packed)) B;
	} FLASHCOMMANDCTRLMEM;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMDEXEC:1;
			uint64_t CMDEXECSTATUS:1;
			uint64_t STIGMEMBANKEN:1;
			uint64_t reservedSpace0:4;
			uint64_t NUMDUMMYCYCLES:5;
			uint64_t NUMWRDATABYTES:3;
			uint64_t ENBWRITEDATA:1;
			uint64_t NUMADDRBYTES:2;
			uint64_t ENBMODEBIT:1;
			uint64_t ENBCOMDADDR:1;
			uint64_t NUMRDDATABYTES:3;
			uint64_t ENBREADDATA:1;
			uint64_t CMDOPCODE:8;
		} __attribute__((packed)) B;
	} FLASHCMDCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:32;
		} __attribute__((packed)) B;
	} FLASHCMDADDR;

	uint8_t res4[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:32;
		} __attribute__((packed)) B;
	} FLASHRDDATALOWER;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:32;
		} __attribute__((packed)) B;
	} FLASHRDDATAUPPER;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:32;
		} __attribute__((packed)) B;
	} FLASHWRDATALOWER;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:32;
		} __attribute__((packed)) B;
	} FLASHWRDATAUPPER;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DEVICESTATUS:8;
			uint64_t DEVICESTATUSVALID:1;
			uint64_t reservedSpace0:7;
			uint64_t DEVICESTATUSNBDUMMY:4;
		} __attribute__((packed)) B;
	} POLLINGFLASHSTATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PHYCONFIGRXDLLDELAY:7;
			uint64_t reservedSpace0:9;
			uint64_t PHYCONFIGTXDLLDELAY:7;
			uint64_t reservedSpace1:6;
			uint64_t PHYCONFIGRXDLLBYPASS:1;
			uint64_t PHYCONFIGRESET:1;
			uint64_t PHYCONFIGRESYNC:1;
		} __attribute__((packed)) B;
	} PHYCONFIGURATION;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PHYMASTERINITIALDELAY:7;
			uint64_t reservedSpace0:9;
			uint64_t PHYMASTERNBINDICATIONS:3;
			uint64_t reservedSpace1:1;
			uint64_t PHYMASTERPHASEDETECTSELECTOR:3;
			uint64_t PHYMASTERBYPASSMODE:1;
			uint64_t PHYMASTERLOCKMODE:1;
		} __attribute__((packed)) B;
	} PHYMASTERCONTROL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DLLOBSERVABLELOWERDLLLOCK:1;
			uint64_t DLLOBSERVABLELOWERLOCKMODE:2;
			uint64_t DLLOBSERVABLELOWERUNLOCKCOUNTER:5;
			uint64_t DLLOBSERVABLELOWERLOCKVALUE:7;
			uint64_t DLLOBSERVABLELOWERLOOPBACKLOCK:1;
			uint64_t DLLOBSERVABLELOWERDLLLOCKDEC:8;
			uint64_t DLLOBSERVABLELOWERDLLLOCKINC:8;
		} __attribute__((packed)) B;
	} DLLOBSERVABLELOWER;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DLLOBSERVABLEUPPERRXDECODEROUTPUT:7;
			uint64_t reservedSpace0:9;
			uint64_t DLLOBSERVABLEUPPERTXDECODEROUTPUT:7;
		} __attribute__((packed)) B;
	} DLLOBSERVABLEUPPER;

	uint8_t res5[28];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTSTIGOPCODE:8;
			uint64_t EXTPOLLOPCODE:8;
			uint64_t EXTWRITEOPCODE:8;
			uint64_t EXTREADOPCODE:8;
		} __attribute__((packed)) B;
	} OPCODEEXTLOWER;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:16;
			uint64_t EXTWELOPCODE:8;
			uint64_t WELOPCODE:8;
		} __attribute__((packed)) B;
	} OPCODEEXTUPPER;

	uint8_t res6[20];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CONF:2;
			uint64_t reservedSpace0:6;
			uint64_t MODULEID:16;
			uint64_t FIXPATCH:8;
		} __attribute__((packed)) B;
	} MODULEID;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXDLYMUXSEL:2;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SCLKPEN:1;
			uint64_t CS0PEN:1;
			uint64_t CS1PEN:1;
			uint64_t reservedSpace0:2;
			uint64_t DQ0PEN:1;
			uint64_t DQ1PEN:1;
			uint64_t DQ2PEN:1;
			uint64_t DQ3PEN:1;
			uint64_t DQ4PEN:1;
			uint64_t DQ5PEN:1;
			uint64_t DQ6PEN:1;
			uint64_t DQ7PEN:1;
			uint64_t DQSPEN:1;
			uint64_t SCLKINPEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t QSPILOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

} __attribute__((packed));

#define QSPI0 (*(volatile struct QSPI0_tag *) 0x4001c400)

struct LEUART0_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t AUTOTRI:1;
			uint64_t DATABITS:1;
			uint64_t PARITY:2;
			uint64_t STOPBITS:1;
			uint64_t INV:1;
			uint64_t ERRSDMA:1;
			uint64_t LOOPBK:1;
			uint64_t SFUBRX:1;
			uint64_t MPM:1;
			uint64_t MPAB:1;
			uint64_t BIT8DV:1;
			uint64_t RXDMAWU:1;
			uint64_t TXDMAWU:1;
			uint64_t TXDELAY:2;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXEN:1;
			uint64_t RXDIS:1;
			uint64_t TXEN:1;
			uint64_t TXDIS:1;
			uint64_t RXBLOCKEN:1;
			uint64_t RXBLOCKDIS:1;
			uint64_t CLEARTX:1;
			uint64_t CLEARRX:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXENS:1;
			uint64_t TXENS:1;
			uint64_t RXBLOCK:1;
			uint64_t TXC:1;
			uint64_t TXBL:1;
			uint64_t RXDATAV:1;
			uint64_t TXIDLE:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:3;
			uint64_t DIV:14;
		} __attribute__((packed)) B;
	} CLKDIV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STARTFRAME:9;
		} __attribute__((packed)) B;
	} STARTFRAME;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGFRAME:9;
		} __attribute__((packed)) B;
	} SIGFRAME;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXDATA:9;
			uint64_t reservedSpace0:5;
			uint64_t PERR:1;
			uint64_t FERR:1;
		} __attribute__((packed)) B;
	} RXDATAX;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXDATA:8;
		} __attribute__((packed)) B;
	} RXDATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXDATAP:9;
			uint64_t reservedSpace0:5;
			uint64_t PERRP:1;
			uint64_t FERRP:1;
		} __attribute__((packed)) B;
	} RXDATAXP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXDATA:9;
			uint64_t reservedSpace0:4;
			uint64_t TXBREAK:1;
			uint64_t TXDISAT:1;
			uint64_t RXENAT:1;
		} __attribute__((packed)) B;
	} TXDATAX;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXDATA:8;
		} __attribute__((packed)) B;
	} TXDATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXC:1;
			uint64_t TXBL:1;
			uint64_t RXDATAV:1;
			uint64_t RXOF:1;
			uint64_t RXUF:1;
			uint64_t TXOF:1;
			uint64_t PERR:1;
			uint64_t FERR:1;
			uint64_t MPAF:1;
			uint64_t STARTF:1;
			uint64_t SIGF:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXC:1;
			uint64_t reservedSpace0:2;
			uint64_t RXOF:1;
			uint64_t RXUF:1;
			uint64_t TXOF:1;
			uint64_t PERR:1;
			uint64_t FERR:1;
			uint64_t MPAF:1;
			uint64_t STARTF:1;
			uint64_t SIGF:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXC:1;
			uint64_t reservedSpace0:2;
			uint64_t RXOF:1;
			uint64_t RXUF:1;
			uint64_t TXOF:1;
			uint64_t PERR:1;
			uint64_t FERR:1;
			uint64_t MPAF:1;
			uint64_t STARTF:1;
			uint64_t SIGF:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXC:1;
			uint64_t TXBL:1;
			uint64_t RXDATAV:1;
			uint64_t RXOF:1;
			uint64_t RXUF:1;
			uint64_t TXOF:1;
			uint64_t PERR:1;
			uint64_t FERR:1;
			uint64_t MPAF:1;
			uint64_t STARTF:1;
			uint64_t SIGF:1;
		} __attribute__((packed)) B;
	} IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PULSEW:4;
			uint64_t PULSEEN:1;
			uint64_t PULSEFILT:1;
		} __attribute__((packed)) B;
	} PULSECTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REGFREEZE:1;
		} __attribute__((packed)) B;
	} FREEZE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CTRL:1;
			uint64_t CMD:1;
			uint64_t CLKDIV:1;
			uint64_t STARTFRAME:1;
			uint64_t SIGFRAME:1;
			uint64_t TXDATAX:1;
			uint64_t TXDATA:1;
			uint64_t PULSECTRL:1;
		} __attribute__((packed)) B;
	} SYNCBUSY;

	uint8_t res0[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXPEN:1;
			uint64_t TXPEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXLOC:6;
			uint64_t reservedSpace0:2;
			uint64_t TXLOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

