iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res1[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXPRSSEL:5;
			uint64_t RXPRS:1;
		} __attribute__((packed)) B;
	} INPUT;

} __attribute__((packed));

#define LEUART0 (*(volatile struct LEUART0_tag *) 0x4006a000)

struct LEUART1_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t AUTOTRI:1;
			uint64_t DATABITS:1;
			uint64_t PARITY:2;
			uint64_t STOPBITS:1;
			uint64_t INV:1;
			uint64_t ERRSDMA:1;
			uint64_t LOOPBK:1;
			uint64_t SFUBRX:1;
			uint64_t MPM:1;
			uint64_t MPAB:1;
			uint64_t BIT8DV:1;
			uint64_t RXDMAWU:1;
			uint64_t TXDMAWU:1;
			uint64_t TXDELAY:2;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXEN:1;
			uint64_t RXDIS:1;
			uint64_t TXEN:1;
			uint64_t TXDIS:1;
			uint64_t RXBLOCKEN:1;
			uint64_t RXBLOCKDIS:1;
			uint64_t CLEARTX:1;
			uint64_t CLEARRX:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXENS:1;
			uint64_t TXENS:1;
			uint64_t RXBLOCK:1;
			uint64_t TXC:1;
			uint64_t TXBL:1;
			uint64_t RXDATAV:1;
			uint64_t TXIDLE:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:3;
			uint64_t DIV:14;
		} __attribute__((packed)) B;
	} CLKDIV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STARTFRAME:9;
		} __attribute__((packed)) B;
	} STARTFRAME;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SIGFRAME:9;
		} __attribute__((packed)) B;
	} SIGFRAME;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXDATA:9;
			uint64_t reservedSpace0:5;
			uint64_t PERR:1;
			uint64_t FERR:1;
		} __attribute__((packed)) B;
	} RXDATAX;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXDATA:8;
		} __attribute__((packed)) B;
	} RXDATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXDATAP:9;
			uint64_t reservedSpace0:5;
			uint64_t PERRP:1;
			uint64_t FERRP:1;
		} __attribute__((packed)) B;
	} RXDATAXP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXDATA:9;
			uint64_t reservedSpace0:4;
			uint64_t TXBREAK:1;
			uint64_t TXDISAT:1;
			uint64_t RXENAT:1;
		} __attribute__((packed)) B;
	} TXDATAX;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXDATA:8;
		} __attribute__((packed)) B;
	} TXDATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXC:1;
			uint64_t TXBL:1;
			uint64_t RXDATAV:1;
			uint64_t RXOF:1;
			uint64_t RXUF:1;
			uint64_t TXOF:1;
			uint64_t PERR:1;
			uint64_t FERR:1;
			uint64_t MPAF:1;
			uint64_t STARTF:1;
			uint64_t SIGF:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXC:1;
			uint64_t reservedSpace0:2;
			uint64_t RXOF:1;
			uint64_t RXUF:1;
			uint64_t TXOF:1;
			uint64_t PERR:1;
			uint64_t FERR:1;
			uint64_t MPAF:1;
			uint64_t STARTF:1;
			uint64_t SIGF:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXC:1;
			uint64_t reservedSpace0:2;
			uint64_t RXOF:1;
			uint64_t RXUF:1;
			uint64_t TXOF:1;
			uint64_t PERR:1;
			uint64_t FERR:1;
			uint64_t MPAF:1;
			uint64_t STARTF:1;
			uint64_t SIGF:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TXC:1;
			uint64_t TXBL:1;
			uint64_t RXDATAV:1;
			uint64_t RXOF:1;
			uint64_t RXUF:1;
			uint64_t TXOF:1;
			uint64_t PERR:1;
			uint64_t FERR:1;
			uint64_t MPAF:1;
			uint64_t STARTF:1;
			uint64_t SIGF:1;
		} __attribute__((packed)) B;
	} IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PULSEW:4;
			uint64_t PULSEEN:1;
			uint64_t PULSEFILT:1;
		} __attribute__((packed)) B;
	} PULSECTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REGFREEZE:1;
		} __attribute__((packed)) B;
	} FREEZE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CTRL:1;
			uint64_t CMD:1;
			uint64_t CLKDIV:1;
			uint64_t STARTFRAME:1;
			uint64_t SIGFRAME:1;
			uint64_t TXDATAX:1;
			uint64_t TXDATA:1;
			uint64_t PULSECTRL:1;
		} __attribute__((packed)) B;
	} SYNCBUSY;

	uint8_t res0[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXPEN:1;
			uint64_t TXPEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXLOC:6;
			uint64_t reservedSpace0:2;
			uint64_t TXLOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	uint8_t res1[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RXPRSSEL:5;
			uint64_t RXPRS:1;
		} __attribute__((packed)) B;
	} INPUT;

} __attribute__((packed));

#define LEUART1 (*(volatile struct LEUART1_tag *) 0x4006a400)

struct LETIMER0_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t REPMODE:2;
			uint64_t UFOA0:2;
			uint64_t UFOA1:2;
			uint64_t OPOL0:1;
			uint64_t OPOL1:1;
			uint64_t BUFTOP:1;
			uint64_t COMP0TOP:1;
			uint64_t reservedSpace0:2;
			uint64_t DEBUGRUN:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t START:1;
			uint64_t STOP:1;
			uint64_t CLEAR:1;
			uint64_t CTO0:1;
			uint64_t CTO1:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RUNNING:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CNT:16;
		} __attribute__((packed)) B;
	} CNT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP0:16;
		} __attribute__((packed)) B;
	} COMP0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP1:16;
		} __attribute__((packed)) B;
	} COMP1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REP0:8;
		} __attribute__((packed)) B;
	} REP0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REP1:8;
		} __attribute__((packed)) B;
	} REP1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP0:1;
			uint64_t COMP1:1;
			uint64_t UF:1;
			uint64_t REP0:1;
			uint64_t REP1:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP0:1;
			uint64_t COMP1:1;
			uint64_t UF:1;
			uint64_t REP0:1;
			uint64_t REP1:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP0:1;
			uint64_t COMP1:1;
			uint64_t UF:1;
			uint64_t REP0:1;
			uint64_t REP1:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP0:1;
			uint64_t COMP1:1;
			uint64_t UF:1;
			uint64_t REP0:1;
			uint64_t REP1:1;
		} __attribute__((packed)) B;
	} IEN;

