iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t CMD:1;
		} __attribute__((packed)) B;
	} SYNCBUSY;

	uint8_t res1[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OUT0PEN:1;
			uint64_t OUT1PEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OUT0LOC:6;
			uint64_t reservedSpace0:2;
			uint64_t OUT1LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	uint8_t res2[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRSSTARTSEL:5;
			uint64_t reservedSpace0:1;
			uint64_t PRSSTOPSEL:5;
			uint64_t reservedSpace1:1;
			uint64_t PRSCLEARSEL:5;
			uint64_t reservedSpace2:1;
			uint64_t PRSSTARTMODE:2;
			uint64_t reservedSpace3:2;
			uint64_t PRSSTOPMODE:2;
			uint64_t reservedSpace4:2;
			uint64_t PRSCLEARMODE:2;
		} __attribute__((packed)) B;
	} PRSSEL;

} __attribute__((packed));

#define LETIMER0 (*(volatile struct LETIMER0_tag *) 0x40066000)

struct LETIMER1_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t REPMODE:2;
			uint64_t UFOA0:2;
			uint64_t UFOA1:2;
			uint64_t OPOL0:1;
			uint64_t OPOL1:1;
			uint64_t BUFTOP:1;
			uint64_t COMP0TOP:1;
			uint64_t reservedSpace0:2;
			uint64_t DEBUGRUN:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t START:1;
			uint64_t STOP:1;
			uint64_t CLEAR:1;
			uint64_t CTO0:1;
			uint64_t CTO1:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RUNNING:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CNT:16;
		} __attribute__((packed)) B;
	} CNT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP0:16;
		} __attribute__((packed)) B;
	} COMP0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP1:16;
		} __attribute__((packed)) B;
	} COMP1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REP0:8;
		} __attribute__((packed)) B;
	} REP0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REP1:8;
		} __attribute__((packed)) B;
	} REP1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP0:1;
			uint64_t COMP1:1;
			uint64_t UF:1;
			uint64_t REP0:1;
			uint64_t REP1:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP0:1;
			uint64_t COMP1:1;
			uint64_t UF:1;
			uint64_t REP0:1;
			uint64_t REP1:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP0:1;
			uint64_t COMP1:1;
			uint64_t UF:1;
			uint64_t REP0:1;
			uint64_t REP1:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP0:1;
			uint64_t COMP1:1;
			uint64_t UF:1;
			uint64_t REP0:1;
			uint64_t REP1:1;
		} __attribute__((packed)) B;
	} IEN;

	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t CMD:1;
		} __attribute__((packed)) B;
	} SYNCBUSY;

	uint8_t res1[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OUT0PEN:1;
			uint64_t OUT1PEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OUT0LOC:6;
			uint64_t reservedSpace0:2;
			uint64_t OUT1LOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	uint8_t res2[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRSSTARTSEL:5;
			uint64_t reservedSpace0:1;
			uint64_t PRSSTOPSEL:5;
			uint64_t reservedSpace1:1;
			uint64_t PRSCLEARSEL:5;
			uint64_t reservedSpace2:1;
			uint64_t PRSSTARTMODE:2;
			uint64_t reservedSpace3:2;
			uint64_t PRSSTOPMODE:2;
			uint64_t reservedSpace4:2;
			uint64_t PRSCLEARMODE:2;
		} __attribute__((packed)) B;
	} PRSSEL;

} __attribute__((packed));

#define LETIMER1 (*(volatile struct LETIMER1_tag *) 0x40066400)

struct CRYOTIMER_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t EN:1;
			uint64_t DEBUGRUN:1;
			uint64_t OSCSEL:2;
			uint64_t reservedSpace0:1;
			uint64_t PRESC:3;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PERIODSEL:6;
		} __attribute__((packed)) B;
	} PERIODSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CNT:32;
		} __attribute__((packed)) B;
	} CNT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EM4WU:1;
		} __attribute__((packed)) B;
	} EM4WUEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PERIOD:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PERIOD:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PERIOD:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PERIOD:1;
		} __attribute__((packed)) B;
	} IEN;

} __attribute__((packed));

#define CRYOTIMER (*(volatile struct CRYOTIMER_tag *) 0x4008f000)

struct PCNT0_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:3;
			uint64_t FILT:1;
			uint64_t RSTEN:1;
			uint64_t CNTRSTEN:1;
			uint64_t AUXCNTRSTEN:1;
			uint64_t DEBUGHALT:1;
			uint64_t HYST:1;
			uint64_t S1CDIR:1;
			uint64_t CNTEV:2;
			uint64_t AUXCNTEV:2;
			uint64_t CNTDIR:1;
			uint64_t EDGE:1;
			uint64_t TCCMODE:2;
			uint64_t reservedSpace0:1;
			uint64_t TCCPRESC:2;
			uint64_t reservedSpace1:1;
			uint64_t TCCCOMP:2;
			uint64_t PRSGATEEN:1;
			uint64_t TCCPRSPOL:1;
			uint64_t TCCPRSSEL:5;
			uint64_t TOPBHFSEL:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LCNTIM:1;
			uint64_t LTOPBIM:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DIR:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CNT:16;
		} __attribute__((packed)) B;
	} CNT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOP:16;
		} __attribute__((packed)) B;
	} TOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOPB:16;
		} __attribute__((packed)) B;
	} TOPB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t UF:1;
			uint64_t OF:1;
			uint64_t DIRCNG:1;
			uint64_t AUXOF:1;
			uint64_t TCC:1;
			uint64_t OQSTERR:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t UF:1;
			uint64_t OF:1;
			uint64_t DIRCNG:1;
			uint64_t AUXOF:1;
			uint64_t TCC:1;
			uint64_t OQSTERR:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t UF:1;
			uint64_t OF:1;
			uint64_t DIRCNG:1;
			uint64_t AUXOF:1;
			uint64_t TCC:1;
			uint64_t OQSTERR:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t UF:1;
			uint64_t OF:1;
			uint64_t DIRCNG:1;
			uint64_t AUXOF:1;
			uint64_t TCC:1;
			uint64_t OQSTERR:1;
		} __attribute__((packed)) B;
	} IEN;

