iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t S0INLOC:6;
			uint64_t reservedSpace0:2;
			uint64_t S1INLOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	uint8_t res1[16];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REGFREEZE:1;
		} __attribute__((packed)) B;
	} FREEZE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CTRL:1;
			uint64_t CMD:1;
			uint64_t TOPB:1;
			uint64_t OVSCFG:1;
		} __attribute__((packed)) B;
	} SYNCBUSY;

	uint8_t res2[28];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t AUXCNT:16;
		} __attribute__((packed)) B;
	} AUXCNT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t S0PRSSEL:5;
			uint64_t S0PRSEN:1;
			uint64_t S1PRSSEL:5;
			uint64_t S1PRSEN:1;
		} __attribute__((packed)) B;
	} INPUT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FILTLEN:8;
			uint64_t reservedSpace0:4;
			uint64_t FLUTTERRM:1;
		} __attribute__((packed)) B;
	} OVSCFG;

} __attribute__((packed));

#define PCNT0 (*(volatile struct PCNT0_tag *) 0x4006e000)

struct PCNT1_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:3;
			uint64_t FILT:1;
			uint64_t RSTEN:1;
			uint64_t CNTRSTEN:1;
			uint64_t AUXCNTRSTEN:1;
			uint64_t DEBUGHALT:1;
			uint64_t HYST:1;
			uint64_t S1CDIR:1;
			uint64_t CNTEV:2;
			uint64_t AUXCNTEV:2;
			uint64_t CNTDIR:1;
			uint64_t EDGE:1;
			uint64_t TCCMODE:2;
			uint64_t reservedSpace0:1;
			uint64_t TCCPRESC:2;
			uint64_t reservedSpace1:1;
			uint64_t TCCCOMP:2;
			uint64_t PRSGATEEN:1;
			uint64_t TCCPRSPOL:1;
			uint64_t TCCPRSSEL:5;
			uint64_t TOPBHFSEL:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LCNTIM:1;
			uint64_t LTOPBIM:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DIR:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CNT:16;
		} __attribute__((packed)) B;
	} CNT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOP:16;
		} __attribute__((packed)) B;
	} TOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOPB:16;
		} __attribute__((packed)) B;
	} TOPB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t UF:1;
			uint64_t OF:1;
			uint64_t DIRCNG:1;
			uint64_t AUXOF:1;
			uint64_t TCC:1;
			uint64_t OQSTERR:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t UF:1;
			uint64_t OF:1;
			uint64_t DIRCNG:1;
			uint64_t AUXOF:1;
			uint64_t TCC:1;
			uint64_t OQSTERR:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t UF:1;
			uint64_t OF:1;
			uint64_t DIRCNG:1;
			uint64_t AUXOF:1;
			uint64_t TCC:1;
			uint64_t OQSTERR:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t UF:1;
			uint64_t OF:1;
			uint64_t DIRCNG:1;
			uint64_t AUXOF:1;
			uint64_t TCC:1;
			uint64_t OQSTERR:1;
		} __attribute__((packed)) B;
	} IEN;

	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t S0INLOC:6;
			uint64_t reservedSpace0:2;
			uint64_t S1INLOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	uint8_t res1[16];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REGFREEZE:1;
		} __attribute__((packed)) B;
	} FREEZE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CTRL:1;
			uint64_t CMD:1;
			uint64_t TOPB:1;
			uint64_t OVSCFG:1;
		} __attribute__((packed)) B;
	} SYNCBUSY;

	uint8_t res2[28];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t AUXCNT:16;
		} __attribute__((packed)) B;
	} AUXCNT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t S0PRSSEL:5;
			uint64_t S0PRSEN:1;
			uint64_t S1PRSSEL:5;
			uint64_t S1PRSEN:1;
		} __attribute__((packed)) B;
	} INPUT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FILTLEN:8;
			uint64_t reservedSpace0:4;
			uint64_t FLUTTERRM:1;
		} __attribute__((packed)) B;
	} OVSCFG;

} __attribute__((packed));

#define PCNT1 (*(volatile struct PCNT1_tag *) 0x4006e400)

struct PCNT2_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:3;
			uint64_t FILT:1;
			uint64_t RSTEN:1;
			uint64_t CNTRSTEN:1;
			uint64_t AUXCNTRSTEN:1;
			uint64_t DEBUGHALT:1;
			uint64_t HYST:1;
			uint64_t S1CDIR:1;
			uint64_t CNTEV:2;
			uint64_t AUXCNTEV:2;
			uint64_t CNTDIR:1;
			uint64_t EDGE:1;
			uint64_t TCCMODE:2;
			uint64_t reservedSpace0:1;
			uint64_t TCCPRESC:2;
			uint64_t reservedSpace1:1;
			uint64_t TCCCOMP:2;
			uint64_t PRSGATEEN:1;
			uint64_t TCCPRSPOL:1;
			uint64_t TCCPRSSEL:5;
			uint64_t TOPBHFSEL:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LCNTIM:1;
			uint64_t LTOPBIM:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DIR:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CNT:16;
		} __attribute__((packed)) B;
	} CNT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOP:16;
		} __attribute__((packed)) B;
	} TOP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOPB:16;
		} __attribute__((packed)) B;
	} TOPB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t UF:1;
			uint64_t OF:1;
			uint64_t DIRCNG:1;
			uint64_t AUXOF:1;
			uint64_t TCC:1;
			uint64_t OQSTERR:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t UF:1;
			uint64_t OF:1;
			uint64_t DIRCNG:1;
			uint64_t AUXOF:1;
			uint64_t TCC:1;
			uint64_t OQSTERR:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t UF:1;
			uint64_t OF:1;
			uint64_t DIRCNG:1;
			uint64_t AUXOF:1;
			uint64_t TCC:1;
			uint64_t OQSTERR:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t UF:1;
			uint64_t OF:1;
			uint64_t DIRCNG:1;
			uint64_t AUXOF:1;
			uint64_t TCC:1;
			uint64_t OQSTERR:1;
		} __attribute__((packed)) B;
	} IEN;

	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t S0INLOC:6;
			uint64_t reservedSpace0:2;
			uint64_t S1INLOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	uint8_t res1[16];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REGFREEZE:1;
		} __attribute__((packed)) B;
	} FREEZE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CTRL:1;
			uint64_t CMD:1;
			uint64_t TOPB:1;
			uint64_t OVSCFG:1;
		} __attribute__((packed)) B;
	} SYNCBUSY;

