iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SINGLESTART:1;
			uint64_t SINGLESTOP:1;
			uint64_t SCANSTART:1;
			uint64_t SCANSTOP:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SINGLEACT:1;
			uint64_t SCANACT:1;
			uint64_t SCANPENDING:1;
			uint64_t reservedSpace0:5;
			uint64_t SINGLEREFWARM:1;
			uint64_t SCANREFWARM:1;
			uint64_t PROGERR:2;
			uint64_t WARM:1;
			uint64_t reservedSpace1:3;
			uint64_t SINGLEDV:1;
			uint64_t SCANDV:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REP:1;
			uint64_t DIFF:1;
			uint64_t ADJ:1;
			uint64_t RES:2;
			uint64_t REF:3;
			uint64_t POSSEL:8;
			uint64_t NEGSEL:8;
			uint64_t AT:4;
			uint64_t reservedSpace0:1;
			uint64_t PRSEN:1;
			uint64_t reservedSpace1:1;
			uint64_t CMPEN:1;
		} __attribute__((packed)) B;
	} SINGLECTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VREFSEL:3;
			uint64_t VREFATTFIX:1;
			uint64_t VREFATT:4;
			uint64_t VINATT:4;
			uint64_t DVL:2;
			uint64_t FIFOOFACT:1;
			uint64_t reservedSpace0:1;
			uint64_t PRSMODE:1;
			uint64_t PRSSEL:5;
			uint64_t CONVSTARTDELAY:5;
			uint64_t CONVSTARTDELAYEN:1;
			uint64_t reservedSpace1:1;
			uint64_t REPDELAY:3;
		} __attribute__((packed)) B;
	} SINGLECTRLX;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REP:1;
			uint64_t DIFF:1;
			uint64_t ADJ:1;
			uint64_t RES:2;
			uint64_t REF:3;
			uint64_t reservedSpace0:16;
			uint64_t AT:4;
			uint64_t reservedSpace1:1;
			uint64_t PRSEN:1;
			uint64_t reservedSpace2:1;
			uint64_t CMPEN:1;
		} __attribute__((packed)) B;
	} SCANCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VREFSEL:3;
			uint64_t VREFATTFIX:1;
			uint64_t VREFATT:4;
			uint64_t VINATT:4;
			uint64_t DVL:2;
			uint64_t FIFOOFACT:1;
			uint64_t reservedSpace0:1;
			uint64_t PRSMODE:1;
			uint64_t PRSSEL:5;
			uint64_t CONVSTARTDELAY:5;
			uint64_t CONVSTARTDELAYEN:1;
			uint64_t reservedSpace1:1;
			uint64_t REPDELAY:3;
		} __attribute__((packed)) B;
	} SCANCTRLX;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SCANINPUTEN:32;
		} __attribute__((packed)) B;
	} SCANMASK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INPUT0TO7SEL:5;
			uint64_t reservedSpace0:3;
			uint64_t INPUT8TO15SEL:5;
			uint64_t reservedSpace1:3;
			uint64_t INPUT16TO23SEL:5;
			uint64_t reservedSpace2:3;
			uint64_t INPUT24TO31SEL:5;
		} __attribute__((packed)) B;
	} SCANINPUTSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INPUT0NEGSEL:2;
			uint64_t INPUT2NEGSEL:2;
			uint64_t INPUT4NEGSEL:2;
			uint64_t INPUT6NEGSEL:2;
			uint64_t INPUT9NEGSEL:2;
			uint64_t INPUT11NEGSEL:2;
			uint64_t INPUT13NEGSEL:2;
			uint64_t INPUT15NEGSEL:2;
		} __attribute__((packed)) B;
	} SCANNEGSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADLT:16;
			uint64_t ADGT:16;
		} __attribute__((packed)) B;
	} CMPTHR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADCBIASPROG:4;
			uint64_t reservedSpace0:8;
			uint64_t VFAULTCLR:1;
			uint64_t reservedSpace1:3;
			uint64_t GPBIASACC:1;
		} __attribute__((packed)) B;
	} BIASPROG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SINGLEOFFSET:4;
			uint64_t SINGLEOFFSETINV:4;
			uint64_t SINGLEGAIN:7;
			uint64_t OFFSETINVMODE:1;
			uint64_t SCANOFFSET:4;
			uint64_t SCANOFFSETINV:4;
			uint64_t SCANGAIN:7;
			uint64_t CALEN:1;
		} __attribute__((packed)) B;
	} CAL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SINGLE:1;
			uint64_t SCAN:1;
			uint64_t reservedSpace0:6;
			uint64_t SINGLEOF:1;
			uint64_t SCANOF:1;
			uint64_t SINGLEUF:1;
			uint64_t SCANUF:1;
			uint64_t reservedSpace1:4;
			uint64_t SINGLECMP:1;
			uint64_t SCANCMP:1;
			uint64_t reservedSpace2:6;
			uint64_t VREFOV:1;
			uint64_t PROGERR:1;
			uint64_t SCANEXTPEND:1;
			uint64_t SCANPEND:1;
			uint64_t PRSTIMEDERR:1;
			uint64_t EM23ERR:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:8;
			uint64_t SINGLEOF:1;
			uint64_t SCANOF:1;
			uint64_t SINGLEUF:1;
			uint64_t SCANUF:1;
			uint64_t reservedSpace1:4;
			uint64_t SINGLECMP:1;
			uint64_t SCANCMP:1;
			uint64_t reservedSpace2:6;
			uint64_t VREFOV:1;
			uint64_t PROGERR:1;
			uint64_t SCANEXTPEND:1;
			uint64_t SCANPEND:1;
			uint64_t PRSTIMEDERR:1;
			uint64_t EM23ERR:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:8;
			uint64_t SINGLEOF:1;
			uint64_t SCANOF:1;
			uint64_t SINGLEUF:1;
			uint64_t SCANUF:1;
			uint64_t reservedSpace1:4;
			uint64_t SINGLECMP:1;
			uint64_t SCANCMP:1;
			uint64_t reservedSpace2:6;
			uint64_t VREFOV:1;
			uint64_t PROGERR:1;
			uint64_t SCANEXTPEND:1;
			uint64_t SCANPEND:1;
			uint64_t PRSTIMEDERR:1;
			uint64_t EM23ERR:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SINGLE:1;
			uint64_t SCAN:1;
			uint64_t reservedSpace0:6;
			uint64_t SINGLEOF:1;
			uint64_t SCANOF:1;
			uint64_t SINGLEUF:1;
			uint64_t SCANUF:1;
			uint64_t reservedSpace1:4;
			uint64_t SINGLECMP:1;
			uint64_t SCANCMP:1;
			uint64_t reservedSpace2:6;
			uint64_t VREFOV:1;
			uint64_t PROGERR:1;
			uint64_t SCANEXTPEND:1;
			uint64_t SCANPEND:1;
			uint64_t PRSTIMEDERR:1;
			uint64_t EM23ERR:1;
		} __attribute__((packed)) B;
	} IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:32;
		} __attribute__((packed)) B;
	} SINGLEDATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:32;
		} __attribute__((packed)) B;
	} SCANDATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATAP:32;
		} __attribute__((packed)) B;
	} SINGLEDATAP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATAP:32;
		} __attribute__((packed)) B;
	} SCANDATAP;

	uint8_t res1[16];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:16;
			uint64_t SCANINPUTID:5;
		} __attribute__((packed)) B;
	} SCANDATAX;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATAP:16;
			uint64_t SCANINPUTIDPEEK:5;
		} __attribute__((packed)) B;
	} SCANDATAXP;

