iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t APORT0XREQ:1;
			uint64_t APORT0YREQ:1;
			uint64_t APORT1XREQ:1;
			uint64_t APORT1YREQ:1;
			uint64_t APORT2XREQ:1;
			uint64_t APORT2YREQ:1;
			uint64_t APORT3XREQ:1;
			uint64_t APORT3YREQ:1;
			uint64_t APORT4XREQ:1;
			uint64_t APORT4YREQ:1;
		} __attribute__((packed)) B;
	} APORTREQ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t APORT0XCONFLICT:1;
			uint64_t APORT0YCONFLICT:1;
			uint64_t APORT1XCONFLICT:1;
			uint64_t APORT1YCONFLICT:1;
			uint64_t APORT2XCONFLICT:1;
			uint64_t APORT2YCONFLICT:1;
			uint64_t APORT3XCONFLICT:1;
			uint64_t APORT3YCONFLICT:1;
			uint64_t APORT4XCONFLICT:1;
			uint64_t APORT4YCONFLICT:1;
		} __attribute__((packed)) B;
	} APORTCONFLICT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HYST:4;
			uint64_t reservedSpace0:12;
			uint64_t DIVVA:6;
			uint64_t reservedSpace1:2;
			uint64_t DIVVB:6;
		} __attribute__((packed)) B;
	} HYSTERESIS0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HYST:4;
			uint64_t reservedSpace0:12;
			uint64_t DIVVA:6;
			uint64_t reservedSpace1:2;
			uint64_t DIVVB:6;
		} __attribute__((packed)) B;
	} HYSTERESIS1;

	uint8_t res1[16];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OUTPEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OUTLOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EN:1;
			uint64_t reservedSpace0:3;
			uint64_t APORTSEL:4;
		} __attribute__((packed)) B;
	} EXTIFCTRL;

} __attribute__((packed));

#define ACMP1 (*(volatile struct ACMP1_tag *) 0x40080400)

struct ACMP2_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t EN:1;
			uint64_t reservedSpace0:1;
			uint64_t INACTVAL:1;
			uint64_t GPIOINV:1;
			uint64_t reservedSpace1:4;
			uint64_t APORTXMASTERDIS:1;
			uint64_t APORTYMASTERDIS:1;
			uint64_t APORTVMASTERDIS:1;
			uint64_t reservedSpace2:1;
			uint64_t PWRSEL:3;
			uint64_t ACCURACY:1;
			uint64_t reservedSpace3:2;
			uint64_t INPUTRANGE:2;
			uint64_t IRISE:1;
			uint64_t IFALL:1;
			uint64_t reservedSpace4:2;
			uint64_t BIASPROG:6;
			uint64_t reservedSpace5:1;
			uint64_t FULLBIAS:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t POSSEL:8;
			uint64_t NEGSEL:8;
			uint64_t VASEL:6;
			uint64_t VBSEL:1;
			uint64_t reservedSpace0:1;
			uint64_t VLPSEL:1;
			uint64_t reservedSpace1:1;
			uint64_t CSRESEN:1;
			uint64_t reservedSpace2:1;
			uint64_t CSRESSEL:3;
		} __attribute__((packed)) B;
	} INPUTSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ACMPACT:1;
			uint64_t ACMPOUT:1;
			uint64_t APORTCONFLICT:1;
			uint64_t EXTIFACT:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EDGE:1;
			uint64_t WARMUP:1;
			uint64_t APORTCONFLICT:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EDGE:1;
			uint64_t WARMUP:1;
			uint64_t APORTCONFLICT:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EDGE:1;
			uint64_t WARMUP:1;
			uint64_t APORTCONFLICT:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EDGE:1;
			uint64_t WARMUP:1;
			uint64_t APORTCONFLICT:1;
		} __attribute__((packed)) B;
	} IEN;

	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t APORT0XREQ:1;
			uint64_t APORT0YREQ:1;
			uint64_t APORT1XREQ:1;
			uint64_t APORT1YREQ:1;
			uint64_t APORT2XREQ:1;
			uint64_t APORT2YREQ:1;
			uint64_t APORT3XREQ:1;
			uint64_t APORT3YREQ:1;
			uint64_t APORT4XREQ:1;
			uint64_t APORT4YREQ:1;
		} __attribute__((packed)) B;
	} APORTREQ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t APORT0XCONFLICT:1;
			uint64_t APORT0YCONFLICT:1;
			uint64_t APORT1XCONFLICT:1;
			uint64_t APORT1YCONFLICT:1;
			uint64_t APORT2XCONFLICT:1;
			uint64_t APORT2YCONFLICT:1;
			uint64_t APORT3XCONFLICT:1;
			uint64_t APORT3YCONFLICT:1;
			uint64_t APORT4XCONFLICT:1;
			uint64_t APORT4YCONFLICT:1;
		} __attribute__((packed)) B;
	} APORTCONFLICT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HYST:4;
			uint64_t reservedSpace0:12;
			uint64_t DIVVA:6;
			uint64_t reservedSpace1:2;
			uint64_t DIVVB:6;
		} __attribute__((packed)) B;
	} HYSTERESIS0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HYST:4;
			uint64_t reservedSpace0:12;
			uint64_t DIVVA:6;
			uint64_t reservedSpace1:2;
			uint64_t DIVVB:6;
		} __attribute__((packed)) B;
	} HYSTERESIS1;

	uint8_t res1[16];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OUTPEN:1;
		} __attribute__((packed)) B;
	} ROUTEPEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OUTLOC:6;
		} __attribute__((packed)) B;
	} ROUTELOC0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EN:1;
			uint64_t reservedSpace0:3;
			uint64_t APORTSEL:4;
		} __attribute__((packed)) B;
	} EXTIFCTRL;

} __attribute__((packed));

#define ACMP2 (*(volatile struct ACMP2_tag *) 0x40080800)

struct ACMP3_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t EN:1;
			uint64_t reservedSpace0:1;
			uint64_t INACTVAL:1;
			uint64_t GPIOINV:1;
			uint64_t reservedSpace1:4;
			uint64_t APORTXMASTERDIS:1;
			uint64_t APORTYMASTERDIS:1;
			uint64_t APORTVMASTERDIS:1;
			uint64_t reservedSpace2:1;
			uint64_t PWRSEL:3;
			uint64_t ACCURACY:1;
			uint64_t reservedSpace3:2;
			uint64_t INPUTRANGE:2;
			uint64_t IRISE:1;
			uint64_t IFALL:1;
			uint64_t reservedSpace4:2;
			uint64_t BIASPROG:6;
			uint64_t reservedSpace5:1;
			uint64_t FULLBIAS:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t POSSEL:8;
			uint64_t NEGSEL:8;
			uint64_t VASEL:6;
			uint64_t VBSEL:1;
			uint64_t reservedSpace0:1;
			uint64_t VLPSEL:1;
			uint64_t reservedSpace1:1;
			uint64_t CSRESEN:1;
			uint64_t reservedSpace2:1;
			uint64_t CSRESSEL:3;
		} __attribute__((packed)) B;
	} INPUTSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ACMPACT:1;
			uint64_t ACMPOUT:1;
			uint64_t APORTCONFLICT:1;
			uint64_t EXTIFACT:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EDGE:1;
			uint64_t WARMUP:1;
			uint64_t APORTCONFLICT:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EDGE:1;
			uint64_t WARMUP:1;
			uint64_t APORTCONFLICT:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EDGE:1;
			uint64_t WARMUP:1;
			uint64_t APORTCONFLICT:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EDGE:1;
			uint64_t WARMUP:1;
			uint64_t APORTCONFLICT:1;
		} __attribute__((packed)) B;
	} IEN;

