iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res6[740];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FSLSPCLKSEL:2;
			uint64_t FSLSSUPP:1;
			uint64_t reservedSpace0:4;
			uint64_t ENA32KHZS:1;
			uint64_t RESVALID:8;
			uint64_t reservedSpace1:15;
			uint64_t MODECHTIMEN:1;
		} __attribute__((packed)) B;
	} HCFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FRINT:16;
			uint64_t HFIRRLDCTRL:1;
		} __attribute__((packed)) B;
	} HFIR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FRNUM:16;
			uint64_t FRREM:16;
		} __attribute__((packed)) B;
	} HFNUM;

	uint8_t res7[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PTXFSPCAVAIL:16;
			uint64_t PTXQSPCAVAIL:8;
			uint64_t PTXQTOP:8;
		} __attribute__((packed)) B;
	} HPTXSTS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HAINT:14;
		} __attribute__((packed)) B;
	} HAINT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HAINTMSK:14;
		} __attribute__((packed)) B;
	} HAINTMSK;

	uint8_t res8[36];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTCONNSTS:1;
			uint64_t PRTCONNDET:1;
			uint64_t PRTENA:1;
			uint64_t PRTENCHNG:1;
			uint64_t PRTOVRCURRACT:1;
			uint64_t PRTOVRCURRCHNG:1;
			uint64_t PRTRES:1;
			uint64_t PRTSUSP:1;
			uint64_t PRTRST:1;
			uint64_t reservedSpace0:1;
			uint64_t PRTLNSTS:2;
			uint64_t PRTPWR:1;
			uint64_t PRTTSTCTL:4;
			uint64_t PRTSPD:2;
		} __attribute__((packed)) B;
	} HPRT;

	uint8_t res9[188];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC0_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC0_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC0_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC0_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC0_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC0_DMAADDR;

	uint8_t res10[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC1_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC1_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC1_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC1_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC1_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC1_DMAADDR;

	uint8_t res11[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC2_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC2_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC2_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC2_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC2_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC2_DMAADDR;

	uint8_t res12[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC3_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC3_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC3_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC3_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC3_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC3_DMAADDR;

	uint8_t res13[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC4_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC4_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC4_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC4_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC4_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC4_DMAADDR;

	uint8_t res14[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC5_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC5_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC5_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC5_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC5_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC5_DMAADDR;

	uint8_t res15[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC6_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC6_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC6_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC6_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC6_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC6_DMAADDR;

	uint8_t res16[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC7_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC7_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC7_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC7_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC7_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC7_DMAADDR;

	uint8_t res17[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC8_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC8_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC8_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC8_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC8_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC8_DMAADDR;

	uint8_t res18[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC9_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC9_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC9_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC9_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC9_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC9_DMAADDR;

	uint8_t res19[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC10_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC10_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC10_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC10_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC10_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC10_DMAADDR;

	uint8_t res20[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC11_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC11_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC11_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC11_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC11_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC11_DMAADDR;

	uint8_t res21[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC12_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC12_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC12_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC12_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC12_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC12_DMAADDR;

	uint8_t res22[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t EPNUM:4;
			uint64_t EPDIR:1;
			uint64_t reservedSpace0:1;
			uint64_t LSPDDEV:1;
			uint64_t EPTYPE:2;
			uint64_t MC:2;
			uint64_t DEVADDR:7;
			uint64_t ODDFRM:1;
			uint64_t CHDIS:1;
			uint64_t CHENA:1;
		} __attribute__((packed)) B;
	} HC13_CHAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRTADDR:7;
			uint64_t HUBADDR:7;
			uint64_t XACTPOS:2;
			uint64_t COMPSPLT:1;
			uint64_t reservedSpace0:14;
			uint64_t SPLTENA:1;
		} __attribute__((packed)) B;
	} HC13_SPLT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t CHHLTD:1;
			uint64_t AHBERR:1;
			uint64_t STALL:1;
			uint64_t NAK:1;
			uint64_t ACK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERR:1;
			uint64_t BBLERR:1;
			uint64_t FRMOVRUN:1;
			uint64_t DATATGLERR:1;
		} __attribute__((packed)) B;
	} HC13_INT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t CHHLTDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t STALLMSK:1;
			uint64_t NAKMSK:1;
			uint64_t ACKMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t XACTERRMSK:1;
			uint64_t BBLERRMSK:1;
			uint64_t FRMOVRUNMSK:1;
			uint64_t DATATGLERRMSK:1;
		} __attribute__((packed)) B;
	} HC13_INTMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t PID:2;
		} __attribute__((packed)) B;
	} HC13_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} HC13_DMAADDR;

	uint8_t res23[328];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DEVSPD:2;
			uint64_t NZSTSOUTHSHK:1;
			uint64_t ENA32KHZSUSP:1;
			uint64_t DEVADDR:7;
			uint64_t PERFRINT:2;
			uint64_t ENDEVOUTNAK:1;
			uint64_t XCVRDLY:1;
			uint64_t ERRATICINTMSK:1;
			uint64_t reservedSpace0:10;
			uint64_t RESVALID:6;
		} __attribute__((packed)) B;
	} DCFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RMTWKUPSIG:1;
			uint64_t SFTDISCON:1;
			uint64_t GNPINNAKSTS:1;
			uint64_t GOUTNAKSTS:1;
			uint64_t TSTCTL:3;
			uint64_t SGNPINNAK:1;
			uint64_t CGNPINNAK:1;
			uint64_t SGOUTNAK:1;
			uint64_t CGOUTNAK:1;
			uint64_t PWRONPRGDONE:1;
			uint64_t reservedSpace0:3;
			uint64_t IGNRFRMNUM:1;
			uint64_t NAKONBBLE:1;
		} __attribute__((packed)) B;
	} DCTL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SUSPSTS:1;
			uint64_t ENUMSPD:2;
			uint64_t ERRTICERR:1;
			uint64_t reservedSpace0:4;
			uint64_t SOFFN:14;
			uint64_t DEVLNSTS:2;
		} __attribute__((packed)) B;
	} DSTS;

	uint8_t res24[4];

