iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t EPDISBLDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t TIMEOUTMSK:1;
			uint64_t INTKNTXFEMPMSK:1;
			uint64_t INTKNEPMISMSK:1;
			uint64_t INEPNAKEFFMSK:1;
			uint64_t reservedSpace0:1;
			uint64_t TXFIFOUNDRNMSK:1;
			uint64_t reservedSpace1:4;
			uint64_t NAKMSK:1;
		} __attribute__((packed)) B;
	} DIEPMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPLMSK:1;
			uint64_t EPDISBLDMSK:1;
			uint64_t AHBERRMSK:1;
			uint64_t SETUPMSK:1;
			uint64_t OUTTKNEPDISMSK:1;
			uint64_t STSPHSERCVDMSK:1;
			uint64_t BACK2BACKSETUP:1;
			uint64_t reservedSpace0:1;
			uint64_t OUTPKTERRMSK:1;
			uint64_t reservedSpace1:3;
			uint64_t BBLEERRMSK:1;
			uint64_t NAKMSK:1;
		} __attribute__((packed)) B;
	} DOEPMSK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INEPINT0:1;
			uint64_t INEPINT1:1;
			uint64_t INEPINT2:1;
			uint64_t INEPINT3:1;
			uint64_t INEPINT4:1;
			uint64_t INEPINT5:1;
			uint64_t INEPINT6:1;
			uint64_t reservedSpace0:9;
			uint64_t OUTEPINT0:1;
			uint64_t OUTEPINT1:1;
			uint64_t OUTEPINT2:1;
			uint64_t OUTEPINT3:1;
			uint64_t OUTEPINT4:1;
			uint64_t OUTEPINT5:1;
			uint64_t OUTEPINT6:1;
		} __attribute__((packed)) B;
	} DAINT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INEPMSK0:1;
			uint64_t INEPMSK1:1;
			uint64_t INEPMSK2:1;
			uint64_t INEPMSK3:1;
			uint64_t INEPMSK4:1;
			uint64_t INEPMSK5:1;
			uint64_t INEPMSK6:1;
			uint64_t reservedSpace0:9;
			uint64_t OUTEPMSK0:1;
			uint64_t OUTEPMSK1:1;
			uint64_t OUTEPMSK2:1;
			uint64_t OUTEPMSK3:1;
			uint64_t OUTEPMSK4:1;
			uint64_t OUTEPMSK5:1;
			uint64_t OUTEPMSK6:1;
		} __attribute__((packed)) B;
	} DAINTMSK;

	uint8_t res25[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DVBUSDIS:16;
		} __attribute__((packed)) B;
	} DVBUSDIS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DVBUSPULSE:12;
		} __attribute__((packed)) B;
	} DVBUSPULSE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t NONISOTHREN:1;
			uint64_t ISOTHREN:1;
			uint64_t TXTHRLEN:9;
			uint64_t AHBTHRRATIO:2;
			uint64_t reservedSpace0:3;
			uint64_t RXTHREN:1;
			uint64_t RXTHRLEN:9;
			uint64_t reservedSpace1:1;
			uint64_t ARBPRKEN:1;
		} __attribute__((packed)) B;
	} DTHRCTL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INEPTXFEMPMSK:16;
		} __attribute__((packed)) B;
	} DIEPEMPMSK;

	uint8_t res26[200];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:2;
			uint64_t reservedSpace0:13;
			uint64_t USBACTEP:1;
			uint64_t reservedSpace1:1;
			uint64_t NAKSTS:1;
			uint64_t EPTYPE:2;
			uint64_t reservedSpace2:1;
			uint64_t STALL:1;
			uint64_t TXFNUM:4;
			uint64_t CNAK:1;
			uint64_t SNAK:1;
			uint64_t reservedSpace3:2;
			uint64_t EPDIS:1;
			uint64_t EPENA:1;
		} __attribute__((packed)) B;
	} DIEP0CTL;

	uint8_t res27[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t EPDISBLD:1;
			uint64_t AHBERR:1;
			uint64_t TIMEOUT:1;
			uint64_t INTKNTXFEMP:1;
			uint64_t INTKNEPMIS:1;
			uint64_t INEPNAKEFF:1;
			uint64_t TXFEMP:1;
			uint64_t TXFIFOUNDRN:1;
			uint64_t reservedSpace0:2;
			uint64_t PKTDRPSTS:1;
			uint64_t BBLEERR:1;
			uint64_t NAKINTRPT:1;
		} __attribute__((packed)) B;
	} DIEP0INT;

	uint8_t res28[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:7;
			uint64_t reservedSpace0:12;
			uint64_t PKTCNT:2;
		} __attribute__((packed)) B;
	} DIEP0TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} DIEP0DMAADDR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SPCAVAIL:16;
		} __attribute__((packed)) B;
	} DIEP0TXFSTS;

	uint8_t res29[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t reservedSpace0:4;
			uint64_t USBACTEP:1;
			uint64_t DPID:1;
			uint64_t NAKSTS:1;
			uint64_t EPTYPE:2;
			uint64_t reservedSpace1:1;
			uint64_t STALL:1;
			uint64_t TXFNUM:4;
			uint64_t CNAK:1;
			uint64_t SNAK:1;
			uint64_t SETD0PIDEF:1;
			uint64_t SETD1PIDOF:1;
			uint64_t EPDIS:1;
			uint64_t EPENA:1;
		} __attribute__((packed)) B;
	} DIEP0_CTL;

	uint8_t res30[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t EPDISBLD:1;
			uint64_t AHBERR:1;
			uint64_t TIMEOUT:1;
			uint64_t INTKNTXFEMP:1;
			uint64_t INTKNEPMIS:1;
			uint64_t INEPNAKEFF:1;
			uint64_t TXFEMP:1;
			uint64_t TXFIFOUNDRN:1;
			uint64_t reservedSpace0:2;
			uint64_t PKTDRPSTS:1;
			uint64_t BBLEERR:1;
			uint64_t NAKINTRPT:1;
		} __attribute__((packed)) B;
	} DIEP0_INT;

	uint8_t res31[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t MC:2;
		} __attribute__((packed)) B;
	} DIEP0_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} DIEP0_DMAADDR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SPCAVAIL:16;
		} __attribute__((packed)) B;
	} DIEP0_DTXFSTS;

	uint8_t res32[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t reservedSpace0:4;
			uint64_t USBACTEP:1;
			uint64_t DPID:1;
			uint64_t NAKSTS:1;
			uint64_t EPTYPE:2;
			uint64_t reservedSpace1:1;
			uint64_t STALL:1;
			uint64_t TXFNUM:4;
			uint64_t CNAK:1;
			uint64_t SNAK:1;
			uint64_t SETD0PIDEF:1;
			uint64_t SETD1PIDOF:1;
			uint64_t EPDIS:1;
			uint64_t EPENA:1;
		} __attribute__((packed)) B;
	} DIEP1_CTL;

	uint8_t res33[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t EPDISBLD:1;
			uint64_t AHBERR:1;
			uint64_t TIMEOUT:1;
			uint64_t INTKNTXFEMP:1;
			uint64_t INTKNEPMIS:1;
			uint64_t INEPNAKEFF:1;
			uint64_t TXFEMP:1;
			uint64_t TXFIFOUNDRN:1;
			uint64_t reservedSpace0:2;
			uint64_t PKTDRPSTS:1;
			uint64_t BBLEERR:1;
			uint64_t NAKINTRPT:1;
		} __attribute__((packed)) B;
	} DIEP1_INT;

	uint8_t res34[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t MC:2;
		} __attribute__((packed)) B;
	} DIEP1_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} DIEP1_DMAADDR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SPCAVAIL:16;
		} __attribute__((packed)) B;
	} DIEP1_DTXFSTS;

