iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res35[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t reservedSpace0:4;
			uint64_t USBACTEP:1;
			uint64_t DPID:1;
			uint64_t NAKSTS:1;
			uint64_t EPTYPE:2;
			uint64_t reservedSpace1:1;
			uint64_t STALL:1;
			uint64_t TXFNUM:4;
			uint64_t CNAK:1;
			uint64_t SNAK:1;
			uint64_t SETD0PIDEF:1;
			uint64_t SETD1PIDOF:1;
			uint64_t EPDIS:1;
			uint64_t EPENA:1;
		} __attribute__((packed)) B;
	} DIEP2_CTL;

	uint8_t res36[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t EPDISBLD:1;
			uint64_t AHBERR:1;
			uint64_t TIMEOUT:1;
			uint64_t INTKNTXFEMP:1;
			uint64_t INTKNEPMIS:1;
			uint64_t INEPNAKEFF:1;
			uint64_t TXFEMP:1;
			uint64_t TXFIFOUNDRN:1;
			uint64_t reservedSpace0:2;
			uint64_t PKTDRPSTS:1;
			uint64_t BBLEERR:1;
			uint64_t NAKINTRPT:1;
		} __attribute__((packed)) B;
	} DIEP2_INT;

	uint8_t res37[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t MC:2;
		} __attribute__((packed)) B;
	} DIEP2_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} DIEP2_DMAADDR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SPCAVAIL:16;
		} __attribute__((packed)) B;
	} DIEP2_DTXFSTS;

	uint8_t res38[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t reservedSpace0:4;
			uint64_t USBACTEP:1;
			uint64_t DPID:1;
			uint64_t NAKSTS:1;
			uint64_t EPTYPE:2;
			uint64_t reservedSpace1:1;
			uint64_t STALL:1;
			uint64_t TXFNUM:4;
			uint64_t CNAK:1;
			uint64_t SNAK:1;
			uint64_t SETD0PIDEF:1;
			uint64_t SETD1PIDOF:1;
			uint64_t EPDIS:1;
			uint64_t EPENA:1;
		} __attribute__((packed)) B;
	} DIEP3_CTL;

	uint8_t res39[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t EPDISBLD:1;
			uint64_t AHBERR:1;
			uint64_t TIMEOUT:1;
			uint64_t INTKNTXFEMP:1;
			uint64_t INTKNEPMIS:1;
			uint64_t INEPNAKEFF:1;
			uint64_t TXFEMP:1;
			uint64_t TXFIFOUNDRN:1;
			uint64_t reservedSpace0:2;
			uint64_t PKTDRPSTS:1;
			uint64_t BBLEERR:1;
			uint64_t NAKINTRPT:1;
		} __attribute__((packed)) B;
	} DIEP3_INT;

	uint8_t res40[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t MC:2;
		} __attribute__((packed)) B;
	} DIEP3_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} DIEP3_DMAADDR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SPCAVAIL:16;
		} __attribute__((packed)) B;
	} DIEP3_DTXFSTS;

	uint8_t res41[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t reservedSpace0:4;
			uint64_t USBACTEP:1;
			uint64_t DPID:1;
			uint64_t NAKSTS:1;
			uint64_t EPTYPE:2;
			uint64_t reservedSpace1:1;
			uint64_t STALL:1;
			uint64_t TXFNUM:4;
			uint64_t CNAK:1;
			uint64_t SNAK:1;
			uint64_t SETD0PIDEF:1;
			uint64_t SETD1PIDOF:1;
			uint64_t EPDIS:1;
			uint64_t EPENA:1;
		} __attribute__((packed)) B;
	} DIEP4_CTL;

	uint8_t res42[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t EPDISBLD:1;
			uint64_t AHBERR:1;
			uint64_t TIMEOUT:1;
			uint64_t INTKNTXFEMP:1;
			uint64_t INTKNEPMIS:1;
			uint64_t INEPNAKEFF:1;
			uint64_t TXFEMP:1;
			uint64_t TXFIFOUNDRN:1;
			uint64_t reservedSpace0:2;
			uint64_t PKTDRPSTS:1;
			uint64_t BBLEERR:1;
			uint64_t NAKINTRPT:1;
		} __attribute__((packed)) B;
	} DIEP4_INT;

	uint8_t res43[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t MC:2;
		} __attribute__((packed)) B;
	} DIEP4_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} DIEP4_DMAADDR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SPCAVAIL:16;
		} __attribute__((packed)) B;
	} DIEP4_DTXFSTS;

	uint8_t res44[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t reservedSpace0:4;
			uint64_t USBACTEP:1;
			uint64_t DPID:1;
			uint64_t NAKSTS:1;
			uint64_t EPTYPE:2;
			uint64_t reservedSpace1:1;
			uint64_t STALL:1;
			uint64_t TXFNUM:4;
			uint64_t CNAK:1;
			uint64_t SNAK:1;
			uint64_t SETD0PIDEF:1;
			uint64_t SETD1PIDOF:1;
			uint64_t EPDIS:1;
			uint64_t EPENA:1;
		} __attribute__((packed)) B;
	} DIEP5_CTL;

	uint8_t res45[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t EPDISBLD:1;
			uint64_t AHBERR:1;
			uint64_t TIMEOUT:1;
			uint64_t INTKNTXFEMP:1;
			uint64_t INTKNEPMIS:1;
			uint64_t INEPNAKEFF:1;
			uint64_t TXFEMP:1;
			uint64_t TXFIFOUNDRN:1;
			uint64_t reservedSpace0:2;
			uint64_t PKTDRPSTS:1;
			uint64_t BBLEERR:1;
			uint64_t NAKINTRPT:1;
		} __attribute__((packed)) B;
	} DIEP5_INT;

	uint8_t res46[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t MC:2;
		} __attribute__((packed)) B;
	} DIEP5_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} DIEP5_DMAADDR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SPCAVAIL:16;
		} __attribute__((packed)) B;
	} DIEP5_DTXFSTS;

	uint8_t res47[292];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:2;
			uint64_t reservedSpace0:13;
			uint64_t USBACTEP:1;
			uint64_t reservedSpace1:1;
			uint64_t NAKSTS:1;
			uint64_t EPTYPE:2;
			uint64_t SNP:1;
			uint64_t STALL:1;
			uint64_t reservedSpace2:4;
			uint64_t CNAK:1;
			uint64_t SNAK:1;
			uint64_t reservedSpace3:2;
			uint64_t EPDIS:1;
			uint64_t EPENA:1;
		} __attribute__((packed)) B;
	} DOEP0CTL;

	uint8_t res48[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t EPDISBLD:1;
			uint64_t AHBERR:1;
			uint64_t SETUP:1;
			uint64_t OUTTKNEPDIS:1;
			uint64_t STSPHSERCVD:1;
			uint64_t BACK2BACKSETUP:1;
			uint64_t reservedSpace0:1;
			uint64_t OUTPKTERR:1;
			uint64_t reservedSpace1:2;
			uint64_t PKTDRPSTS:1;
			uint64_t BBLEERR:1;
			uint64_t NAKINTRPT:1;
			uint64_t reservedSpace2:1;
			uint64_t STUPPKTRCVD:1;
		} __attribute__((packed)) B;
	} DOEP0INT;

	uint8_t res49[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:7;
			uint64_t reservedSpace0:12;
			uint64_t PKTCNT:1;
			uint64_t reservedSpace1:9;
			uint64_t SUPCNT:2;
		} __attribute__((packed)) B;
	} DOEP0TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} DOEP0DMAADDR;

	uint8_t res50[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t reservedSpace0:4;
			uint64_t USBACTEP:1;
			uint64_t DPID:1;
			uint64_t NAKSTS:1;
			uint64_t EPTYPE:2;
			uint64_t SNP:1;
			uint64_t STALL:1;
			uint64_t reservedSpace1:4;
			uint64_t CNAK:1;
			uint64_t SNAK:1;
			uint64_t SETD0PIDEF:1;
			uint64_t SETD1PIDOF:1;
			uint64_t EPDIS:1;
			uint64_t EPENA:1;
		} __attribute__((packed)) B;
	} DOEP0_CTL;

	uint8_t res51[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t EPDISBLD:1;
			uint64_t AHBERR:1;
			uint64_t SETUP:1;
			uint64_t OUTTKNEPDIS:1;
			uint64_t STSPHSERCVD:1;
			uint64_t BACK2BACKSETUP:1;
			uint64_t reservedSpace0:1;
			uint64_t OUTPKTERR:1;
			uint64_t reservedSpace1:2;
			uint64_t PKTDRPSTS:1;
			uint64_t BBLEERR:1;
			uint64_t NAKINTRPT:1;
			uint64_t reservedSpace2:1;
			uint64_t STUPPKTRCVD:1;
		} __attribute__((packed)) B;
	} DOEP0_INT;

	uint8_t res52[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t RXDPID:2;
		} __attribute__((packed)) B;
	} DOEP0_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} DOEP0_DMAADDR;

	uint8_t res53[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t reservedSpace0:4;
			uint64_t USBACTEP:1;
			uint64_t DPID:1;
			uint64_t NAKSTS:1;
			uint64_t EPTYPE:2;
			uint64_t SNP:1;
			uint64_t STALL:1;
			uint64_t reservedSpace1:4;
			uint64_t CNAK:1;
			uint64_t SNAK:1;
			uint64_t SETD0PIDEF:1;
			uint64_t SETD1PIDOF:1;
			uint64_t EPDIS:1;
			uint64_t EPENA:1;
		} __attribute__((packed)) B;
	} DOEP1_CTL;

	uint8_t res54[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t EPDISBLD:1;
			uint64_t AHBERR:1;
			uint64_t SETUP:1;
			uint64_t OUTTKNEPDIS:1;
			uint64_t STSPHSERCVD:1;
			uint64_t BACK2BACKSETUP:1;
			uint64_t reservedSpace0:1;
			uint64_t OUTPKTERR:1;
			uint64_t reservedSpace1:2;
			uint64_t PKTDRPSTS:1;
			uint64_t BBLEERR:1;
			uint64_t NAKINTRPT:1;
			uint64_t reservedSpace2:1;
			uint64_t STUPPKTRCVD:1;
		} __attribute__((packed)) B;
	} DOEP1_INT;

	uint8_t res55[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERSIZE:19;
			uint64_t PKTCNT:10;
			uint64_t RXDPID:2;
		} __attribute__((packed)) B;
	} DOEP1_TSIZ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMAADDR:32;
		} __attribute__((packed)) B;
	} DOEP1_DMAADDR;

	uint8_t res56[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MPS:11;
			uint64_t reservedSpace0:4;
			uint64_t USBACTEP:1;
			uint64_t DPID:1;
			uint64_t NAKSTS:1;
			uint64_t EPTYPE:2;
			uint64_t SNP:1;
			uint64_t STALL:1;
			uint64_t reservedSpace1:4;
			uint64_t CNAK:1;
			uint64_t SNAK:1;
			uint64_t SETD0PIDEF:1;
			uint64_t SETD1PIDOF:1;
			uint64_t EPDIS:1;
			uint64_t EPENA:1;
		} __attribute__((packed)) B;
	} DOEP2_CTL;

	uint8_t res57[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XFERCOMPL:1;
			uint64_t EPDISBLD:1;
			uint64_t AHBERR:1;
			uint64_t SETUP:1;
			uint64_t OUTTKNEPDIS:1;
			uint64_t STSPHSERCVD:1;
			uint64_t BACK2BACKSETUP:1;
			uint64_t reservedSpace0:1;
			uint64_t OUTPKTERR:1;
			uint64_t reservedSpace1:2;
			uint64_t PKTDRPSTS:1;
			uint64_t BBLEERR:1;
			uint64_t NAKINTRPT:1;
			uint64_t reservedSpace2:1;
			uint64_t STUPPKTRCVD:1;
		} __attribute__((packed)) B;
	} DOEP2_INT;

