iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
#define IDAC0 (*(volatile struct IDAC0_tag *) 0x40084000)

struct CSEN_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t EN:1;
			uint64_t CMPPOL:1;
			uint64_t reservedSpace1:1;
			uint64_t CM:2;
			uint64_t reservedSpace2:2;
			uint64_t SARCR:2;
			uint64_t reservedSpace3:2;
			uint64_t ACU:3;
			uint64_t MCEN:1;
			uint64_t STM:2;
			uint64_t CMPEN:1;
			uint64_t DRSF:1;
			uint64_t DMAEN:1;
			uint64_t CONVSEL:1;
			uint64_t CHOPEN:1;
			uint64_t AUTOGND:1;
			uint64_t MXUC:1;
			uint64_t EMACMPEN:1;
			uint64_t WARMUPMODE:1;
			uint64_t LOCALSENS:1;
			uint64_t CPACCURACY:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PCPRESC:3;
			uint64_t reservedSpace0:5;
			uint64_t PCTOP:8;
			uint64_t WARMUPCNT:2;
		} __attribute__((packed)) B;
	} TIMCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t START:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CSENBUSY:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRSSEL:5;
		} __attribute__((packed)) B;
	} PRSSEL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:32;
		} __attribute__((packed)) B;
	} DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SCANINPUTEN:32;
		} __attribute__((packed)) B;
	} SCANMASK0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INPUT0TO7SEL:4;
			uint64_t reservedSpace0:4;
			uint64_t INPUT8TO15SEL:4;
			uint64_t reservedSpace1:4;
			uint64_t INPUT16TO23SEL:4;
			uint64_t reservedSpace2:4;
			uint64_t INPUT24TO31SEL:4;
		} __attribute__((packed)) B;
	} SCANINPUTSEL0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SCANINPUTEN:32;
		} __attribute__((packed)) B;
	} SCANMASK1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t INPUT32TO39SEL:4;
			uint64_t reservedSpace0:4;
			uint64_t INPUT40TO47SEL:4;
			uint64_t reservedSpace1:4;
			uint64_t INPUT48TO55SEL:4;
			uint64_t reservedSpace2:4;
			uint64_t INPUT56TO63SEL:4;
		} __attribute__((packed)) B;
	} SCANINPUTSEL1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:2;
			uint64_t APORT1XREQ:1;
			uint64_t APORT1YREQ:1;
			uint64_t APORT2XREQ:1;
			uint64_t APORT2YREQ:1;
			uint64_t APORT3XREQ:1;
			uint64_t APORT3YREQ:1;
			uint64_t APORT4XREQ:1;
			uint64_t APORT4YREQ:1;
		} __attribute__((packed)) B;
	} APORTREQ;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:2;
			uint64_t APORT1XCONFLICT:1;
			uint64_t APORT1YCONFLICT:1;
			uint64_t APORT2XCONFLICT:1;
			uint64_t APORT2YCONFLICT:1;
			uint64_t APORT3XCONFLICT:1;
			uint64_t APORT3YCONFLICT:1;
			uint64_t APORT4XCONFLICT:1;
			uint64_t APORT4YCONFLICT:1;
		} __attribute__((packed)) B;
	} APORTCONFLICT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMPTHR:16;
		} __attribute__((packed)) B;
	} CMPTHR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EMA:22;
		} __attribute__((packed)) B;
	} EMA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EMASAMPLE:3;
		} __attribute__((packed)) B;
	} EMACTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:4;
			uint64_t SINGLESEL:7;
		} __attribute__((packed)) B;
	} SINGLECTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t BASELINEUP:16;
			uint64_t BASELINEDN:16;
		} __attribute__((packed)) B;
	} DMBASELINE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DMG:8;
			uint64_t DMR:4;
			uint64_t reservedSpace0:4;
			uint64_t DMCR:4;
			uint64_t CRMODE:2;
			uint64_t reservedSpace1:6;
			uint64_t DMGRDIS:1;
		} __attribute__((packed)) B;
	} DMCFG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:4;
			uint64_t IREFPROG:3;
			uint64_t reservedSpace1:1;
			uint64_t IDACIREFS:3;
			uint64_t reservedSpace2:9;
			uint64_t TRSTPROG:3;
		} __attribute__((packed)) B;
	} ANACTRL;

	uint8_t res0[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMP:1;
			uint64_t CONV:1;
			uint64_t EOS:1;
			uint64_t DMAOF:1;
			uint64_t APORTCONFLICT:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMP:1;
			uint64_t CONV:1;
			uint64_t EOS:1;
			uint64_t DMAOF:1;
			uint64_t APORTCONFLICT:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMP:1;
			uint64_t CONV:1;
			uint64_t EOS:1;
			uint64_t DMAOF:1;
			uint64_t APORTCONFLICT:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CMP:1;
			uint64_t CONV:1;
			uint64_t EOS:1;
			uint64_t DMAOF:1;
			uint64_t APORTCONFLICT:1;
		} __attribute__((packed)) B;
	} IEN;

} __attribute__((packed));

#define CSEN (*(volatile struct CSEN_tag *) 0x4008e000)

struct LCD_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t EN:1;
			uint64_t UDCTRL:2;
			uint64_t reservedSpace0:20;
			uint64_t DSC:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MUX:3;
			uint64_t reservedSpace0:1;
			uint64_t WAVE:1;
			uint64_t reservedSpace1:3;
			uint64_t CONTRAST:6;
			uint64_t reservedSpace2:6;
			uint64_t CHGRDST:3;
			uint64_t reservedSpace3:1;
			uint64_t BIAS:2;
			uint64_t reservedSpace4:2;
			uint64_t MODE:2;
		} __attribute__((packed)) B;
	} DISPCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGEN:32;
		} __attribute__((packed)) B;
	} SEGEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t BLINKEN:1;
			uint64_t BLANK:1;
			uint64_t AEN:1;
			uint64_t AREGASC:2;
			uint64_t AREGBSC:2;
			uint64_t ALOGSEL:1;
			uint64_t FCEN:1;
			uint64_t reservedSpace0:7;
			uint64_t FCPRESC:2;
			uint64_t FCTOP:6;
			uint64_t reservedSpace1:4;
			uint64_t ALOC:1;
		} __attribute__((packed)) B;
	} BACTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ASTATE:4;
			uint64_t reservedSpace0:4;
			uint64_t BLINK:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t AREGA:8;
		} __attribute__((packed)) B;
	} AREGA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t AREGB:8;
		} __attribute__((packed)) B;
	} AREGB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FC:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FC:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FC:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FC:1;
		} __attribute__((packed)) B;
	} IEN;

