iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SPEED:3;
			uint64_t reservedSpace0:1;
			uint64_t BUFDRV:4;
			uint64_t reservedSpace1:2;
			uint64_t BUFBIAS:3;
		} __attribute__((packed)) B;
	} BIASCTRL;

	uint8_t res1[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD0L:32;
		} __attribute__((packed)) B;
	} SEGD0L;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD1L:32;
		} __attribute__((packed)) B;
	} SEGD1L;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD2L:32;
		} __attribute__((packed)) B;
	} SEGD2L;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD3L:32;
		} __attribute__((packed)) B;
	} SEGD3L;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD0H:8;
		} __attribute__((packed)) B;
	} SEGD0H;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD1H:8;
		} __attribute__((packed)) B;
	} SEGD1H;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD2H:8;
		} __attribute__((packed)) B;
	} SEGD2H;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD3H:8;
		} __attribute__((packed)) B;
	} SEGD3H;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD4L:32;
		} __attribute__((packed)) B;
	} SEGD4L;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD5L:32;
		} __attribute__((packed)) B;
	} SEGD5L;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD6L:32;
		} __attribute__((packed)) B;
	} SEGD6L;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD7L:32;
		} __attribute__((packed)) B;
	} SEGD7L;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD4H:8;
		} __attribute__((packed)) B;
	} SEGD4H;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD5H:8;
		} __attribute__((packed)) B;
	} SEGD5H;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD6H:8;
		} __attribute__((packed)) B;
	} SEGD6H;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGD7H:8;
		} __attribute__((packed)) B;
	} SEGD7H;

	uint8_t res2[64];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REGFREEZE:1;
			uint64_t LCDGATE:1;
		} __attribute__((packed)) B;
	} FREEZE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CTRL:1;
			uint64_t BACTRL:1;
			uint64_t AREGA:1;
			uint64_t AREGB:1;
			uint64_t SEGD0L:1;
			uint64_t SEGD1L:1;
			uint64_t SEGD2L:1;
			uint64_t SEGD3L:1;
			uint64_t SEGD0H:1;
			uint64_t SEGD1H:1;
			uint64_t SEGD2H:1;
			uint64_t SEGD3H:1;
			uint64_t SEGD4L:1;
			uint64_t SEGD5L:1;
			uint64_t SEGD6L:1;
			uint64_t SEGD7L:1;
			uint64_t SEGD4H:1;
			uint64_t SEGD5H:1;
			uint64_t SEGD6H:1;
			uint64_t SEGD7H:1;
		} __attribute__((packed)) B;
	} SYNCBUSY;

	uint8_t res3[40];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FRDIV:9;
		} __attribute__((packed)) B;
	} FRAMERATE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SEGEN2:8;
		} __attribute__((packed)) B;
	} SEGEN2;

} __attribute__((packed));

#define LCD (*(volatile struct LCD_tag *) 0x40054000)

struct RTC_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t EN:1;
			uint64_t DEBUGRUN:1;
			uint64_t COMP0TOP:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CNT:24;
		} __attribute__((packed)) B;
	} CNT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t COMP:6;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t COMP:6;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t COMP:6;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t COMP:6;
		} __attribute__((packed)) B;
	} IEN;

	uint8_t res0[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:24;
		} __attribute__((packed)) B;
	} COMPA_COMP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:24;
		} __attribute__((packed)) B;
	} COMPB_COMP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:24;
		} __attribute__((packed)) B;
	} COMPC_COMP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:24;
		} __attribute__((packed)) B;
	} COMPD_COMP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:24;
		} __attribute__((packed)) B;
	} COMPE_COMP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:24;
		} __attribute__((packed)) B;
	} COMPF_COMP;

} __attribute__((packed));

#define RTC (*(volatile struct RTC_tag *) 0x40060000)

struct RTCC_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t ENABLE:1;
			uint64_t reservedSpace0:1;
			uint64_t DEBUGRUN:1;
			uint64_t reservedSpace1:1;
			uint64_t PRECCV0TOP:1;
			uint64_t CCV1TOP:1;
			uint64_t reservedSpace2:2;
			uint64_t CNTPRESC:4;
			uint64_t CNTTICK:1;
			uint64_t reservedSpace3:1;
			uint64_t BUMODETSEN:1;
			uint64_t OSCFDETEN:1;
			uint64_t CNTMODE:1;
			uint64_t LYEARCORRDIS:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRECNT:15;
		} __attribute__((packed)) B;
	} PRECNT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CNT:32;
		} __attribute__((packed)) B;
	} CNT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRECNT:15;
			uint64_t CNTLSB:17;
		} __attribute__((packed)) B;
	} COMBCNT;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SECU:4;
			uint64_t SECT:3;
			uint64_t reservedSpace0:1;
			uint64_t MINU:4;
			uint64_t MINT:3;
			uint64_t reservedSpace1:1;
			uint64_t HOURU:4;
			uint64_t HOURT:2;
		} __attribute__((packed)) B;
	} TIME;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DAYOMU:4;
			uint64_t DAYOMT:2;
			uint64_t reservedSpace0:2;
			uint64_t MONTHU:4;
			uint64_t MONTHT:1;
			uint64_t reservedSpace1:3;
			uint64_t YEARU:4;
			uint64_t YEART:4;
			uint64_t DAYOW:3;
		} __attribute__((packed)) B;
	} DATE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t OSCFAIL:1;
			uint64_t CNTTICK:1;
			uint64_t MINTICK:1;
			uint64_t HOURTICK:1;
			uint64_t DAYTICK:1;
			uint64_t DAYOWOF:1;
			uint64_t MONTHTICK:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t OSCFAIL:1;
			uint64_t CNTTICK:1;
			uint64_t MINTICK:1;
			uint64_t HOURTICK:1;
			uint64_t DAYTICK:1;
			uint64_t DAYOWOF:1;
			uint64_t MONTHTICK:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t OSCFAIL:1;
			uint64_t CNTTICK:1;
			uint64_t MINTICK:1;
			uint64_t HOURTICK:1;
			uint64_t DAYTICK:1;
			uint64_t DAYOWOF:1;
			uint64_t MONTHTICK:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OF:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t OSCFAIL:1;
			uint64_t CNTTICK:1;
			uint64_t MINTICK:1;
			uint64_t HOURTICK:1;
			uint64_t DAYTICK:1;
			uint64_t DAYOWOF:1;
			uint64_t MONTHTICK:1;
		} __attribute__((packed)) B;
	} IEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t BUMODETS:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CLRSTATUS:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:5;
			uint64_t CMD:1;
		} __attribute__((packed)) B;
	} SYNCBUSY;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RAM:1;
		} __attribute__((packed)) B;
	} POWERDOWN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOCKKEY:16;
		} __attribute__((packed)) B;
	} LOCK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EM4WU:1;
		} __attribute__((packed)) B;
	} EM4WUEN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t CMOA:2;
			uint64_t ICEDGE:2;
			uint64_t PRSSEL:5;
			uint64_t COMPBASE:1;
			uint64_t COMPMASK:5;
			uint64_t DAYCC:1;
		} __attribute__((packed)) B;
	} CC0_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCV:32;
		} __attribute__((packed)) B;
	} CC0_CCV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SECU:4;
			uint64_t SECT:3;
			uint64_t reservedSpace0:1;
			uint64_t MINU:4;
			uint64_t MINT:3;
			uint64_t reservedSpace1:1;
			uint64_t HOURU:4;
			uint64_t HOURT:2;
		} __attribute__((packed)) B;
	} CC0_TIME;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DAYU:4;
			uint64_t DAYT:2;
			uint64_t reservedSpace0:2;
			uint64_t MONTHU:4;
			uint64_t MONTHT:1;
		} __attribute__((packed)) B;
	} CC0_DATE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t CMOA:2;
			uint64_t ICEDGE:2;
			uint64_t PRSSEL:5;
			uint64_t COMPBASE:1;
			uint64_t COMPMASK:5;
			uint64_t DAYCC:1;
		} __attribute__((packed)) B;
	} CC1_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCV:32;
		} __attribute__((packed)) B;
	} CC1_CCV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SECU:4;
			uint64_t SECT:3;
			uint64_t reservedSpace0:1;
			uint64_t MINU:4;
			uint64_t MINT:3;
			uint64_t reservedSpace1:1;
			uint64_t HOURU:4;
			uint64_t HOURT:2;
		} __attribute__((packed)) B;
	} CC1_TIME;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DAYU:4;
			uint64_t DAYT:2;
			uint64_t reservedSpace0:2;
			uint64_t MONTHU:4;
			uint64_t MONTHT:1;
		} __attribute__((packed)) B;
	} CC1_DATE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MODE:2;
			uint64_t CMOA:2;
			uint64_t ICEDGE:2;
			uint64_t PRSSEL:5;
			uint64_t COMPBASE:1;
			uint64_t COMPMASK:5;
			uint64_t DAYCC:1;
		} __attribute__((packed)) B;
	} CC2_CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCV:32;
		} __attribute__((packed)) B;
	} CC2_CCV;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SECU:4;
			uint64_t SECT:3;
			uint64_t reservedSpace0:1;
			uint64_t MINU:4;
			uint64_t MINT:3;
			uint64_t reservedSpace1:1;
			uint64_t HOURU:4;
			uint64_t HOURT:2;
		} __attribute__((packed)) B;
	} CC2_TIME;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DAYU:4;
			uint64_t DAYT:2;
			uint64_t reservedSpace0:2;
			uint64_t MONTHU:4;
			uint64_t MONTHT:1;
		} __attribute__((packed)) B;
	} CC2_DATE;

	uint8_t res0[148];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET0_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET1_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET2_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET3_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET4_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET5_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET6_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET7_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET8_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET9_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET10_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET11_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET12_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET13_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET14_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET15_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET16_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET17_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET18_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET19_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET20_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET21_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET22_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET23_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET24_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET25_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET26_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET27_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET28_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET29_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET30_REG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t REG:32;
		} __attribute__((packed)) B;
	} RET31_REG;

} __attribute__((packed));

