iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
#define RTCC (*(volatile struct RTCC_tag *) 0x40062000)

struct WDOG0_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t EN:1;
			uint64_t DEBUGRUN:1;
			uint64_t EM2RUN:1;
			uint64_t EM3RUN:1;
			uint64_t LOCK:1;
			uint64_t EM4BLOCK:1;
			uint64_t SWOSCBLOCK:1;
			uint64_t reservedSpace0:1;
			uint64_t PERSEL:4;
			uint64_t CLKSEL:2;
			uint64_t reservedSpace1:2;
			uint64_t WARNSEL:2;
			uint64_t reservedSpace2:6;
			uint64_t WINSEL:3;
			uint64_t reservedSpace3:3;
			uint64_t CLRSRC:1;
			uint64_t WDOGRSTDIS:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CLEAR:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CTRL:1;
			uint64_t CMD:1;
			uint64_t PCH0_PRSCTRL:1;
			uint64_t PCH1_PRSCTRL:1;
		} __attribute__((packed)) B;
	} SYNCBUSY;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRSSEL:5;
			uint64_t reservedSpace0:3;
			uint64_t PRSMISSRSTEN:1;
		} __attribute__((packed)) B;
	} PCH0_PRSCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRSSEL:5;
			uint64_t reservedSpace0:3;
			uint64_t PRSMISSRSTEN:1;
		} __attribute__((packed)) B;
	} PCH1_PRSCTRL;

	uint8_t res0[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOUT:1;
			uint64_t WARN:1;
			uint64_t WIN:1;
			uint64_t PEM0:1;
			uint64_t PEM1:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOUT:1;
			uint64_t WARN:1;
			uint64_t WIN:1;
			uint64_t PEM0:1;
			uint64_t PEM1:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOUT:1;
			uint64_t WARN:1;
			uint64_t WIN:1;
			uint64_t PEM0:1;
			uint64_t PEM1:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOUT:1;
			uint64_t WARN:1;
			uint64_t WIN:1;
			uint64_t PEM0:1;
			uint64_t PEM1:1;
		} __attribute__((packed)) B;
	} IEN;

} __attribute__((packed));

#define WDOG0 (*(volatile struct WDOG0_tag *) 0x40052000)

struct WDOG1_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t EN:1;
			uint64_t DEBUGRUN:1;
			uint64_t EM2RUN:1;
			uint64_t EM3RUN:1;
			uint64_t LOCK:1;
			uint64_t EM4BLOCK:1;
			uint64_t SWOSCBLOCK:1;
			uint64_t reservedSpace0:1;
			uint64_t PERSEL:4;
			uint64_t CLKSEL:2;
			uint64_t reservedSpace1:2;
			uint64_t WARNSEL:2;
			uint64_t reservedSpace2:6;
			uint64_t WINSEL:3;
			uint64_t reservedSpace3:3;
			uint64_t CLRSRC:1;
			uint64_t WDOGRSTDIS:1;
		} __attribute__((packed)) B;
	} CTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CLEAR:1;
		} __attribute__((packed)) B;
	} CMD;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CTRL:1;
			uint64_t CMD:1;
			uint64_t PCH0_PRSCTRL:1;
			uint64_t PCH1_PRSCTRL:1;
		} __attribute__((packed)) B;
	} SYNCBUSY;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRSSEL:5;
			uint64_t reservedSpace0:3;
			uint64_t PRSMISSRSTEN:1;
		} __attribute__((packed)) B;
	} PCH0_PRSCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PRSSEL:5;
			uint64_t reservedSpace0:3;
			uint64_t PRSMISSRSTEN:1;
		} __attribute__((packed)) B;
	} PCH1_PRSCTRL;

	uint8_t res0[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOUT:1;
			uint64_t WARN:1;
			uint64_t WIN:1;
			uint64_t PEM0:1;
			uint64_t PEM1:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOUT:1;
			uint64_t WARN:1;
			uint64_t WIN:1;
			uint64_t PEM0:1;
			uint64_t PEM1:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOUT:1;
			uint64_t WARN:1;
			uint64_t WIN:1;
			uint64_t PEM0:1;
			uint64_t PEM1:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TOUT:1;
			uint64_t WARN:1;
			uint64_t WIN:1;
			uint64_t PEM0:1;
			uint64_t PEM1:1;
		} __attribute__((packed)) B;
	} IEN;

} __attribute__((packed));

#define WDOG1 (*(volatile struct WDOG1_tag *) 0x40052400)

struct ETM_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t POWERDWN:1;
			uint64_t reservedSpace0:3;
			uint64_t PORTSIZE:3;
			uint64_t STALL:1;
			uint64_t BRANCHOUTPUT:1;
			uint64_t DBGREQCTRL:1;
			uint64_t ETMPROG:1;
			uint64_t ETMPORTSEL:1;
			uint64_t reservedSpace1:1;
			uint64_t PORTMODE2:1;
			uint64_t reservedSpace2:2;
			uint64_t PORTMODE:2;
			uint64_t reservedSpace3:3;
			uint64_t EPORTSIZE:2;
			uint64_t reservedSpace4:5;
			uint64_t TSTAMPEN:1;
		} __attribute__((packed)) B;
	} ETMCR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADRCMPPAIR:4;
			uint64_t DATACMPNUM:4;
			uint64_t MMDECCNT:5;
			uint64_t COUNTNUM:3;
			uint64_t SEQPRES:1;
			uint64_t EXTINPNUM:3;
			uint64_t EXTOUTNUM:3;
			uint64_t FIFOFULLPRES:1;
			uint64_t IDCOMPNUM:2;
			uint64_t TRACESS:1;
			uint64_t MMACCESS:1;
			uint64_t reservedSpace0:3;
			uint64_t ETMID:1;
		} __attribute__((packed)) B;
	} ETMCCR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RESA:7;
			uint64_t RESB:7;
			uint64_t ETMFCN:3;
		} __attribute__((packed)) B;
	} ETMTRIGGER;

	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ETHOF:1;
			uint64_t ETMPROGBIT:1;
			uint64_t TRACESTAT:1;
			uint64_t TRIGBIT:1;
		} __attribute__((packed)) B;
	} ETMSR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MAXPORTSIZE:3;
			uint64_t reservedSpace0:5;
			uint64_t FIFOFULL:1;
			uint64_t MAXPORTSIZE3:1;
			uint64_t PORTSIZE:1;
			uint64_t PORTMODE:1;
			uint64_t PROCNUM:3;
			uint64_t reservedSpace1:2;
			uint64_t NOFETCHCOMP:1;
		} __attribute__((packed)) B;
	} ETMSCR;

	uint8_t res1[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RESA:7;
			uint64_t RESB:7;
			uint64_t ETMFCNEN:3;
		} __attribute__((packed)) B;
	} ETMTEEVR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADRCMP:8;
			uint64_t MEMMAP:16;
			uint64_t INCEXCTL:1;
			uint64_t TCE:1;
		} __attribute__((packed)) B;
	} ETMTECR1;

	uint8_t res2[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t BYTENUM:8;
		} __attribute__((packed)) B;
	} ETMFFLR;

	uint8_t res3[272];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:16;
		} __attribute__((packed)) B;
	} ETMCNTRLDVR1;

	uint8_t res4[156];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FREQ:12;
		} __attribute__((packed)) B;
	} ETMSYNCFR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t IMPVER:4;
			uint64_t ETMMINVER:4;
			uint64_t ETMMAJVER:4;
			uint64_t PROCFAM:4;
			uint64_t LPCF:1;
			uint64_t reservedSpace0:1;
			uint64_t THUMBT:1;
			uint64_t SECEXT:1;
			uint64_t BPE:1;
			uint64_t reservedSpace1:3;
			uint64_t IMPCODE:8;
		} __attribute__((packed)) B;
	} ETMIDR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTINPSEL:2;
			uint64_t reservedSpace0:1;
			uint64_t EXTINPBUS:8;
			uint64_t READREGS:1;
			uint64_t DADDRCMP:1;
			uint64_t INSTRES:3;
			uint64_t EICEWPNT:4;
			uint64_t TEICEWPNT:1;
			uint64_t EICEIMP:1;
			uint64_t TIMP:1;
			uint64_t reservedSpace1:4;
			uint64_t RFCNT:1;
			uint64_t TENC:1;
			uint64_t TSIZE:1;
		} __attribute__((packed)) B;
	} ETMCCER;

