iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14699/emptyTargetInit/DA14699_sfr.h
	uint8_t res5[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STARTRSEL:4;
			uint64_t reservedSpace0:12;
			uint64_t STOPRSEL:4;
		} __attribute__((packed)) B;
	} ETMTESSEICR;

	uint8_t res6[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RESAEVT:7;
			uint64_t RESBEVT:7;
			uint64_t ETMFCNEVT:3;
		} __attribute__((packed)) B;
	} ETMTSEVR;

	uint8_t res7[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TRACEID:7;
		} __attribute__((packed)) B;
	} ETMTRACEIDR;

	uint8_t res8[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RFE:1;
			uint64_t SWP:1;
		} __attribute__((packed)) B;
	} ETMIDR2;

	uint8_t res9[264];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ETMUP:1;
		} __attribute__((packed)) B;
	} ETMPDSR;

	uint8_t res10[3016];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTIN:2;
			uint64_t reservedSpace0:2;
			uint64_t COREHALT:1;
		} __attribute__((packed)) B;
	} ETMISCIN;

	uint8_t res11[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TRIGGEROUT:1;
		} __attribute__((packed)) B;
	} ITTRIGOUT;

	uint8_t res12[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ATREADY:1;
		} __attribute__((packed)) B;
	} ETMITATBCTR2;

	uint8_t res13[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ATVALID:1;
		} __attribute__((packed)) B;
	} ETMITATBCTR0;

	uint8_t res14[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ITEN:1;
		} __attribute__((packed)) B;
	} ETMITCTRL;

	uint8_t res15[156];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SETTAG:8;
		} __attribute__((packed)) B;
	} ETMCLAIMSET;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CLRTAG:1;
		} __attribute__((packed)) B;
	} ETMCLAIMCLR;

	uint8_t res16[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t KEY:1;
		} __attribute__((packed)) B;
	} ETMLAR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LOCKIMP:1;
			uint64_t LOCKED:1;
		} __attribute__((packed)) B;
	} ETMLSR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t NONSECINVDBG:2;
			uint64_t NONSECNONINVDBG:2;
			uint64_t SECINVDBG:2;
			uint64_t SECNONINVDBG:2;
		} __attribute__((packed)) B;
	} ETMAUTHSTATUS;

	uint8_t res17[16];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TRACESRC:4;
			uint64_t PROCTRACE:4;
		} __attribute__((packed)) B;
	} ETMDEVTYPE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CONTCODE:4;
			uint64_t COUNT:4;
		} __attribute__((packed)) B;
	} ETMPIDR4;

	uint32_t ETMPIDR5;
	uint32_t ETMPIDR6;
	uint32_t ETMPIDR7;
	union
	{
		uint32_t R;
		struct
		{
			uint64_t PARTNUM:8;
		} __attribute__((packed)) B;
	} ETMPIDR0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PARTNUM:4;
			uint64_t IDCODE:4;
		} __attribute__((packed)) B;
	} ETMPIDR1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t IDCODE:3;
			uint64_t ALWAYS1:1;
			uint64_t REV:4;
		} __attribute__((packed)) B;
	} ETMPIDR2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CUSTMOD:4;
			uint64_t REVAND:4;
		} __attribute__((packed)) B;
	} ETMPIDR3;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PREAMB:8;
		} __attribute__((packed)) B;
	} ETMCIDR0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PREAMB:8;
		} __attribute__((packed)) B;
	} ETMCIDR1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PREAMB:8;
		} __attribute__((packed)) B;
	} ETMCIDR2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PREAMB:8;
		} __attribute__((packed)) B;
	} ETMCIDR3;

} __attribute__((packed));

#define ETM (*(volatile struct ETM_tag *) 0xe0041000)

struct SMU_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t PPUPRIV:1;
		} __attribute__((packed)) B;
	} IF;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PPUPRIV:1;
		} __attribute__((packed)) B;
	} IFS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PPUPRIV:1;
		} __attribute__((packed)) B;
	} IFC;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PPUPRIV:1;
		} __attribute__((packed)) B;
	} IEN;

	uint8_t res0[36];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ENABLE:1;
		} __attribute__((packed)) B;
	} PPUCTRL;

	uint8_t res1[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ACMP0_bitfield:1;
			uint64_t ACMP1_bitfield:1;
			uint64_t ACMP2_bitfield:1;
			uint64_t ACMP3_bitfield:1;
			uint64_t ADC0_bitfield:1;
			uint64_t ADC1_bitfield:1;
			uint64_t CAN0_bitfield:1;
			uint64_t CAN1_bitfield:1;
			uint64_t CMU_bitfield:1;
			uint64_t CRYOTIMER_bitfield:1;
			uint64_t CRYPTO0_bitfield:1;
			uint64_t CSEN_bitfield:1;
			uint64_t VDAC0_bitfield:1;
			uint64_t PRS_bitfield:1;
			uint64_t EBI_bitfield:1;
			uint64_t EMU_bitfield:1;
			uint64_t ETH_bitfield:1;
			uint64_t FPUEH_bitfield:1;
			uint64_t GPCRC_bitfield:1;
			uint64_t GPIO_bitfield:1;
			uint64_t I2C0_bitfield:1;
			uint64_t I2C1_bitfield:1;
			uint64_t I2C2_bitfield:1;
			uint64_t IDAC0_bitfield:1;
			uint64_t MSC_bitfield:1;
			uint64_t LCD_bitfield:1;
			uint64_t LDMA_bitfield:1;
			uint64_t LESENSE_bitfield:1;
			uint64_t LETIMER0_bitfield:1;
			uint64_t LETIMER1_bitfield:1;
			uint64_t LEUART0_bitfield:1;
			uint64_t LEUART1_bitfield:1;
		} __attribute__((packed)) B;
	} PPUPATD0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PCNT0_bitfield:1;
			uint64_t PCNT1_bitfield:1;
			uint64_t PCNT2_bitfield:1;
			uint64_t QSPI0_bitfield:1;
			uint64_t RMU_bitfield:1;
			uint64_t RTC_bitfield:1;
			uint64_t RTCC_bitfield:1;
			uint64_t SDIO_bitfield:1;
			uint64_t SMU_bitfield:1;
			uint64_t TIMER0_bitfield:1;
			uint64_t TIMER1_bitfield:1;
			uint64_t TIMER2_bitfield:1;
			uint64_t TIMER3_bitfield:1;
			uint64_t TIMER4_bitfield:1;
			uint64_t TIMER5_bitfield:1;
			uint64_t TIMER6_bitfield:1;
			uint64_t TRNG0_bitfield:1;
			uint64_t UART0_bitfield:1;
			uint64_t UART1_bitfield:1;
			uint64_t USART0_bitfield:1;
			uint64_t USART1_bitfield:1;
			uint64_t USART2_bitfield:1;
			uint64_t USART3_bitfield:1;
			uint64_t USART4_bitfield:1;
			uint64_t USART5_bitfield:1;
			uint64_t USB_bitfield:1;
			uint64_t WDOG0_bitfield:1;
			uint64_t WDOG1_bitfield:1;
			uint64_t WTIMER0_bitfield:1;
			uint64_t WTIMER1_bitfield:1;
			uint64_t WTIMER2_bitfield:1;
			uint64_t WTIMER3_bitfield:1;
		} __attribute__((packed)) B;
	} PPUPATD1;

	uint32_t PPUPATD2;
	uint8_t res2[52];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PERIPHID:7;
		} __attribute__((packed)) B;
	} PPUFS;

} __attribute__((packed));

#define SMU (*(volatile struct SMU_tag *) 0x4002000c)

struct TRNG0_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t ENABLE:1;
			uint64_t reservedSpace0:1;
			uint64_t TESTEN:1;
			uint64_t CONDBYPASS:1;
			uint64_t REPCOUNTIEN:1;
			uint64_t APT64IEN:1;
			uint64_t APT4096IEN:1;
			uint64_t FULLIEN:1;
			uint64_t SOFTRESET:1;
			uint64_t PREIEN:1;
			uint64_t ALMIEN:1;
			uint64_t FORCERUN:1;
			uint64_t BYPNIST:1;
			uint64_t BYPAIS31:1;
		} __attribute__((packed)) B;
	} CONTROL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VALUE:32;
		} __attribute__((packed)) B;
	} FIFOLEVEL;

	uint8_t res0[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VALUE:32;
		} __attribute__((packed)) B;
	} FIFODEPTH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VALUE:32;
		} __attribute__((packed)) B;
	} KEY0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VALUE:32;
		} __attribute__((packed)) B;
	} KEY1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VALUE:32;
		} __attribute__((packed)) B;
	} KEY2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VALUE:32;
		} __attribute__((packed)) B;
	} KEY3;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VALUE:32;
		} __attribute__((packed)) B;
	} TESTDATA;

	uint8_t res1[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TESTDATABUSY:1;
			uint64_t reservedSpace0:3;
			uint64_t REPCOUNTIF:1;
			uint64_t APT64IF:1;
			uint64_t APT4096IF:1;
			uint64_t FULLIF:1;
			uint64_t PREIF:1;
			uint64_t ALMIF:1;
		} __attribute__((packed)) B;
	} STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VALUE:8;
		} __attribute__((packed)) B;
	} INITWAITVAL;

	uint8_t res2[200];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t VALUE:32;
		} __attribute__((packed)) B;
	} FIFO;

} __attribute__((packed));

#define TRNG0 (*(volatile struct TRNG0_tag *) 0x4001d000)

